RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
/* CRC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CRC0 base address */
  #define CRC0_BASE                                (0x50095000u)
  /** Peripheral CRC0 base address */
  #define CRC0_BASE_NS                             (0x40095000u)
  /** Peripheral CRC0 base pointer */
  #define CRC0                                     ((CRC_Type *)CRC0_BASE)
  /** Peripheral CRC0 base pointer */
  #define CRC0_NS                                  ((CRC_Type *)CRC0_BASE_NS)
  /** Array initializer of CRC peripheral base addresses */
  #define CRC_BASE_ADDRS                           { CRC0_BASE }
  /** Array initializer of CRC peripheral base pointers */
  #define CRC_BASE_PTRS                            { CRC0 }
  /** Array initializer of CRC peripheral base addresses */
  #define CRC_BASE_ADDRS_NS                        { CRC0_BASE_NS }
  /** Array initializer of CRC peripheral base pointers */
  #define CRC_BASE_PTRS_NS                         { CRC0_NS }
#else
  /** Peripheral CRC0 base address */
  #define CRC0_BASE                                (0x40095000u)
  /** Peripheral CRC0 base pointer */
  #define CRC0                                     ((CRC_Type *)CRC0_BASE)
  /** Array initializer of CRC peripheral base addresses */
  #define CRC_BASE_ADDRS                           { CRC0_BASE }
  /** Array initializer of CRC peripheral base pointers */
  #define CRC_BASE_PTRS                            { CRC0 }
#endif

/*!
 * @}
 */ /* end of group CRC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- CSS Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CSS_Peripheral_Access_Layer CSS Peripheral Access Layer
 * @{
 */

/** CSS - Register Layout Typedef */
typedef struct {
  __I  uint32_t CSS_STATUS;                        /**< Status register, offset: 0x0 */
  __IO uint32_t CSS_CTRL;                          /**< CSS Control register, offset: 0x4 */
  __IO uint32_t CSS_CMDCFG0;                       /**< CSS command configuration register, offset: 0x8 */
  __IO uint32_t CSS_CFG;                           /**< CSS configuration register, offset: 0xC */
  __IO uint32_t CSS_KIDX0;                         /**< Keystore index 0 - for commands that access a single key, offset: 0x10 */
  __IO uint32_t CSS_KIDX1;                         /**< Keystore index 1 - for commands that access 2 keys, offset: 0x14 */
  __IO uint32_t CSS_KPROPIN;                       /**< key properties request, offset: 0x18 */
       uint8_t RESERVED_0[4];
  __IO uint32_t CSS_DMA_SRC0;                      /**< CSS DMA Source 0, offset: 0x20 */
  __IO uint32_t CSS_DMA_SRC0_LEN;                  /**< CSS DMA Source 0 length, offset: 0x24 */
  __IO uint32_t CSS_DMA_SRC1;                      /**< CSS DMA Source 1, offset: 0x28 */
       uint8_t RESERVED_1[4];
  __IO uint32_t CSS_DMA_SRC2;                      /**< CSS DMA Source 2, offset: 0x30 */
  __IO uint32_t CSS_DMA_SRC2_LEN;                  /**< CSS DMA Source 2 length, offset: 0x34 */
  __IO uint32_t CSS_DMA_RES0;                      /**< CSS DMA Result 0, offset: 0x38 */
  __IO uint32_t CSS_DMA_RES0_LEN;                  /**< CSS DMA Result 0 Size, offset: 0x3C */
  __IO uint32_t CSS_INT_ENABLE;                    /**< Interrupt enable, offset: 0x40 */
  __O  uint32_t CSS_INT_STATUS_CLR;                /**< Interrupt status clear, offset: 0x44 */
  __O  uint32_t CSS_INT_STATUS_SET;                /**< Interrupt status set, offset: 0x48 */
  __I  uint32_t CSS_ERR_STATUS;                    /**< Status register, offset: 0x4C */
  __O  uint32_t CSS_ERR_STATUS_CLR;                /**< Interrupt status clear, offset: 0x50 */
  __I  uint32_t CSS_VERSION;                       /**< CSS Version, offset: 0x54 */
       uint8_t RESERVED_2[4];
  __I  uint32_t CSS_PRNG_DATOUT;                   /**< PRNG SW read out register, offset: 0x5C */
  __I  uint32_t CSS_GDET_EVTCNT;                   /**< CSS GDET Event Counter, offset: 0x60 */
  __O  uint32_t CSS_GDET_EVTCNT_CLR;               /**< CSS GDET Event Counter Clear, offset: 0x64 */
       uint8_t RESERVED_3[152];
  __I  uint32_t CSS_SHA2_STATUS;                   /**< CSS SHA2 Status Register, offset: 0x100 */
  __IO uint32_t CSS_SHA2_CTRL;                     /**< SHA2 Control register, offset: 0x104 */
  __IO uint32_t CSS_SHA2_DIN;                      /**< CSS SHA_DATA IN Register 0, offset: 0x108 */
  __I  uint32_t CSS_SHA2_DOUT0;                    /**< CSS CSS_SHA_DATA Out Register 0, offset: 0x10C */
  __I  uint32_t CSS_SHA2_DOUT1;                    /**< CSS SHA_DATA Out Register 1, offset: 0x110 */
  __I  uint32_t CSS_SHA2_DOUT2;                    /**< CSS SHA_DATA Out Register 2, offset: 0x114 */
  __I  uint32_t CSS_SHA2_DOUT3;                    /**< CSS SHA_DATA Out Register 3, offset: 0x118 */
  __I  uint32_t CSS_SHA2_DOUT4;                    /**< CSS SHA_DATA Out Register 4, offset: 0x11C */
  __I  uint32_t CSS_SHA2_DOUT5;                    /**< CSS SHA_DATA Out Register 5, offset: 0x120 */
  __I  uint32_t CSS_SHA2_DOUT6;                    /**< CSS SHA_DATA Out Register 6, offset: 0x124 */
  __I  uint32_t CSS_SHA2_DOUT7;                    /**< CSS SHA_DATA Out Register 7, offset: 0x128 */
  __I  uint32_t CSS_SHA2_DOUT8;                    /**< CSS CSS_SHA_DATA Out Register 8, offset: 0x12C */
  __I  uint32_t CSS_SHA2_DOUT9;                    /**< CSS SHA_DATA Out Register 9, offset: 0x130 */
  __I  uint32_t CSS_SHA2_DOUT10;                   /**< CSS SHA_DATA Out Register 10, offset: 0x134 */
  __I  uint32_t CSS_SHA2_DOUT11;                   /**< CSS SHA_DATA Out Register 11, offset: 0x138 */
  __I  uint32_t CSS_SHA2_DOUT12;                   /**< CSS SHA_DATA Out Register 12, offset: 0x13C */
  __I  uint32_t CSS_SHA2_DOUT13;                   /**< CSS SHA_DATA Out Register 13, offset: 0x140 */
  __I  uint32_t CSS_SHA2_DOUT14;                   /**< CSS SHA_DATA Out Register 14, offset: 0x144 */
  __I  uint32_t CSS_SHA2_DOUT15;                   /**< CSS SHA_DATA Out Register 15, offset: 0x148 */
       uint8_t RESERVED_4[4];
  __I  uint32_t CSS_KS0;                           /**< Status register, offset: 0x150 */
  __I  uint32_t CSS_KS1;                           /**< Status register, offset: 0x154 */
  __I  uint32_t CSS_KS2;                           /**< Status register, offset: 0x158 */
  __I  uint32_t CSS_KS3;                           /**< Status register, offset: 0x15C */
  __I  uint32_t CSS_KS4;                           /**< Status register, offset: 0x160 */
  __I  uint32_t CSS_KS5;                           /**< Status register, offset: 0x164 */
  __I  uint32_t CSS_KS6;                           /**< Status register, offset: 0x168 */
  __I  uint32_t CSS_KS7;                           /**< Status register, offset: 0x16C */
  __I  uint32_t CSS_KS8;                           /**< Status register, offset: 0x170 */
  __I  uint32_t CSS_KS9;                           /**< Status register, offset: 0x174 */
  __I  uint32_t CSS_KS10;                          /**< Status register, offset: 0x178 */
  __I  uint32_t CSS_KS11;                          /**< Status register, offset: 0x17C */
  __I  uint32_t CSS_KS12;                          /**< Status register, offset: 0x180 */
  __I  uint32_t CSS_KS13;                          /**< Status register, offset: 0x184 */
  __I  uint32_t CSS_KS14;                          /**< Status register, offset: 0x188 */
  __I  uint32_t CSS_KS15;                          /**< Status register, offset: 0x18C */
  __I  uint32_t CSS_KS16;                          /**< Status register, offset: 0x190 */
  __I  uint32_t CSS_KS17;                          /**< Status register, offset: 0x194 */
  __I  uint32_t CSS_KS18;                          /**< Status register, offset: 0x198 */
  __I  uint32_t CSS_KS19;                          /**< Status register, offset: 0x19C */
} CSS_Type;

/* ----------------------------------------------------------------------------
   -- CSS Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CSS_Register_Masks CSS Register Masks
 * @{
 */

/*! @name CSS_STATUS - Status register */
/*! @{ */

