RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_STATUS_css_busy_MASK             (0x1U)
#define CSS_CSS_STATUS_css_busy_SHIFT            (0U)
/*! css_busy - High to indicate the CSS is executing a Crypto Sequence
 */
#define CSS_CSS_STATUS_css_busy(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_STATUS_css_busy_SHIFT)) & CSS_CSS_STATUS_css_busy_MASK)

#define CSS_CSS_STATUS_css_irq_MASK              (0x2U)
#define CSS_CSS_STATUS_css_irq_SHIFT             (1U)
/*! css_irq - High to indicate the CSS has an active interrupt
 */
#define CSS_CSS_STATUS_css_irq(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_STATUS_css_irq_SHIFT)) & CSS_CSS_STATUS_css_irq_MASK)

#define CSS_CSS_STATUS_css_err_MASK              (0x4U)
#define CSS_CSS_STATUS_css_err_SHIFT             (2U)
/*! css_err - High to indicate the CSS has detected an internal error
 */
#define CSS_CSS_STATUS_css_err(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_STATUS_css_err_SHIFT)) & CSS_CSS_STATUS_css_err_MASK)

#define CSS_CSS_STATUS_prng_rdy_MASK             (0x8U)
#define CSS_CSS_STATUS_prng_rdy_SHIFT            (3U)
/*! prng_rdy - High to indicate the internal PRNG is ready. SFR
 */
#define CSS_CSS_STATUS_prng_rdy(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_STATUS_prng_rdy_SHIFT)) & CSS_CSS_STATUS_prng_rdy_MASK)

#define CSS_CSS_STATUS_ecdsa_vfy_status_MASK     (0x30U)
#define CSS_CSS_STATUS_ecdsa_vfy_status_SHIFT    (4U)
/*! ecdsa_vfy_status - Signature Verify Result Status
 */
#define CSS_CSS_STATUS_ecdsa_vfy_status(x)       (((uint32_t)(((uint32_t)(x)) << CSS_CSS_STATUS_ecdsa_vfy_status_SHIFT)) & CSS_CSS_STATUS_ecdsa_vfy_status_MASK)

#define CSS_CSS_STATUS_pprot_MASK                (0xC0U)
#define CSS_CSS_STATUS_pprot_SHIFT               (6U)
/*! pprot - Current command privilege level
 */
#define CSS_CSS_STATUS_pprot(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_STATUS_pprot_SHIFT)) & CSS_CSS_STATUS_pprot_MASK)

#define CSS_CSS_STATUS_drbg_ent_lvl_MASK         (0x300U)
#define CSS_CSS_STATUS_drbg_ent_lvl_SHIFT        (8U)
/*! drbg_ent_lvl - Entropy quality of the current DRBG instance. This value
 */
#define CSS_CSS_STATUS_drbg_ent_lvl(x)           (((uint32_t)(((uint32_t)(x)) << CSS_CSS_STATUS_drbg_ent_lvl_SHIFT)) & CSS_CSS_STATUS_drbg_ent_lvl_MASK)

#define CSS_CSS_STATUS_dtrng_busy_MASK           (0x400U)
#define CSS_CSS_STATUS_dtrng_busy_SHIFT          (10U)
/*! dtrng_busy - When set, it indicates the DTRNG is gathering entropy
 */
#define CSS_CSS_STATUS_dtrng_busy(x)             (((uint32_t)(((uint32_t)(x)) << CSS_CSS_STATUS_dtrng_busy_SHIFT)) & CSS_CSS_STATUS_dtrng_busy_MASK)

#define CSS_CSS_STATUS_gdet_irq_pos_MASK         (0x800U)
#define CSS_CSS_STATUS_gdet_irq_pos_SHIFT        (11U)
/*! gdet_irq_pos - IRQ for GDET has detected a negative glitch: active high irq
 */
#define CSS_CSS_STATUS_gdet_irq_pos(x)           (((uint32_t)(((uint32_t)(x)) << CSS_CSS_STATUS_gdet_irq_pos_SHIFT)) & CSS_CSS_STATUS_gdet_irq_pos_MASK)

#define CSS_CSS_STATUS_gdet_irq_neg_MASK         (0x1000U)
#define CSS_CSS_STATUS_gdet_irq_neg_SHIFT        (12U)
/*! gdet_irq_neg - IRQ for GDET has detected a positive glitch: active high irq
 */
#define CSS_CSS_STATUS_gdet_irq_neg(x)           (((uint32_t)(((uint32_t)(x)) << CSS_CSS_STATUS_gdet_irq_neg_SHIFT)) & CSS_CSS_STATUS_gdet_irq_neg_MASK)

#define CSS_CSS_STATUS_status_rsvd_MASK          (0xFFFFE000U)
#define CSS_CSS_STATUS_status_rsvd_SHIFT         (13U)
/*! status_rsvd - reserved
 */
#define CSS_CSS_STATUS_status_rsvd(x)            (((uint32_t)(((uint32_t)(x)) << CSS_CSS_STATUS_status_rsvd_SHIFT)) & CSS_CSS_STATUS_status_rsvd_MASK)
/*! @} */

/*! @name CSS_CTRL - CSS Control register */
/*! @{ */

#define CSS_CSS_CTRL_css_en_MASK                 (0x1U)
#define CSS_CSS_CTRL_css_en_SHIFT                (0U)
/*! css_en - CSS enable 0=CSS disabled, 1= CSS is enabled
 */
#define CSS_CSS_CTRL_css_en(x)                   (((uint32_t)(((uint32_t)(x)) << CSS_CSS_CTRL_css_en_SHIFT)) & CSS_CSS_CTRL_css_en_MASK)

#define CSS_CSS_CTRL_css_start_MASK              (0x2U)
#define CSS_CSS_CTRL_css_start_SHIFT             (1U)
/*! css_start - Write to 1 to start a CSS Operation
 */
#define CSS_CSS_CTRL_css_start(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_CTRL_css_start_SHIFT)) & CSS_CSS_CTRL_css_start_MASK)

#define CSS_CSS_CTRL_css_reset_MASK              (0x4U)
#define CSS_CSS_CTRL_css_reset_SHIFT             (2U)
/*! css_reset - Write to 1 to perform a CSS synchronous Reset
 */
#define CSS_CSS_CTRL_css_reset(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_CTRL_css_reset_SHIFT)) & CSS_CSS_CTRL_css_reset_MASK)

#define CSS_CSS_CTRL_css_cmd_MASK                (0xF8U)
#define CSS_CSS_CTRL_css_cmd_SHIFT               (3U)
/*! css_cmd - CSS Command Field: List of Valid commands:
 */
#define CSS_CSS_CTRL_css_cmd(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_CTRL_css_cmd_SHIFT)) & CSS_CSS_CTRL_css_cmd_MASK)

#define CSS_CSS_CTRL_byte_order_MASK             (0x100U)
#define CSS_CSS_CTRL_byte_order_SHIFT            (8U)
/*! byte_order - Defines Endianness - 1: BigEndian, 0: Little Endian
 */
#define CSS_CSS_CTRL_byte_order(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_CTRL_byte_order_SHIFT)) & CSS_CSS_CTRL_byte_order_MASK)

#define CSS_CSS_CTRL_ctrl_rfu_MASK               (0xFFFFFE00U)
#define CSS_CSS_CTRL_ctrl_rfu_SHIFT              (9U)
/*! ctrl_rfu - reserved
 */
#define CSS_CSS_CTRL_ctrl_rfu(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_CTRL_ctrl_rfu_SHIFT)) & CSS_CSS_CTRL_ctrl_rfu_MASK)
/*! @} */

/*! @name CSS_CMDCFG0 - CSS command configuration register */
/*! @{ */

#define CSS_CSS_CMDCFG0_cmdcfg0_MASK             (0xFFFFFFFFU)
#define CSS_CSS_CMDCFG0_cmdcfg0_SHIFT            (0U)
/*! cmdcfg0 - refer to reference manual for assignment of this field
 */
#define CSS_CSS_CMDCFG0_cmdcfg0(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_CMDCFG0_cmdcfg0_SHIFT)) & CSS_CSS_CMDCFG0_cmdcfg0_MASK)
/*! @} */

/*! @name CSS_CFG - CSS configuration register */
/*! @{ */

#define CSS_CSS_CFG_cfg_rsvd0_MASK               (0xFFFFU)
#define CSS_CSS_CFG_cfg_rsvd0_SHIFT              (0U)
/*! cfg_rsvd0 - reserved
 */
#define CSS_CSS_CFG_cfg_rsvd0(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_CFG_cfg_rsvd0_SHIFT)) & CSS_CSS_CFG_cfg_rsvd0_MASK)

#define CSS_CSS_CFG_adctrl_MASK                  (0x3FF0000U)
#define CSS_CSS_CFG_adctrl_SHIFT                 (16U)
/*! adctrl - maximum aes start delay
 */
#define CSS_CSS_CFG_adctrl(x)                    (((uint32_t)(((uint32_t)(x)) << CSS_CSS_CFG_adctrl_SHIFT)) & CSS_CSS_CFG_adctrl_MASK)

