RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_CFG_cfg_rsvd1_MASK               (0x7C000000U)
#define CSS_CSS_CFG_cfg_rsvd1_SHIFT              (26U)
/*! cfg_rsvd1 - reserved
 */
#define CSS_CSS_CFG_cfg_rsvd1(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_CFG_cfg_rsvd1_SHIFT)) & CSS_CSS_CFG_cfg_rsvd1_MASK)

#define CSS_CSS_CFG_sha2_direct_MASK             (0x80000000U)
#define CSS_CSS_CFG_sha2_direct_SHIFT            (31U)
/*! sha2_direct - 1=enable sha2 direct mode: direct access from external
 */
#define CSS_CSS_CFG_sha2_direct(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_CFG_sha2_direct_SHIFT)) & CSS_CSS_CFG_sha2_direct_MASK)
/*! @} */

/*! @name CSS_KIDX0 - Keystore index 0 - for commands that access a single key */
/*! @{ */

#define CSS_CSS_KIDX0_kidx0_MASK                 (0x7FU)
#define CSS_CSS_KIDX0_kidx0_SHIFT                (0U)
/*! kidx0 - keystore is indexed as an array of 128 bit key slots
 */
#define CSS_CSS_KIDX0_kidx0(x)                   (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KIDX0_kidx0_SHIFT)) & CSS_CSS_KIDX0_kidx0_MASK)

#define CSS_CSS_KIDX0_kidx0_rsvd_MASK            (0xFFFFFF80U)
#define CSS_CSS_KIDX0_kidx0_rsvd_SHIFT           (7U)
/*! kidx0_rsvd - reserved
 */
#define CSS_CSS_KIDX0_kidx0_rsvd(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KIDX0_kidx0_rsvd_SHIFT)) & CSS_CSS_KIDX0_kidx0_rsvd_MASK)
/*! @} */

/*! @name CSS_KIDX1 - Keystore index 1 - for commands that access 2 keys */
/*! @{ */

#define CSS_CSS_KIDX1_kidx1_MASK                 (0x7FU)
#define CSS_CSS_KIDX1_kidx1_SHIFT                (0U)
/*! kidx1 - keystore is indexed as an array of 128 bit key slots
 */
#define CSS_CSS_KIDX1_kidx1(x)                   (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KIDX1_kidx1_SHIFT)) & CSS_CSS_KIDX1_kidx1_MASK)

#define CSS_CSS_KIDX1_kidx1_rsvd_MASK            (0xFFFFFF80U)
#define CSS_CSS_KIDX1_kidx1_rsvd_SHIFT           (7U)
/*! kidx1_rsvd - reserved
 */
#define CSS_CSS_KIDX1_kidx1_rsvd(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KIDX1_kidx1_rsvd_SHIFT)) & CSS_CSS_KIDX1_kidx1_rsvd_MASK)
/*! @} */

/*! @name CSS_KPROPIN - key properties request */
/*! @{ */

#define CSS_CSS_KPROPIN_kpropin_MASK             (0xFFFFFFFFU)
#define CSS_CSS_KPROPIN_kpropin_SHIFT            (0U)
/*! kpropin - for commands that create a key - requested properties
 */
#define CSS_CSS_KPROPIN_kpropin(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KPROPIN_kpropin_SHIFT)) & CSS_CSS_KPROPIN_kpropin_MASK)
/*! @} */

/*! @name CSS_DMA_SRC0 - CSS DMA Source 0 */
/*! @{ */

#define CSS_CSS_DMA_SRC0_addr_src0_MASK          (0xFFFFFFFFU)
#define CSS_CSS_DMA_SRC0_addr_src0_SHIFT         (0U)
/*! addr_src0 - defines the System address of the start of the
 */
#define CSS_CSS_DMA_SRC0_addr_src0(x)            (((uint32_t)(((uint32_t)(x)) << CSS_CSS_DMA_SRC0_addr_src0_SHIFT)) & CSS_CSS_DMA_SRC0_addr_src0_MASK)
/*! @} */

/*! @name CSS_DMA_SRC0_LEN - CSS DMA Source 0 length */
/*! @{ */

#define CSS_CSS_DMA_SRC0_LEN_size_src0_len_MASK  (0xFFFFFFFFU)
#define CSS_CSS_DMA_SRC0_LEN_size_src0_len_SHIFT (0U)
/*! size_src0_len - Size in bytes of the data to be transferred from
 */
#define CSS_CSS_DMA_SRC0_LEN_size_src0_len(x)    (((uint32_t)(((uint32_t)(x)) << CSS_CSS_DMA_SRC0_LEN_size_src0_len_SHIFT)) & CSS_CSS_DMA_SRC0_LEN_size_src0_len_MASK)
/*! @} */

/*! @name CSS_DMA_SRC1 - CSS DMA Source 1 */
/*! @{ */

#define CSS_CSS_DMA_SRC1_addr_src1_MASK          (0xFFFFFFFFU)
#define CSS_CSS_DMA_SRC1_addr_src1_SHIFT         (0U)
/*! addr_src1 - defines the System address of the start of the
 */
#define CSS_CSS_DMA_SRC1_addr_src1(x)            (((uint32_t)(((uint32_t)(x)) << CSS_CSS_DMA_SRC1_addr_src1_SHIFT)) & CSS_CSS_DMA_SRC1_addr_src1_MASK)
/*! @} */

/*! @name CSS_DMA_SRC2 - CSS DMA Source 2 */
/*! @{ */

#define CSS_CSS_DMA_SRC2_addr_src2_MASK          (0xFFFFFFFFU)
#define CSS_CSS_DMA_SRC2_addr_src2_SHIFT         (0U)
/*! addr_src2 - defines the System address of the start of the
 */
#define CSS_CSS_DMA_SRC2_addr_src2(x)            (((uint32_t)(((uint32_t)(x)) << CSS_CSS_DMA_SRC2_addr_src2_SHIFT)) & CSS_CSS_DMA_SRC2_addr_src2_MASK)
/*! @} */

/*! @name CSS_DMA_SRC2_LEN - CSS DMA Source 2 length */
/*! @{ */

#define CSS_CSS_DMA_SRC2_LEN_size_src2_len_MASK  (0xFFFFFFFFU)
#define CSS_CSS_DMA_SRC2_LEN_size_src2_len_SHIFT (0U)
/*! size_src2_len - Size in bytes of the data to be transferred from
 */
#define CSS_CSS_DMA_SRC2_LEN_size_src2_len(x)    (((uint32_t)(((uint32_t)(x)) << CSS_CSS_DMA_SRC2_LEN_size_src2_len_SHIFT)) & CSS_CSS_DMA_SRC2_LEN_size_src2_len_MASK)
/*! @} */

/*! @name CSS_DMA_RES0 - CSS DMA Result 0 */
/*! @{ */

#define CSS_CSS_DMA_RES0_addr_res0_MASK          (0xFFFFFFFFU)
#define CSS_CSS_DMA_RES0_addr_res0_SHIFT         (0U)
/*! addr_res0 - defines the System Start address of where the result
 */
#define CSS_CSS_DMA_RES0_addr_res0(x)            (((uint32_t)(((uint32_t)(x)) << CSS_CSS_DMA_RES0_addr_res0_SHIFT)) & CSS_CSS_DMA_RES0_addr_res0_MASK)
/*! @} */

/*! @name CSS_DMA_RES0_LEN - CSS DMA Result 0 Size */
/*! @{ */

#define CSS_CSS_DMA_RES0_LEN_size_res0_len_MASK  (0xFFFFFFFFU)
#define CSS_CSS_DMA_RES0_LEN_size_res0_len_SHIFT (0U)
/*! size_res0_len - Size in bytes of the data to be transferred to
 */
#define CSS_CSS_DMA_RES0_LEN_size_res0_len(x)    (((uint32_t)(((uint32_t)(x)) << CSS_CSS_DMA_RES0_LEN_size_res0_len_SHIFT)) & CSS_CSS_DMA_RES0_LEN_size_res0_len_MASK)
/*! @} */

/*! @name CSS_INT_ENABLE - Interrupt enable */
/*! @{ */

#define CSS_CSS_INT_ENABLE_int_en_MASK           (0x1U)
#define CSS_CSS_INT_ENABLE_int_en_SHIFT          (0U)
/*! int_en - Interrupt enable bit
 */
#define CSS_CSS_INT_ENABLE_int_en(x)             (((uint32_t)(((uint32_t)(x)) << CSS_CSS_INT_ENABLE_int_en_SHIFT)) & CSS_CSS_INT_ENABLE_int_en_MASK)

#define CSS_CSS_INT_ENABLE_gdet_int_en_MASK      (0x2U)
#define CSS_CSS_INT_ENABLE_gdet_int_en_SHIFT     (1U)
/*! gdet_int_en - GDET Interrupt enable bit
 */
#define CSS_CSS_INT_ENABLE_gdet_int_en(x)        (((uint32_t)(((uint32_t)(x)) << CSS_CSS_INT_ENABLE_gdet_int_en_SHIFT)) & CSS_CSS_INT_ENABLE_gdet_int_en_MASK)

#define CSS_CSS_INT_ENABLE_int_ena_rsvd_MASK     (0xFFFFFFFCU)
#define CSS_CSS_INT_ENABLE_int_ena_rsvd_SHIFT    (2U)
/*! int_ena_rsvd - reserved
 */
#define CSS_CSS_INT_ENABLE_int_ena_rsvd(x)       (((uint32_t)(((uint32_t)(x)) << CSS_CSS_INT_ENABLE_int_ena_rsvd_SHIFT)) & CSS_CSS_INT_ENABLE_int_ena_rsvd_MASK)
/*! @} */

/*! @name CSS_INT_STATUS_CLR - Interrupt status clear */
/*! @{ */

