RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_INT_STATUS_CLR_int_clr_MASK      (0x1U)
#define CSS_CSS_INT_STATUS_CLR_int_clr_SHIFT     (0U)
/*! int_clr - Interrupt status clear
 */
#define CSS_CSS_INT_STATUS_CLR_int_clr(x)        (((uint32_t)(((uint32_t)(x)) << CSS_CSS_INT_STATUS_CLR_int_clr_SHIFT)) & CSS_CSS_INT_STATUS_CLR_int_clr_MASK)

#define CSS_CSS_INT_STATUS_CLR_gdet_int_clr_MASK (0x2U)
#define CSS_CSS_INT_STATUS_CLR_gdet_int_clr_SHIFT (1U)
/*! gdet_int_clr - GDET Interrupt status clear
 */
#define CSS_CSS_INT_STATUS_CLR_gdet_int_clr(x)   (((uint32_t)(((uint32_t)(x)) << CSS_CSS_INT_STATUS_CLR_gdet_int_clr_SHIFT)) & CSS_CSS_INT_STATUS_CLR_gdet_int_clr_MASK)

#define CSS_CSS_INT_STATUS_CLR_int_stsc_rsvd_MASK (0xFFFFFFFCU)
#define CSS_CSS_INT_STATUS_CLR_int_stsc_rsvd_SHIFT (2U)
/*! int_stsc_rsvd - reserved
 */
#define CSS_CSS_INT_STATUS_CLR_int_stsc_rsvd(x)  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_INT_STATUS_CLR_int_stsc_rsvd_SHIFT)) & CSS_CSS_INT_STATUS_CLR_int_stsc_rsvd_MASK)
/*! @} */

/*! @name CSS_INT_STATUS_SET - Interrupt status set */
/*! @{ */

#define CSS_CSS_INT_STATUS_SET_int_set_MASK      (0x1U)
#define CSS_CSS_INT_STATUS_SET_int_set_SHIFT     (0U)
/*! int_set - Set interrupt by software
 */
#define CSS_CSS_INT_STATUS_SET_int_set(x)        (((uint32_t)(((uint32_t)(x)) << CSS_CSS_INT_STATUS_SET_int_set_SHIFT)) & CSS_CSS_INT_STATUS_SET_int_set_MASK)

#define CSS_CSS_INT_STATUS_SET_gdet_int_neg_set_MASK (0x2U)
#define CSS_CSS_INT_STATUS_SET_gdet_int_neg_set_SHIFT (1U)
/*! gdet_int_neg_set - Set GDET interrupt by software
 */
#define CSS_CSS_INT_STATUS_SET_gdet_int_neg_set(x) (((uint32_t)(((uint32_t)(x)) << CSS_CSS_INT_STATUS_SET_gdet_int_neg_set_SHIFT)) & CSS_CSS_INT_STATUS_SET_gdet_int_neg_set_MASK)

#define CSS_CSS_INT_STATUS_SET_gdet_int_pos_set_MASK (0x4U)
#define CSS_CSS_INT_STATUS_SET_gdet_int_pos_set_SHIFT (2U)
/*! gdet_int_pos_set - Set GDET interrupt by software
 */
#define CSS_CSS_INT_STATUS_SET_gdet_int_pos_set(x) (((uint32_t)(((uint32_t)(x)) << CSS_CSS_INT_STATUS_SET_gdet_int_pos_set_SHIFT)) & CSS_CSS_INT_STATUS_SET_gdet_int_pos_set_MASK)

#define CSS_CSS_INT_STATUS_SET_int_stss_rsvd_MASK (0xFFFFFFF8U)
#define CSS_CSS_INT_STATUS_SET_int_stss_rsvd_SHIFT (3U)
/*! int_stss_rsvd - reserved
 */
#define CSS_CSS_INT_STATUS_SET_int_stss_rsvd(x)  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_INT_STATUS_SET_int_stss_rsvd_SHIFT)) & CSS_CSS_INT_STATUS_SET_int_stss_rsvd_MASK)
/*! @} */

/*! @name CSS_ERR_STATUS - Status register */
/*! @{ */

#define CSS_CSS_ERR_STATUS_bus_err_MASK          (0x1U)
#define CSS_CSS_ERR_STATUS_bus_err_SHIFT         (0U)
/*! bus_err - Bus access error: public or private bus
 */
#define CSS_CSS_ERR_STATUS_bus_err(x)            (((uint32_t)(((uint32_t)(x)) << CSS_CSS_ERR_STATUS_bus_err_SHIFT)) & CSS_CSS_ERR_STATUS_bus_err_MASK)

#define CSS_CSS_ERR_STATUS_opn_err_MASK          (0x2U)
#define CSS_CSS_ERR_STATUS_opn_err_SHIFT         (1U)
/*! opn_err - Operational error:
 */
#define CSS_CSS_ERR_STATUS_opn_err(x)            (((uint32_t)(((uint32_t)(x)) << CSS_CSS_ERR_STATUS_opn_err_SHIFT)) & CSS_CSS_ERR_STATUS_opn_err_MASK)

#define CSS_CSS_ERR_STATUS_alg_err_MASK          (0x4U)
#define CSS_CSS_ERR_STATUS_alg_err_SHIFT         (2U)
/*! alg_err - Algorithm error: An internal algorithm has
 */
#define CSS_CSS_ERR_STATUS_alg_err(x)            (((uint32_t)(((uint32_t)(x)) << CSS_CSS_ERR_STATUS_alg_err_SHIFT)) & CSS_CSS_ERR_STATUS_alg_err_MASK)

#define CSS_CSS_ERR_STATUS_itg_err_MASK          (0x8U)
#define CSS_CSS_ERR_STATUS_itg_err_SHIFT         (3U)
/*! itg_err - Data integrity error:
 */
#define CSS_CSS_ERR_STATUS_itg_err(x)            (((uint32_t)(((uint32_t)(x)) << CSS_CSS_ERR_STATUS_itg_err_SHIFT)) & CSS_CSS_ERR_STATUS_itg_err_MASK)

#define CSS_CSS_ERR_STATUS_flt_err_MASK          (0x10U)
#define CSS_CSS_ERR_STATUS_flt_err_SHIFT         (4U)
/*! flt_err - Hardware fault error: Attempt to change the value
 */
#define CSS_CSS_ERR_STATUS_flt_err(x)            (((uint32_t)(((uint32_t)(x)) << CSS_CSS_ERR_STATUS_flt_err_SHIFT)) & CSS_CSS_ERR_STATUS_flt_err_MASK)

#define CSS_CSS_ERR_STATUS_prng_err_MASK         (0x20U)
#define CSS_CSS_ERR_STATUS_prng_err_SHIFT        (5U)
/*! prng_err - User Read of CSS_PRNG_DATOUT when CSS_STATUS.PRNG_RDY
 */
#define CSS_CSS_ERR_STATUS_prng_err(x)           (((uint32_t)(((uint32_t)(x)) << CSS_CSS_ERR_STATUS_prng_err_SHIFT)) & CSS_CSS_ERR_STATUS_prng_err_MASK)

#define CSS_CSS_ERR_STATUS_err_lvl_MASK          (0xC0U)
#define CSS_CSS_ERR_STATUS_err_lvl_SHIFT         (6U)
/*! err_lvl - Indicates Error Level which has been triggerer. 0, 1 ,2
 */
#define CSS_CSS_ERR_STATUS_err_lvl(x)            (((uint32_t)(((uint32_t)(x)) << CSS_CSS_ERR_STATUS_err_lvl_SHIFT)) & CSS_CSS_ERR_STATUS_err_lvl_MASK)

#define CSS_CSS_ERR_STATUS_dtrng_err_MASK        (0x100U)
#define CSS_CSS_ERR_STATUS_dtrng_err_SHIFT       (8U)
/*! dtrng_err - DTRNG unable to gather entropy with the current
 */
#define CSS_CSS_ERR_STATUS_dtrng_err(x)          (((uint32_t)(((uint32_t)(x)) << CSS_CSS_ERR_STATUS_dtrng_err_SHIFT)) & CSS_CSS_ERR_STATUS_dtrng_err_MASK)

#define CSS_CSS_ERR_STATUS_err_stat_rsvd_MASK    (0xFFFFFE00U)
#define CSS_CSS_ERR_STATUS_err_stat_rsvd_SHIFT   (9U)
/*! err_stat_rsvd - reserved
 */
#define CSS_CSS_ERR_STATUS_err_stat_rsvd(x)      (((uint32_t)(((uint32_t)(x)) << CSS_CSS_ERR_STATUS_err_stat_rsvd_SHIFT)) & CSS_CSS_ERR_STATUS_err_stat_rsvd_MASK)
/*! @} */

/*! @name CSS_ERR_STATUS_CLR - Interrupt status clear */
/*! @{ */

#define CSS_CSS_ERR_STATUS_CLR_err_clr_MASK      (0x1U)
#define CSS_CSS_ERR_STATUS_CLR_err_clr_SHIFT     (0U)
/*! err_clr - 1=clear CSS error status bits and exit CSS error state
 */
#define CSS_CSS_ERR_STATUS_CLR_err_clr(x)        (((uint32_t)(((uint32_t)(x)) << CSS_CSS_ERR_STATUS_CLR_err_clr_SHIFT)) & CSS_CSS_ERR_STATUS_CLR_err_clr_MASK)

#define CSS_CSS_ERR_STATUS_CLR_err_stsc_rsvd_MASK (0xFFFFFFFEU)
#define CSS_CSS_ERR_STATUS_CLR_err_stsc_rsvd_SHIFT (1U)
/*! err_stsc_rsvd - reserved
 */
#define CSS_CSS_ERR_STATUS_CLR_err_stsc_rsvd(x)  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_ERR_STATUS_CLR_err_stsc_rsvd_SHIFT)) & CSS_CSS_ERR_STATUS_CLR_err_stsc_rsvd_MASK)
/*! @} */

