RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
/*! @name CSS_VERSION - CSS Version */
/*! @{ */

#define CSS_CSS_VERSION_z_MASK                   (0xFU)
#define CSS_CSS_VERSION_z_SHIFT                  (0U)
/*! z - extended revision version: possible values 0-9
 */
#define CSS_CSS_VERSION_z(x)                     (((uint32_t)(((uint32_t)(x)) << CSS_CSS_VERSION_z_SHIFT)) & CSS_CSS_VERSION_z_MASK)

#define CSS_CSS_VERSION_y2_MASK                  (0xF0U)
#define CSS_CSS_VERSION_y2_SHIFT                 (4U)
/*! y2 - minor release versino digit0: possible values 0-9
 */
#define CSS_CSS_VERSION_y2(x)                    (((uint32_t)(((uint32_t)(x)) << CSS_CSS_VERSION_y2_SHIFT)) & CSS_CSS_VERSION_y2_MASK)

#define CSS_CSS_VERSION_y1_MASK                  (0xF00U)
#define CSS_CSS_VERSION_y1_SHIFT                 (8U)
/*! y1 - minor release version digit1: possible values 0-9
 */
#define CSS_CSS_VERSION_y1(x)                    (((uint32_t)(((uint32_t)(x)) << CSS_CSS_VERSION_y1_SHIFT)) & CSS_CSS_VERSION_y1_MASK)

#define CSS_CSS_VERSION_x_MASK                   (0xF000U)
#define CSS_CSS_VERSION_x_SHIFT                  (12U)
/*! x - major release version: possible values 1-9
 */
#define CSS_CSS_VERSION_x(x)                     (((uint32_t)(((uint32_t)(x)) << CSS_CSS_VERSION_x_SHIFT)) & CSS_CSS_VERSION_x_MASK)

#define CSS_CSS_VERSION_version_rsvd_MASK        (0xFFFF0000U)
#define CSS_CSS_VERSION_version_rsvd_SHIFT       (16U)
/*! version_rsvd - reserved
 */
#define CSS_CSS_VERSION_version_rsvd(x)          (((uint32_t)(((uint32_t)(x)) << CSS_CSS_VERSION_version_rsvd_SHIFT)) & CSS_CSS_VERSION_version_rsvd_MASK)
/*! @} */

/*! @name CSS_PRNG_DATOUT - PRNG SW read out register */
/*! @{ */

#define CSS_CSS_PRNG_DATOUT_prng_datout_MASK     (0xFFFFFFFFU)
#define CSS_CSS_PRNG_DATOUT_prng_datout_SHIFT    (0U)
/*! prng_datout - 32-bit wide pseudo-random number
 */
#define CSS_CSS_PRNG_DATOUT_prng_datout(x)       (((uint32_t)(((uint32_t)(x)) << CSS_CSS_PRNG_DATOUT_prng_datout_SHIFT)) & CSS_CSS_PRNG_DATOUT_prng_datout_MASK)
/*! @} */

/*! @name CSS_GDET_EVTCNT - CSS GDET Event Counter */
/*! @{ */

#define CSS_CSS_GDET_EVTCNT_gdet_evtcnt_MASK     (0xFFU)
#define CSS_CSS_GDET_EVTCNT_gdet_evtcnt_SHIFT    (0U)
/*! gdet_evtcnt - Number of glitch event recorded
 */
#define CSS_CSS_GDET_EVTCNT_gdet_evtcnt(x)       (((uint32_t)(((uint32_t)(x)) << CSS_CSS_GDET_EVTCNT_gdet_evtcnt_SHIFT)) & CSS_CSS_GDET_EVTCNT_gdet_evtcnt_MASK)

#define CSS_CSS_GDET_EVTCNT_gdet_evtcnt_clr_done_MASK (0x100U)
#define CSS_CSS_GDET_EVTCNT_gdet_evtcnt_clr_done_SHIFT (8U)
/*! gdet_evtcnt_clr_done - The GDET event counter has been cleared
 */
#define CSS_CSS_GDET_EVTCNT_gdet_evtcnt_clr_done(x) (((uint32_t)(((uint32_t)(x)) << CSS_CSS_GDET_EVTCNT_gdet_evtcnt_clr_done_SHIFT)) & CSS_CSS_GDET_EVTCNT_gdet_evtcnt_clr_done_MASK)

#define CSS_CSS_GDET_EVTCNT_gdet_evtcnt_rsvd_MASK (0xFFFFFE00U)
#define CSS_CSS_GDET_EVTCNT_gdet_evtcnt_rsvd_SHIFT (9U)
/*! gdet_evtcnt_rsvd - reserved
 */
#define CSS_CSS_GDET_EVTCNT_gdet_evtcnt_rsvd(x)  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_GDET_EVTCNT_gdet_evtcnt_rsvd_SHIFT)) & CSS_CSS_GDET_EVTCNT_gdet_evtcnt_rsvd_MASK)
/*! @} */

/*! @name CSS_GDET_EVTCNT_CLR - CSS GDET Event Counter Clear */
/*! @{ */

#define CSS_CSS_GDET_EVTCNT_CLR_gdet_evtcnt_clr_MASK (0x1U)
#define CSS_CSS_GDET_EVTCNT_CLR_gdet_evtcnt_clr_SHIFT (0U)
/*! gdet_evtcnt_clr - 1=clear GDET event counter clear
 */
#define CSS_CSS_GDET_EVTCNT_CLR_gdet_evtcnt_clr(x) (((uint32_t)(((uint32_t)(x)) << CSS_CSS_GDET_EVTCNT_CLR_gdet_evtcnt_clr_SHIFT)) & CSS_CSS_GDET_EVTCNT_CLR_gdet_evtcnt_clr_MASK)

#define CSS_CSS_GDET_EVTCNT_CLR_gdet_evtcnt_clr_rsvd_MASK (0xFFFFFFFEU)
#define CSS_CSS_GDET_EVTCNT_CLR_gdet_evtcnt_clr_rsvd_SHIFT (1U)
/*! gdet_evtcnt_clr_rsvd - reserved
 */
#define CSS_CSS_GDET_EVTCNT_CLR_gdet_evtcnt_clr_rsvd(x) (((uint32_t)(((uint32_t)(x)) << CSS_CSS_GDET_EVTCNT_CLR_gdet_evtcnt_clr_rsvd_SHIFT)) & CSS_CSS_GDET_EVTCNT_CLR_gdet_evtcnt_clr_rsvd_MASK)
/*! @} */

/*! @name CSS_SHA2_STATUS - CSS SHA2 Status Register */
/*! @{ */

#define CSS_CSS_SHA2_STATUS_sha2_busy_MASK       (0x1U)
#define CSS_CSS_SHA2_STATUS_sha2_busy_SHIFT      (0U)
/*! sha2_busy - SHA2 busy/idle status for sha direct
 */
#define CSS_CSS_SHA2_STATUS_sha2_busy(x)         (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_STATUS_sha2_busy_SHIFT)) & CSS_CSS_SHA2_STATUS_sha2_busy_MASK)

#define CSS_CSS_SHA2_STATUS_status_rsvd1_MASK    (0xFFFFFFFEU)
#define CSS_CSS_SHA2_STATUS_status_rsvd1_SHIFT   (1U)
/*! status_rsvd1 - reserved
 */
#define CSS_CSS_SHA2_STATUS_status_rsvd1(x)      (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_STATUS_status_rsvd1_SHIFT)) & CSS_CSS_SHA2_STATUS_status_rsvd1_MASK)
/*! @} */

/*! @name CSS_SHA2_CTRL - SHA2 Control register */
/*! @{ */

#define CSS_CSS_SHA2_CTRL_sha2_start_MASK        (0x1U)
#define CSS_CSS_SHA2_CTRL_sha2_start_SHIFT       (0U)
/*! sha2_start - Write to 1 to Init the SHA2 Module
 */
#define CSS_CSS_SHA2_CTRL_sha2_start(x)          (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_CTRL_sha2_start_SHIFT)) & CSS_CSS_SHA2_CTRL_sha2_start_MASK)

#define CSS_CSS_SHA2_CTRL_sha2_rst_MASK          (0x2U)
#define CSS_CSS_SHA2_CTRL_sha2_rst_SHIFT         (1U)
/*! sha2_rst - Write to 1 to Reset a SHA2 operation
 */
#define CSS_CSS_SHA2_CTRL_sha2_rst(x)            (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_CTRL_sha2_rst_SHIFT)) & CSS_CSS_SHA2_CTRL_sha2_rst_MASK)

#define CSS_CSS_SHA2_CTRL_sha2_init_MASK         (0x4U)
#define CSS_CSS_SHA2_CTRL_sha2_init_SHIFT        (2U)
/*! sha2_init - Write to 1 to Init the SHA2 Kernel
 */
#define CSS_CSS_SHA2_CTRL_sha2_init(x)           (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_CTRL_sha2_init_SHIFT)) & CSS_CSS_SHA2_CTRL_sha2_init_MASK)

#define CSS_CSS_SHA2_CTRL_sha2_load_MASK         (0x8U)
#define CSS_CSS_SHA2_CTRL_sha2_load_SHIFT        (3U)
/*! sha2_load - Write to 1 to Load the SHA2 Kernel
 */
#define CSS_CSS_SHA2_CTRL_sha2_load(x)           (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_CTRL_sha2_load_SHIFT)) & CSS_CSS_SHA2_CTRL_sha2_load_MASK)

#define CSS_CSS_SHA2_CTRL_sha2_mode_MASK         (0x30U)
#define CSS_CSS_SHA2_CTRL_sha2_mode_SHIFT        (4U)
/*! sha2_mode - SHA2 MODE:
 */
#define CSS_CSS_SHA2_CTRL_sha2_mode(x)           (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_CTRL_sha2_mode_SHIFT)) & CSS_CSS_SHA2_CTRL_sha2_mode_MASK)

#define CSS_CSS_SHA2_CTRL_ctrl_rsvd1_MASK        (0x1C0U)
#define CSS_CSS_SHA2_CTRL_ctrl_rsvd1_SHIFT       (6U)
/*! ctrl_rsvd1 - r-eserved
 */
#define CSS_CSS_SHA2_CTRL_ctrl_rsvd1(x)          (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_CTRL_ctrl_rsvd1_SHIFT)) & CSS_CSS_SHA2_CTRL_ctrl_rsvd1_MASK)

