RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_SHA2_CTRL_sha2_byte_order_MASK   (0x200U)
#define CSS_CSS_SHA2_CTRL_sha2_byte_order_SHIFT  (9U)
/*! sha2_byte_order - Write to 1 to Reverse byte endianess
 */
#define CSS_CSS_SHA2_CTRL_sha2_byte_order(x)     (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_CTRL_sha2_byte_order_SHIFT)) & CSS_CSS_SHA2_CTRL_sha2_byte_order_MASK)

#define CSS_CSS_SHA2_CTRL_ctrl_rsvd_MASK         (0xFFFFFC00U)
#define CSS_CSS_SHA2_CTRL_ctrl_rsvd_SHIFT        (10U)
/*! ctrl_rsvd - r-eserved
 */
#define CSS_CSS_SHA2_CTRL_ctrl_rsvd(x)           (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_CTRL_ctrl_rsvd_SHIFT)) & CSS_CSS_SHA2_CTRL_ctrl_rsvd_MASK)
/*! @} */

/*! @name CSS_SHA2_DIN - CSS SHA_DATA IN Register 0 */
/*! @{ */

#define CSS_CSS_SHA2_DIN_sha_datin_MASK          (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DIN_sha_datin_SHIFT         (0U)
/*! sha_datin - Output CSS_SHA_DATIN from CSS Application being executed
 */
#define CSS_CSS_SHA2_DIN_sha_datin(x)            (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DIN_sha_datin_SHIFT)) & CSS_CSS_SHA2_DIN_sha_datin_MASK)
/*! @} */

/*! @name CSS_SHA2_DOUT0 - CSS CSS_SHA_DATA Out Register 0 */
/*! @{ */

#define CSS_CSS_SHA2_DOUT0_sha_data0_MASK        (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DOUT0_sha_data0_SHIFT       (0U)
/*! sha_data0 - Output SHA_DATA from CSS Application being executed
 */
#define CSS_CSS_SHA2_DOUT0_sha_data0(x)          (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DOUT0_sha_data0_SHIFT)) & CSS_CSS_SHA2_DOUT0_sha_data0_MASK)
/*! @} */

/*! @name CSS_SHA2_DOUT1 - CSS SHA_DATA Out Register 1 */
/*! @{ */

#define CSS_CSS_SHA2_DOUT1_sha_data1_MASK        (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DOUT1_sha_data1_SHIFT       (0U)
/*! sha_data1 - Output SHA_DATA from CSS Application being executed
 */
#define CSS_CSS_SHA2_DOUT1_sha_data1(x)          (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DOUT1_sha_data1_SHIFT)) & CSS_CSS_SHA2_DOUT1_sha_data1_MASK)
/*! @} */

/*! @name CSS_SHA2_DOUT2 - CSS SHA_DATA Out Register 2 */
/*! @{ */

#define CSS_CSS_SHA2_DOUT2_sha_data2_MASK        (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DOUT2_sha_data2_SHIFT       (0U)
/*! sha_data2 - Output SHA_DATA from CSS Application being executed
 */
#define CSS_CSS_SHA2_DOUT2_sha_data2(x)          (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DOUT2_sha_data2_SHIFT)) & CSS_CSS_SHA2_DOUT2_sha_data2_MASK)
/*! @} */

/*! @name CSS_SHA2_DOUT3 - CSS SHA_DATA Out Register 3 */
/*! @{ */

#define CSS_CSS_SHA2_DOUT3_sha_data3_MASK        (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DOUT3_sha_data3_SHIFT       (0U)
/*! sha_data3 - Output SHA_DATA from CSS Application being executed
 */
#define CSS_CSS_SHA2_DOUT3_sha_data3(x)          (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DOUT3_sha_data3_SHIFT)) & CSS_CSS_SHA2_DOUT3_sha_data3_MASK)
/*! @} */

/*! @name CSS_SHA2_DOUT4 - CSS SHA_DATA Out Register 4 */
/*! @{ */

#define CSS_CSS_SHA2_DOUT4_sha_data4_MASK        (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DOUT4_sha_data4_SHIFT       (0U)
/*! sha_data4 - Output SHA_DATA from CSS Application being executed
 */
#define CSS_CSS_SHA2_DOUT4_sha_data4(x)          (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DOUT4_sha_data4_SHIFT)) & CSS_CSS_SHA2_DOUT4_sha_data4_MASK)
/*! @} */

/*! @name CSS_SHA2_DOUT5 - CSS SHA_DATA Out Register 5 */
/*! @{ */

#define CSS_CSS_SHA2_DOUT5_sha_data5_MASK        (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DOUT5_sha_data5_SHIFT       (0U)
/*! sha_data5 - Output SHA_DATA from CSS Application being executed
 */
#define CSS_CSS_SHA2_DOUT5_sha_data5(x)          (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DOUT5_sha_data5_SHIFT)) & CSS_CSS_SHA2_DOUT5_sha_data5_MASK)
/*! @} */

/*! @name CSS_SHA2_DOUT6 - CSS SHA_DATA Out Register 6 */
/*! @{ */

#define CSS_CSS_SHA2_DOUT6_sha_data6_MASK        (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DOUT6_sha_data6_SHIFT       (0U)
/*! sha_data6 - Output SHA_DATA from CSS Application being executed
 */
#define CSS_CSS_SHA2_DOUT6_sha_data6(x)          (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DOUT6_sha_data6_SHIFT)) & CSS_CSS_SHA2_DOUT6_sha_data6_MASK)
/*! @} */

/*! @name CSS_SHA2_DOUT7 - CSS SHA_DATA Out Register 7 */
/*! @{ */

#define CSS_CSS_SHA2_DOUT7_sha_data7_MASK        (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DOUT7_sha_data7_SHIFT       (0U)
/*! sha_data7 - Output SHA_DATA from CSS Application being executed
 */
#define CSS_CSS_SHA2_DOUT7_sha_data7(x)          (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DOUT7_sha_data7_SHIFT)) & CSS_CSS_SHA2_DOUT7_sha_data7_MASK)
/*! @} */

/*! @name CSS_SHA2_DOUT8 - CSS CSS_SHA_DATA Out Register 8 */
/*! @{ */

#define CSS_CSS_SHA2_DOUT8_sha_data8_MASK        (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DOUT8_sha_data8_SHIFT       (0U)
/*! sha_data8 - Output SHA_DATA from CSS Application being executed
 */
#define CSS_CSS_SHA2_DOUT8_sha_data8(x)          (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DOUT8_sha_data8_SHIFT)) & CSS_CSS_SHA2_DOUT8_sha_data8_MASK)
/*! @} */

/*! @name CSS_SHA2_DOUT9 - CSS SHA_DATA Out Register 9 */
/*! @{ */

#define CSS_CSS_SHA2_DOUT9_sha_data9_MASK        (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DOUT9_sha_data9_SHIFT       (0U)
/*! sha_data9 - Output SHA_DATA from CSS Application being executed
 */
#define CSS_CSS_SHA2_DOUT9_sha_data9(x)          (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DOUT9_sha_data9_SHIFT)) & CSS_CSS_SHA2_DOUT9_sha_data9_MASK)
/*! @} */

/*! @name CSS_SHA2_DOUT10 - CSS SHA_DATA Out Register 10 */
/*! @{ */

#define CSS_CSS_SHA2_DOUT10_sha_data10_MASK      (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DOUT10_sha_data10_SHIFT     (0U)
/*! sha_data10 - Output SHA_DATA from CSS Application being executed
 */
#define CSS_CSS_SHA2_DOUT10_sha_data10(x)        (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DOUT10_sha_data10_SHIFT)) & CSS_CSS_SHA2_DOUT10_sha_data10_MASK)
/*! @} */

/*! @name CSS_SHA2_DOUT11 - CSS SHA_DATA Out Register 11 */
/*! @{ */

#define CSS_CSS_SHA2_DOUT11_sha_data11_MASK      (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DOUT11_sha_data11_SHIFT     (0U)
/*! sha_data11 - Output SHA_DATA from CSS Application being executed
 */
#define CSS_CSS_SHA2_DOUT11_sha_data11(x)        (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DOUT11_sha_data11_SHIFT)) & CSS_CSS_SHA2_DOUT11_sha_data11_MASK)
/*! @} */

/*! @name CSS_SHA2_DOUT12 - CSS SHA_DATA Out Register 12 */
/*! @{ */

#define CSS_CSS_SHA2_DOUT12_sha_data12_MASK      (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DOUT12_sha_data12_SHIFT     (0U)
/*! sha_data12 - Output SHA_DATA from CSS Application being executed
 */
#define CSS_CSS_SHA2_DOUT12_sha_data12(x)        (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DOUT12_sha_data12_SHIFT)) & CSS_CSS_SHA2_DOUT12_sha_data12_MASK)
/*! @} */

/*! @name CSS_SHA2_DOUT13 - CSS SHA_DATA Out Register 13 */
/*! @{ */

