RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_SHA2_DOUT13_sha_data13_MASK      (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DOUT13_sha_data13_SHIFT     (0U)
/*! sha_data13 - Output SHA_DATA from CSS Application being executed
 */
#define CSS_CSS_SHA2_DOUT13_sha_data13(x)        (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DOUT13_sha_data13_SHIFT)) & CSS_CSS_SHA2_DOUT13_sha_data13_MASK)
/*! @} */

/*! @name CSS_SHA2_DOUT14 - CSS SHA_DATA Out Register 14 */
/*! @{ */

#define CSS_CSS_SHA2_DOUT14_sha_data14_MASK      (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DOUT14_sha_data14_SHIFT     (0U)
/*! sha_data14 - Output SHA_DATA from CSS Application being executed
 */
#define CSS_CSS_SHA2_DOUT14_sha_data14(x)        (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DOUT14_sha_data14_SHIFT)) & CSS_CSS_SHA2_DOUT14_sha_data14_MASK)
/*! @} */

/*! @name CSS_SHA2_DOUT15 - CSS SHA_DATA Out Register 15 */
/*! @{ */

#define CSS_CSS_SHA2_DOUT15_sha_data15_MASK      (0xFFFFFFFFU)
#define CSS_CSS_SHA2_DOUT15_sha_data15_SHIFT     (0U)
/*! sha_data15 - Output SHA_DATA from CSS Application being executed
 */
#define CSS_CSS_SHA2_DOUT15_sha_data15(x)        (((uint32_t)(((uint32_t)(x)) << CSS_CSS_SHA2_DOUT15_sha_data15_SHIFT)) & CSS_CSS_SHA2_DOUT15_sha_data15_MASK)
/*! @} */

/*! @name CSS_KS0 - Status register */
/*! @{ */

#define CSS_CSS_KS0_ks0_ksize_MASK               (0x1U)
#define CSS_CSS_KS0_ks0_ksize_SHIFT              (0U)
/*! ks0_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS0_ks0_ksize(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_ksize_SHIFT)) & CSS_CSS_KS0_ks0_ksize_MASK)

#define CSS_CSS_KS0_ks0_rsvd0_MASK               (0x1EU)
#define CSS_CSS_KS0_ks0_rsvd0_SHIFT              (1U)
/*! ks0_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS0_ks0_rsvd0(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_rsvd0_SHIFT)) & CSS_CSS_KS0_ks0_rsvd0_MASK)

#define CSS_CSS_KS0_ks0_kact_MASK                (0x20U)
#define CSS_CSS_KS0_ks0_kact_SHIFT               (5U)
/*! ks0_kact - Key is active
 */
#define CSS_CSS_KS0_ks0_kact(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_kact_SHIFT)) & CSS_CSS_KS0_ks0_kact_MASK)

#define CSS_CSS_KS0_ks0_kbase_MASK               (0x40U)
#define CSS_CSS_KS0_ks0_kbase_SHIFT              (6U)
/*! ks0_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS0_ks0_kbase(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_kbase_SHIFT)) & CSS_CSS_KS0_ks0_kbase_MASK)

#define CSS_CSS_KS0_ks0_fgp_MASK                 (0x80U)
#define CSS_CSS_KS0_ks0_fgp_SHIFT                (7U)
/*! ks0_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS0_ks0_fgp(x)                   (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_fgp_SHIFT)) & CSS_CSS_KS0_ks0_fgp_MASK)

#define CSS_CSS_KS0_ks0_frtn_MASK                (0x100U)
#define CSS_CSS_KS0_ks0_frtn_SHIFT               (8U)
/*! ks0_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS0_ks0_frtn(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_frtn_SHIFT)) & CSS_CSS_KS0_ks0_frtn_MASK)

#define CSS_CSS_KS0_ks0_fhwo_MASK                (0x200U)
#define CSS_CSS_KS0_ks0_fhwo_SHIFT               (9U)
/*! ks0_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS0_ks0_fhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_fhwo_SHIFT)) & CSS_CSS_KS0_ks0_fhwo_MASK)

#define CSS_CSS_KS0_ks0_rsvd1_MASK               (0x1C00U)
#define CSS_CSS_KS0_ks0_rsvd1_SHIFT              (10U)
/*! ks0_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS0_ks0_rsvd1(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_rsvd1_SHIFT)) & CSS_CSS_KS0_ks0_rsvd1_MASK)

#define CSS_CSS_KS0_ks0_ucmac_MASK               (0x2000U)
#define CSS_CSS_KS0_ks0_ucmac_SHIFT              (13U)
/*! ks0_ucmac - CMAC key
 */
#define CSS_CSS_KS0_ks0_ucmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_ucmac_SHIFT)) & CSS_CSS_KS0_ks0_ucmac_MASK)

#define CSS_CSS_KS0_ks0_uksk_MASK                (0x4000U)
#define CSS_CSS_KS0_ks0_uksk_SHIFT               (14U)
/*! ks0_uksk - KSK key
 */
#define CSS_CSS_KS0_ks0_uksk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_uksk_SHIFT)) & CSS_CSS_KS0_ks0_uksk_MASK)

#define CSS_CSS_KS0_ks0_urtf_MASK                (0x8000U)
#define CSS_CSS_KS0_ks0_urtf_SHIFT               (15U)
/*! ks0_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS0_ks0_urtf(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_urtf_SHIFT)) & CSS_CSS_KS0_ks0_urtf_MASK)

#define CSS_CSS_KS0_ks0_uckdf_MASK               (0x10000U)
#define CSS_CSS_KS0_ks0_uckdf_SHIFT              (16U)
/*! ks0_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS0_ks0_uckdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_uckdf_SHIFT)) & CSS_CSS_KS0_ks0_uckdf_MASK)

#define CSS_CSS_KS0_ks0_uhkdf_MASK               (0x20000U)
#define CSS_CSS_KS0_ks0_uhkdf_SHIFT              (17U)
/*! ks0_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS0_ks0_uhkdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_uhkdf_SHIFT)) & CSS_CSS_KS0_ks0_uhkdf_MASK)

#define CSS_CSS_KS0_ks0_uecsg_MASK               (0x40000U)
#define CSS_CSS_KS0_ks0_uecsg_SHIFT              (18U)
/*! ks0_uecsg - Ecc signing key
 */
#define CSS_CSS_KS0_ks0_uecsg(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_uecsg_SHIFT)) & CSS_CSS_KS0_ks0_uecsg_MASK)

#define CSS_CSS_KS0_ks0_uecdh_MASK               (0x80000U)
#define CSS_CSS_KS0_ks0_uecdh_SHIFT              (19U)
/*! ks0_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS0_ks0_uecdh(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_uecdh_SHIFT)) & CSS_CSS_KS0_ks0_uecdh_MASK)

#define CSS_CSS_KS0_ks0_uaes_MASK                (0x100000U)
#define CSS_CSS_KS0_ks0_uaes_SHIFT               (20U)
/*! ks0_uaes - Aes key
 */
#define CSS_CSS_KS0_ks0_uaes(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_uaes_SHIFT)) & CSS_CSS_KS0_ks0_uaes_MASK)

#define CSS_CSS_KS0_ks0_uhmac_MASK               (0x200000U)
#define CSS_CSS_KS0_ks0_uhmac_SHIFT              (21U)
/*! ks0_uhmac - Hmac key
 */
#define CSS_CSS_KS0_ks0_uhmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_uhmac_SHIFT)) & CSS_CSS_KS0_ks0_uhmac_MASK)

#define CSS_CSS_KS0_ks0_ukwk_MASK                (0x400000U)
#define CSS_CSS_KS0_ks0_ukwk_SHIFT               (22U)
/*! ks0_ukwk - Key wrapping key
 */
#define CSS_CSS_KS0_ks0_ukwk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_ukwk_SHIFT)) & CSS_CSS_KS0_ks0_ukwk_MASK)

