RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS0_ks0_ukuok_MASK               (0x800000U)
#define CSS_CSS_KS0_ks0_ukuok_SHIFT              (23U)
/*! ks0_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS0_ks0_ukuok(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_ukuok_SHIFT)) & CSS_CSS_KS0_ks0_ukuok_MASK)

#define CSS_CSS_KS0_ks0_utlspms_MASK             (0x1000000U)
#define CSS_CSS_KS0_ks0_utlspms_SHIFT            (24U)
/*! ks0_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS0_ks0_utlspms(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_utlspms_SHIFT)) & CSS_CSS_KS0_ks0_utlspms_MASK)

#define CSS_CSS_KS0_ks0_utlsms_MASK              (0x2000000U)
#define CSS_CSS_KS0_ks0_utlsms_SHIFT             (25U)
/*! ks0_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS0_ks0_utlsms(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_utlsms_SHIFT)) & CSS_CSS_KS0_ks0_utlsms_MASK)

#define CSS_CSS_KS0_ks0_ukgsrc_MASK              (0x4000000U)
#define CSS_CSS_KS0_ks0_ukgsrc_SHIFT             (26U)
/*! ks0_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS0_ks0_ukgsrc(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_ukgsrc_SHIFT)) & CSS_CSS_KS0_ks0_ukgsrc_MASK)

#define CSS_CSS_KS0_ks0_uhwo_MASK                (0x8000000U)
#define CSS_CSS_KS0_ks0_uhwo_SHIFT               (27U)
/*! ks0_uhwo - Hardware out key
 */
#define CSS_CSS_KS0_ks0_uhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_uhwo_SHIFT)) & CSS_CSS_KS0_ks0_uhwo_MASK)

#define CSS_CSS_KS0_ks0_uwrpok_MASK              (0x10000000U)
#define CSS_CSS_KS0_ks0_uwrpok_SHIFT             (28U)
/*! ks0_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS0_ks0_uwrpok(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_uwrpok_SHIFT)) & CSS_CSS_KS0_ks0_uwrpok_MASK)

#define CSS_CSS_KS0_ks0_uduk_MASK                (0x20000000U)
#define CSS_CSS_KS0_ks0_uduk_SHIFT               (29U)
/*! ks0_uduk - Device Unique Key
 */
#define CSS_CSS_KS0_ks0_uduk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_uduk_SHIFT)) & CSS_CSS_KS0_ks0_uduk_MASK)

#define CSS_CSS_KS0_ks0_upprot_MASK              (0xC0000000U)
#define CSS_CSS_KS0_ks0_upprot_SHIFT             (30U)
/*! ks0_upprot - Priviledge level
 */
#define CSS_CSS_KS0_ks0_upprot(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS0_ks0_upprot_SHIFT)) & CSS_CSS_KS0_ks0_upprot_MASK)
/*! @} */

/*! @name CSS_KS1 - Status register */
/*! @{ */

#define CSS_CSS_KS1_ks1_ksize_MASK               (0x1U)
#define CSS_CSS_KS1_ks1_ksize_SHIFT              (0U)
/*! ks1_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS1_ks1_ksize(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_ksize_SHIFT)) & CSS_CSS_KS1_ks1_ksize_MASK)

#define CSS_CSS_KS1_ks1_rsvd0_MASK               (0x1EU)
#define CSS_CSS_KS1_ks1_rsvd0_SHIFT              (1U)
/*! ks1_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS1_ks1_rsvd0(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_rsvd0_SHIFT)) & CSS_CSS_KS1_ks1_rsvd0_MASK)

#define CSS_CSS_KS1_ks1_kact_MASK                (0x20U)
#define CSS_CSS_KS1_ks1_kact_SHIFT               (5U)
/*! ks1_kact - Key is active
 */
#define CSS_CSS_KS1_ks1_kact(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_kact_SHIFT)) & CSS_CSS_KS1_ks1_kact_MASK)

#define CSS_CSS_KS1_ks1_kbase_MASK               (0x40U)
#define CSS_CSS_KS1_ks1_kbase_SHIFT              (6U)
/*! ks1_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS1_ks1_kbase(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_kbase_SHIFT)) & CSS_CSS_KS1_ks1_kbase_MASK)

#define CSS_CSS_KS1_ks1_fgp_MASK                 (0x80U)
#define CSS_CSS_KS1_ks1_fgp_SHIFT                (7U)
/*! ks1_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS1_ks1_fgp(x)                   (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_fgp_SHIFT)) & CSS_CSS_KS1_ks1_fgp_MASK)

#define CSS_CSS_KS1_ks1_frtn_MASK                (0x100U)
#define CSS_CSS_KS1_ks1_frtn_SHIFT               (8U)
/*! ks1_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS1_ks1_frtn(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_frtn_SHIFT)) & CSS_CSS_KS1_ks1_frtn_MASK)

#define CSS_CSS_KS1_ks1_fhwo_MASK                (0x200U)
#define CSS_CSS_KS1_ks1_fhwo_SHIFT               (9U)
/*! ks1_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS1_ks1_fhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_fhwo_SHIFT)) & CSS_CSS_KS1_ks1_fhwo_MASK)

#define CSS_CSS_KS1_ks1_rsvd1_MASK               (0x1C00U)
#define CSS_CSS_KS1_ks1_rsvd1_SHIFT              (10U)
/*! ks1_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS1_ks1_rsvd1(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_rsvd1_SHIFT)) & CSS_CSS_KS1_ks1_rsvd1_MASK)

#define CSS_CSS_KS1_ks1_ucmac_MASK               (0x2000U)
#define CSS_CSS_KS1_ks1_ucmac_SHIFT              (13U)
/*! ks1_ucmac - CMAC key
 */
#define CSS_CSS_KS1_ks1_ucmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_ucmac_SHIFT)) & CSS_CSS_KS1_ks1_ucmac_MASK)

#define CSS_CSS_KS1_ks1_uksk_MASK                (0x4000U)
#define CSS_CSS_KS1_ks1_uksk_SHIFT               (14U)
/*! ks1_uksk - KSK key
 */
#define CSS_CSS_KS1_ks1_uksk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_uksk_SHIFT)) & CSS_CSS_KS1_ks1_uksk_MASK)

#define CSS_CSS_KS1_ks1_urtf_MASK                (0x8000U)
#define CSS_CSS_KS1_ks1_urtf_SHIFT               (15U)
/*! ks1_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS1_ks1_urtf(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_urtf_SHIFT)) & CSS_CSS_KS1_ks1_urtf_MASK)

#define CSS_CSS_KS1_ks1_uckdf_MASK               (0x10000U)
#define CSS_CSS_KS1_ks1_uckdf_SHIFT              (16U)
/*! ks1_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS1_ks1_uckdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_uckdf_SHIFT)) & CSS_CSS_KS1_ks1_uckdf_MASK)

#define CSS_CSS_KS1_ks1_uhkdf_MASK               (0x20000U)
#define CSS_CSS_KS1_ks1_uhkdf_SHIFT              (17U)
/*! ks1_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS1_ks1_uhkdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_uhkdf_SHIFT)) & CSS_CSS_KS1_ks1_uhkdf_MASK)

#define CSS_CSS_KS1_ks1_uecsg_MASK               (0x40000U)
#define CSS_CSS_KS1_ks1_uecsg_SHIFT              (18U)
/*! ks1_uecsg - Ecc signing key
 */
#define CSS_CSS_KS1_ks1_uecsg(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_uecsg_SHIFT)) & CSS_CSS_KS1_ks1_uecsg_MASK)

#define CSS_CSS_KS1_ks1_uecdh_MASK               (0x80000U)
#define CSS_CSS_KS1_ks1_uecdh_SHIFT              (19U)
/*! ks1_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS1_ks1_uecdh(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_uecdh_SHIFT)) & CSS_CSS_KS1_ks1_uecdh_MASK)

#define CSS_CSS_KS1_ks1_uaes_MASK                (0x100000U)
#define CSS_CSS_KS1_ks1_uaes_SHIFT               (20U)
/*! ks1_uaes - Aes key
 */
#define CSS_CSS_KS1_ks1_uaes(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_uaes_SHIFT)) & CSS_CSS_KS1_ks1_uaes_MASK)

