RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS1_ks1_uhmac_MASK               (0x200000U)
#define CSS_CSS_KS1_ks1_uhmac_SHIFT              (21U)
/*! ks1_uhmac - Hmac key
 */
#define CSS_CSS_KS1_ks1_uhmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_uhmac_SHIFT)) & CSS_CSS_KS1_ks1_uhmac_MASK)

#define CSS_CSS_KS1_ks1_ukwk_MASK                (0x400000U)
#define CSS_CSS_KS1_ks1_ukwk_SHIFT               (22U)
/*! ks1_ukwk - Key wrapping key
 */
#define CSS_CSS_KS1_ks1_ukwk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_ukwk_SHIFT)) & CSS_CSS_KS1_ks1_ukwk_MASK)

#define CSS_CSS_KS1_ks1_ukuok_MASK               (0x800000U)
#define CSS_CSS_KS1_ks1_ukuok_SHIFT              (23U)
/*! ks1_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS1_ks1_ukuok(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_ukuok_SHIFT)) & CSS_CSS_KS1_ks1_ukuok_MASK)

#define CSS_CSS_KS1_ks1_utlspms_MASK             (0x1000000U)
#define CSS_CSS_KS1_ks1_utlspms_SHIFT            (24U)
/*! ks1_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS1_ks1_utlspms(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_utlspms_SHIFT)) & CSS_CSS_KS1_ks1_utlspms_MASK)

#define CSS_CSS_KS1_ks1_utlsms_MASK              (0x2000000U)
#define CSS_CSS_KS1_ks1_utlsms_SHIFT             (25U)
/*! ks1_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS1_ks1_utlsms(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_utlsms_SHIFT)) & CSS_CSS_KS1_ks1_utlsms_MASK)

#define CSS_CSS_KS1_ks1_ukgsrc_MASK              (0x4000000U)
#define CSS_CSS_KS1_ks1_ukgsrc_SHIFT             (26U)
/*! ks1_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS1_ks1_ukgsrc(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_ukgsrc_SHIFT)) & CSS_CSS_KS1_ks1_ukgsrc_MASK)

#define CSS_CSS_KS1_ks1_uhwo_MASK                (0x8000000U)
#define CSS_CSS_KS1_ks1_uhwo_SHIFT               (27U)
/*! ks1_uhwo - Hardware out key
 */
#define CSS_CSS_KS1_ks1_uhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_uhwo_SHIFT)) & CSS_CSS_KS1_ks1_uhwo_MASK)

#define CSS_CSS_KS1_ks1_uwrpok_MASK              (0x10000000U)
#define CSS_CSS_KS1_ks1_uwrpok_SHIFT             (28U)
/*! ks1_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS1_ks1_uwrpok(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_uwrpok_SHIFT)) & CSS_CSS_KS1_ks1_uwrpok_MASK)

#define CSS_CSS_KS1_ks1_uduk_MASK                (0x20000000U)
#define CSS_CSS_KS1_ks1_uduk_SHIFT               (29U)
/*! ks1_uduk - Device Unique Key
 */
#define CSS_CSS_KS1_ks1_uduk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_uduk_SHIFT)) & CSS_CSS_KS1_ks1_uduk_MASK)

#define CSS_CSS_KS1_ks1_upprot_MASK              (0xC0000000U)
#define CSS_CSS_KS1_ks1_upprot_SHIFT             (30U)
/*! ks1_upprot - Priviledge level
 */
#define CSS_CSS_KS1_ks1_upprot(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS1_ks1_upprot_SHIFT)) & CSS_CSS_KS1_ks1_upprot_MASK)
/*! @} */

/*! @name CSS_KS2 - Status register */
/*! @{ */

#define CSS_CSS_KS2_ks2_ksize_MASK               (0x1U)
#define CSS_CSS_KS2_ks2_ksize_SHIFT              (0U)
/*! ks2_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS2_ks2_ksize(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_ksize_SHIFT)) & CSS_CSS_KS2_ks2_ksize_MASK)

#define CSS_CSS_KS2_ks2_rsvd0_MASK               (0x1EU)
#define CSS_CSS_KS2_ks2_rsvd0_SHIFT              (1U)
/*! ks2_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS2_ks2_rsvd0(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_rsvd0_SHIFT)) & CSS_CSS_KS2_ks2_rsvd0_MASK)

#define CSS_CSS_KS2_ks2_kact_MASK                (0x20U)
#define CSS_CSS_KS2_ks2_kact_SHIFT               (5U)
/*! ks2_kact - Key is active
 */
#define CSS_CSS_KS2_ks2_kact(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_kact_SHIFT)) & CSS_CSS_KS2_ks2_kact_MASK)

#define CSS_CSS_KS2_ks2_kbase_MASK               (0x40U)
#define CSS_CSS_KS2_ks2_kbase_SHIFT              (6U)
/*! ks2_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS2_ks2_kbase(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_kbase_SHIFT)) & CSS_CSS_KS2_ks2_kbase_MASK)

#define CSS_CSS_KS2_ks2_fgp_MASK                 (0x80U)
#define CSS_CSS_KS2_ks2_fgp_SHIFT                (7U)
/*! ks2_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS2_ks2_fgp(x)                   (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_fgp_SHIFT)) & CSS_CSS_KS2_ks2_fgp_MASK)

#define CSS_CSS_KS2_ks2_frtn_MASK                (0x100U)
#define CSS_CSS_KS2_ks2_frtn_SHIFT               (8U)
/*! ks2_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS2_ks2_frtn(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_frtn_SHIFT)) & CSS_CSS_KS2_ks2_frtn_MASK)

#define CSS_CSS_KS2_ks2_fhwo_MASK                (0x200U)
#define CSS_CSS_KS2_ks2_fhwo_SHIFT               (9U)
/*! ks2_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS2_ks2_fhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_fhwo_SHIFT)) & CSS_CSS_KS2_ks2_fhwo_MASK)

#define CSS_CSS_KS2_ks2_rsvd1_MASK               (0x1C00U)
#define CSS_CSS_KS2_ks2_rsvd1_SHIFT              (10U)
/*! ks2_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS2_ks2_rsvd1(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_rsvd1_SHIFT)) & CSS_CSS_KS2_ks2_rsvd1_MASK)

#define CSS_CSS_KS2_ks2_ucmac_MASK               (0x2000U)
#define CSS_CSS_KS2_ks2_ucmac_SHIFT              (13U)
/*! ks2_ucmac - CMAC key
 */
#define CSS_CSS_KS2_ks2_ucmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_ucmac_SHIFT)) & CSS_CSS_KS2_ks2_ucmac_MASK)

#define CSS_CSS_KS2_ks2_uksk_MASK                (0x4000U)
#define CSS_CSS_KS2_ks2_uksk_SHIFT               (14U)
/*! ks2_uksk - KSK key
 */
#define CSS_CSS_KS2_ks2_uksk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_uksk_SHIFT)) & CSS_CSS_KS2_ks2_uksk_MASK)

#define CSS_CSS_KS2_ks2_urtf_MASK                (0x8000U)
#define CSS_CSS_KS2_ks2_urtf_SHIFT               (15U)
/*! ks2_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS2_ks2_urtf(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_urtf_SHIFT)) & CSS_CSS_KS2_ks2_urtf_MASK)

#define CSS_CSS_KS2_ks2_uckdf_MASK               (0x10000U)
#define CSS_CSS_KS2_ks2_uckdf_SHIFT              (16U)
/*! ks2_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS2_ks2_uckdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_uckdf_SHIFT)) & CSS_CSS_KS2_ks2_uckdf_MASK)

#define CSS_CSS_KS2_ks2_uhkdf_MASK               (0x20000U)
#define CSS_CSS_KS2_ks2_uhkdf_SHIFT              (17U)
/*! ks2_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS2_ks2_uhkdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_uhkdf_SHIFT)) & CSS_CSS_KS2_ks2_uhkdf_MASK)

