RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS2_ks2_uecsg_MASK               (0x40000U)
#define CSS_CSS_KS2_ks2_uecsg_SHIFT              (18U)
/*! ks2_uecsg - Ecc signing key
 */
#define CSS_CSS_KS2_ks2_uecsg(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_uecsg_SHIFT)) & CSS_CSS_KS2_ks2_uecsg_MASK)

#define CSS_CSS_KS2_ks2_uecdh_MASK               (0x80000U)
#define CSS_CSS_KS2_ks2_uecdh_SHIFT              (19U)
/*! ks2_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS2_ks2_uecdh(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_uecdh_SHIFT)) & CSS_CSS_KS2_ks2_uecdh_MASK)

#define CSS_CSS_KS2_ks2_uaes_MASK                (0x100000U)
#define CSS_CSS_KS2_ks2_uaes_SHIFT               (20U)
/*! ks2_uaes - Aes key
 */
#define CSS_CSS_KS2_ks2_uaes(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_uaes_SHIFT)) & CSS_CSS_KS2_ks2_uaes_MASK)

#define CSS_CSS_KS2_ks2_uhmac_MASK               (0x200000U)
#define CSS_CSS_KS2_ks2_uhmac_SHIFT              (21U)
/*! ks2_uhmac - Hmac key
 */
#define CSS_CSS_KS2_ks2_uhmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_uhmac_SHIFT)) & CSS_CSS_KS2_ks2_uhmac_MASK)

#define CSS_CSS_KS2_ks2_ukwk_MASK                (0x400000U)
#define CSS_CSS_KS2_ks2_ukwk_SHIFT               (22U)
/*! ks2_ukwk - Key wrapping key
 */
#define CSS_CSS_KS2_ks2_ukwk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_ukwk_SHIFT)) & CSS_CSS_KS2_ks2_ukwk_MASK)

#define CSS_CSS_KS2_ks2_ukuok_MASK               (0x800000U)
#define CSS_CSS_KS2_ks2_ukuok_SHIFT              (23U)
/*! ks2_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS2_ks2_ukuok(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_ukuok_SHIFT)) & CSS_CSS_KS2_ks2_ukuok_MASK)

#define CSS_CSS_KS2_ks2_utlspms_MASK             (0x1000000U)
#define CSS_CSS_KS2_ks2_utlspms_SHIFT            (24U)
/*! ks2_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS2_ks2_utlspms(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_utlspms_SHIFT)) & CSS_CSS_KS2_ks2_utlspms_MASK)

#define CSS_CSS_KS2_ks2_utlsms_MASK              (0x2000000U)
#define CSS_CSS_KS2_ks2_utlsms_SHIFT             (25U)
/*! ks2_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS2_ks2_utlsms(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_utlsms_SHIFT)) & CSS_CSS_KS2_ks2_utlsms_MASK)

#define CSS_CSS_KS2_ks2_ukgsrc_MASK              (0x4000000U)
#define CSS_CSS_KS2_ks2_ukgsrc_SHIFT             (26U)
/*! ks2_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS2_ks2_ukgsrc(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_ukgsrc_SHIFT)) & CSS_CSS_KS2_ks2_ukgsrc_MASK)

#define CSS_CSS_KS2_ks2_uhwo_MASK                (0x8000000U)
#define CSS_CSS_KS2_ks2_uhwo_SHIFT               (27U)
/*! ks2_uhwo - Hardware out key
 */
#define CSS_CSS_KS2_ks2_uhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_uhwo_SHIFT)) & CSS_CSS_KS2_ks2_uhwo_MASK)

#define CSS_CSS_KS2_ks2_uwrpok_MASK              (0x10000000U)
#define CSS_CSS_KS2_ks2_uwrpok_SHIFT             (28U)
/*! ks2_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS2_ks2_uwrpok(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_uwrpok_SHIFT)) & CSS_CSS_KS2_ks2_uwrpok_MASK)

#define CSS_CSS_KS2_ks2_uduk_MASK                (0x20000000U)
#define CSS_CSS_KS2_ks2_uduk_SHIFT               (29U)
/*! ks2_uduk - Device Unique Key
 */
#define CSS_CSS_KS2_ks2_uduk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_uduk_SHIFT)) & CSS_CSS_KS2_ks2_uduk_MASK)

#define CSS_CSS_KS2_ks2_upprot_MASK              (0xC0000000U)
#define CSS_CSS_KS2_ks2_upprot_SHIFT             (30U)
/*! ks2_upprot - Priviledge level
 */
#define CSS_CSS_KS2_ks2_upprot(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS2_ks2_upprot_SHIFT)) & CSS_CSS_KS2_ks2_upprot_MASK)
/*! @} */

/*! @name CSS_KS3 - Status register */
/*! @{ */

#define CSS_CSS_KS3_ks3_ksize_MASK               (0x1U)
#define CSS_CSS_KS3_ks3_ksize_SHIFT              (0U)
/*! ks3_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS3_ks3_ksize(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_ksize_SHIFT)) & CSS_CSS_KS3_ks3_ksize_MASK)

#define CSS_CSS_KS3_ks3_rsvd0_MASK               (0x1EU)
#define CSS_CSS_KS3_ks3_rsvd0_SHIFT              (1U)
/*! ks3_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS3_ks3_rsvd0(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_rsvd0_SHIFT)) & CSS_CSS_KS3_ks3_rsvd0_MASK)

#define CSS_CSS_KS3_ks3_kact_MASK                (0x20U)
#define CSS_CSS_KS3_ks3_kact_SHIFT               (5U)
/*! ks3_kact - Key is active
 */
#define CSS_CSS_KS3_ks3_kact(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_kact_SHIFT)) & CSS_CSS_KS3_ks3_kact_MASK)

#define CSS_CSS_KS3_ks3_kbase_MASK               (0x40U)
#define CSS_CSS_KS3_ks3_kbase_SHIFT              (6U)
/*! ks3_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS3_ks3_kbase(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_kbase_SHIFT)) & CSS_CSS_KS3_ks3_kbase_MASK)

#define CSS_CSS_KS3_ks3_fgp_MASK                 (0x80U)
#define CSS_CSS_KS3_ks3_fgp_SHIFT                (7U)
/*! ks3_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS3_ks3_fgp(x)                   (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_fgp_SHIFT)) & CSS_CSS_KS3_ks3_fgp_MASK)

#define CSS_CSS_KS3_ks3_frtn_MASK                (0x100U)
#define CSS_CSS_KS3_ks3_frtn_SHIFT               (8U)
/*! ks3_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS3_ks3_frtn(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_frtn_SHIFT)) & CSS_CSS_KS3_ks3_frtn_MASK)

#define CSS_CSS_KS3_ks3_fhwo_MASK                (0x200U)
#define CSS_CSS_KS3_ks3_fhwo_SHIFT               (9U)
/*! ks3_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS3_ks3_fhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_fhwo_SHIFT)) & CSS_CSS_KS3_ks3_fhwo_MASK)

#define CSS_CSS_KS3_ks3_rsvd1_MASK               (0x1C00U)
#define CSS_CSS_KS3_ks3_rsvd1_SHIFT              (10U)
/*! ks3_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS3_ks3_rsvd1(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_rsvd1_SHIFT)) & CSS_CSS_KS3_ks3_rsvd1_MASK)

#define CSS_CSS_KS3_ks3_ucmac_MASK               (0x2000U)
#define CSS_CSS_KS3_ks3_ucmac_SHIFT              (13U)
/*! ks3_ucmac - CMAC key
 */
#define CSS_CSS_KS3_ks3_ucmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_ucmac_SHIFT)) & CSS_CSS_KS3_ks3_ucmac_MASK)

#define CSS_CSS_KS3_ks3_uksk_MASK                (0x4000U)
#define CSS_CSS_KS3_ks3_uksk_SHIFT               (14U)
/*! ks3_uksk - KSK key
 */
#define CSS_CSS_KS3_ks3_uksk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_uksk_SHIFT)) & CSS_CSS_KS3_ks3_uksk_MASK)

#define CSS_CSS_KS3_ks3_urtf_MASK                (0x8000U)
#define CSS_CSS_KS3_ks3_urtf_SHIFT               (15U)
/*! ks3_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS3_ks3_urtf(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_urtf_SHIFT)) & CSS_CSS_KS3_ks3_urtf_MASK)

#define CSS_CSS_KS3_ks3_uckdf_MASK               (0x10000U)
#define CSS_CSS_KS3_ks3_uckdf_SHIFT              (16U)
/*! ks3_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS3_ks3_uckdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_uckdf_SHIFT)) & CSS_CSS_KS3_ks3_uckdf_MASK)

#define CSS_CSS_KS3_ks3_uhkdf_MASK               (0x20000U)
#define CSS_CSS_KS3_ks3_uhkdf_SHIFT              (17U)
/*! ks3_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS3_ks3_uhkdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_uhkdf_SHIFT)) & CSS_CSS_KS3_ks3_uhkdf_MASK)

#define CSS_CSS_KS3_ks3_uecsg_MASK               (0x40000U)
#define CSS_CSS_KS3_ks3_uecsg_SHIFT              (18U)
/*! ks3_uecsg - Ecc signing key
 */
#define CSS_CSS_KS3_ks3_uecsg(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_uecsg_SHIFT)) & CSS_CSS_KS3_ks3_uecsg_MASK)

#define CSS_CSS_KS3_ks3_uecdh_MASK               (0x80000U)
#define CSS_CSS_KS3_ks3_uecdh_SHIFT              (19U)
/*! ks3_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS3_ks3_uecdh(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_uecdh_SHIFT)) & CSS_CSS_KS3_ks3_uecdh_MASK)

#define CSS_CSS_KS3_ks3_uaes_MASK                (0x100000U)
#define CSS_CSS_KS3_ks3_uaes_SHIFT               (20U)
/*! ks3_uaes - Aes key
 */
#define CSS_CSS_KS3_ks3_uaes(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_uaes_SHIFT)) & CSS_CSS_KS3_ks3_uaes_MASK)

