RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS3_ks3_uhmac_MASK               (0x200000U)
#define CSS_CSS_KS3_ks3_uhmac_SHIFT              (21U)
/*! ks3_uhmac - Hmac key
 */
#define CSS_CSS_KS3_ks3_uhmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_uhmac_SHIFT)) & CSS_CSS_KS3_ks3_uhmac_MASK)

#define CSS_CSS_KS3_ks3_ukwk_MASK                (0x400000U)
#define CSS_CSS_KS3_ks3_ukwk_SHIFT               (22U)
/*! ks3_ukwk - Key wrapping key
 */
#define CSS_CSS_KS3_ks3_ukwk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_ukwk_SHIFT)) & CSS_CSS_KS3_ks3_ukwk_MASK)

#define CSS_CSS_KS3_ks3_ukuok_MASK               (0x800000U)
#define CSS_CSS_KS3_ks3_ukuok_SHIFT              (23U)
/*! ks3_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS3_ks3_ukuok(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_ukuok_SHIFT)) & CSS_CSS_KS3_ks3_ukuok_MASK)

#define CSS_CSS_KS3_ks3_utlspms_MASK             (0x1000000U)
#define CSS_CSS_KS3_ks3_utlspms_SHIFT            (24U)
/*! ks3_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS3_ks3_utlspms(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_utlspms_SHIFT)) & CSS_CSS_KS3_ks3_utlspms_MASK)

#define CSS_CSS_KS3_ks3_utlsms_MASK              (0x2000000U)
#define CSS_CSS_KS3_ks3_utlsms_SHIFT             (25U)
/*! ks3_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS3_ks3_utlsms(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_utlsms_SHIFT)) & CSS_CSS_KS3_ks3_utlsms_MASK)

#define CSS_CSS_KS3_ks3_ukgsrc_MASK              (0x4000000U)
#define CSS_CSS_KS3_ks3_ukgsrc_SHIFT             (26U)
/*! ks3_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS3_ks3_ukgsrc(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_ukgsrc_SHIFT)) & CSS_CSS_KS3_ks3_ukgsrc_MASK)

#define CSS_CSS_KS3_ks3_uhwo_MASK                (0x8000000U)
#define CSS_CSS_KS3_ks3_uhwo_SHIFT               (27U)
/*! ks3_uhwo - Hardware out key
 */
#define CSS_CSS_KS3_ks3_uhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_uhwo_SHIFT)) & CSS_CSS_KS3_ks3_uhwo_MASK)

#define CSS_CSS_KS3_ks3_uwrpok_MASK              (0x10000000U)
#define CSS_CSS_KS3_ks3_uwrpok_SHIFT             (28U)
/*! ks3_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS3_ks3_uwrpok(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_uwrpok_SHIFT)) & CSS_CSS_KS3_ks3_uwrpok_MASK)

#define CSS_CSS_KS3_ks3_uduk_MASK                (0x20000000U)
#define CSS_CSS_KS3_ks3_uduk_SHIFT               (29U)
/*! ks3_uduk - Device Unique Key
 */
#define CSS_CSS_KS3_ks3_uduk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_uduk_SHIFT)) & CSS_CSS_KS3_ks3_uduk_MASK)

#define CSS_CSS_KS3_ks3_upprot_MASK              (0xC0000000U)
#define CSS_CSS_KS3_ks3_upprot_SHIFT             (30U)
/*! ks3_upprot - Priviledge level
 */
#define CSS_CSS_KS3_ks3_upprot(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS3_ks3_upprot_SHIFT)) & CSS_CSS_KS3_ks3_upprot_MASK)
/*! @} */

/*! @name CSS_KS4 - Status register */
/*! @{ */

#define CSS_CSS_KS4_ks4_ksize_MASK               (0x1U)
#define CSS_CSS_KS4_ks4_ksize_SHIFT              (0U)
/*! ks4_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS4_ks4_ksize(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_ksize_SHIFT)) & CSS_CSS_KS4_ks4_ksize_MASK)

#define CSS_CSS_KS4_ks4_rsvd0_MASK               (0x1EU)
#define CSS_CSS_KS4_ks4_rsvd0_SHIFT              (1U)
/*! ks4_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS4_ks4_rsvd0(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_rsvd0_SHIFT)) & CSS_CSS_KS4_ks4_rsvd0_MASK)

#define CSS_CSS_KS4_ks4_kact_MASK                (0x20U)
#define CSS_CSS_KS4_ks4_kact_SHIFT               (5U)
/*! ks4_kact - Key is active
 */
#define CSS_CSS_KS4_ks4_kact(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_kact_SHIFT)) & CSS_CSS_KS4_ks4_kact_MASK)

#define CSS_CSS_KS4_ks4_kbase_MASK               (0x40U)
#define CSS_CSS_KS4_ks4_kbase_SHIFT              (6U)
/*! ks4_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS4_ks4_kbase(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_kbase_SHIFT)) & CSS_CSS_KS4_ks4_kbase_MASK)

#define CSS_CSS_KS4_ks4_fgp_MASK                 (0x80U)
#define CSS_CSS_KS4_ks4_fgp_SHIFT                (7U)
/*! ks4_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS4_ks4_fgp(x)                   (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_fgp_SHIFT)) & CSS_CSS_KS4_ks4_fgp_MASK)

#define CSS_CSS_KS4_ks4_frtn_MASK                (0x100U)
#define CSS_CSS_KS4_ks4_frtn_SHIFT               (8U)
/*! ks4_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS4_ks4_frtn(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_frtn_SHIFT)) & CSS_CSS_KS4_ks4_frtn_MASK)

#define CSS_CSS_KS4_ks4_fhwo_MASK                (0x200U)
#define CSS_CSS_KS4_ks4_fhwo_SHIFT               (9U)
/*! ks4_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS4_ks4_fhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_fhwo_SHIFT)) & CSS_CSS_KS4_ks4_fhwo_MASK)

#define CSS_CSS_KS4_ks4_rsvd1_MASK               (0x1C00U)
#define CSS_CSS_KS4_ks4_rsvd1_SHIFT              (10U)
/*! ks4_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS4_ks4_rsvd1(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_rsvd1_SHIFT)) & CSS_CSS_KS4_ks4_rsvd1_MASK)

#define CSS_CSS_KS4_ks4_ucmac_MASK               (0x2000U)
#define CSS_CSS_KS4_ks4_ucmac_SHIFT              (13U)
/*! ks4_ucmac - CMAC key
 */
#define CSS_CSS_KS4_ks4_ucmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_ucmac_SHIFT)) & CSS_CSS_KS4_ks4_ucmac_MASK)

#define CSS_CSS_KS4_ks4_uksk_MASK                (0x4000U)
#define CSS_CSS_KS4_ks4_uksk_SHIFT               (14U)
/*! ks4_uksk - KSK key
 */
#define CSS_CSS_KS4_ks4_uksk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_uksk_SHIFT)) & CSS_CSS_KS4_ks4_uksk_MASK)

#define CSS_CSS_KS4_ks4_urtf_MASK                (0x8000U)
#define CSS_CSS_KS4_ks4_urtf_SHIFT               (15U)
/*! ks4_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS4_ks4_urtf(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_urtf_SHIFT)) & CSS_CSS_KS4_ks4_urtf_MASK)

#define CSS_CSS_KS4_ks4_uckdf_MASK               (0x10000U)
#define CSS_CSS_KS4_ks4_uckdf_SHIFT              (16U)
/*! ks4_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS4_ks4_uckdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_uckdf_SHIFT)) & CSS_CSS_KS4_ks4_uckdf_MASK)

