RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS4_ks4_uhkdf_MASK               (0x20000U)
#define CSS_CSS_KS4_ks4_uhkdf_SHIFT              (17U)
/*! ks4_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS4_ks4_uhkdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_uhkdf_SHIFT)) & CSS_CSS_KS4_ks4_uhkdf_MASK)

#define CSS_CSS_KS4_ks4_uecsg_MASK               (0x40000U)
#define CSS_CSS_KS4_ks4_uecsg_SHIFT              (18U)
/*! ks4_uecsg - Ecc signing key
 */
#define CSS_CSS_KS4_ks4_uecsg(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_uecsg_SHIFT)) & CSS_CSS_KS4_ks4_uecsg_MASK)

#define CSS_CSS_KS4_ks4_uecdh_MASK               (0x80000U)
#define CSS_CSS_KS4_ks4_uecdh_SHIFT              (19U)
/*! ks4_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS4_ks4_uecdh(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_uecdh_SHIFT)) & CSS_CSS_KS4_ks4_uecdh_MASK)

#define CSS_CSS_KS4_ks4_uaes_MASK                (0x100000U)
#define CSS_CSS_KS4_ks4_uaes_SHIFT               (20U)
/*! ks4_uaes - Aes key
 */
#define CSS_CSS_KS4_ks4_uaes(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_uaes_SHIFT)) & CSS_CSS_KS4_ks4_uaes_MASK)

#define CSS_CSS_KS4_ks4_uhmac_MASK               (0x200000U)
#define CSS_CSS_KS4_ks4_uhmac_SHIFT              (21U)
/*! ks4_uhmac - Hmac key
 */
#define CSS_CSS_KS4_ks4_uhmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_uhmac_SHIFT)) & CSS_CSS_KS4_ks4_uhmac_MASK)

#define CSS_CSS_KS4_ks4_ukwk_MASK                (0x400000U)
#define CSS_CSS_KS4_ks4_ukwk_SHIFT               (22U)
/*! ks4_ukwk - Key wrapping key
 */
#define CSS_CSS_KS4_ks4_ukwk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_ukwk_SHIFT)) & CSS_CSS_KS4_ks4_ukwk_MASK)

#define CSS_CSS_KS4_ks4_ukuok_MASK               (0x800000U)
#define CSS_CSS_KS4_ks4_ukuok_SHIFT              (23U)
/*! ks4_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS4_ks4_ukuok(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_ukuok_SHIFT)) & CSS_CSS_KS4_ks4_ukuok_MASK)

#define CSS_CSS_KS4_ks4_utlspms_MASK             (0x1000000U)
#define CSS_CSS_KS4_ks4_utlspms_SHIFT            (24U)
/*! ks4_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS4_ks4_utlspms(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_utlspms_SHIFT)) & CSS_CSS_KS4_ks4_utlspms_MASK)

#define CSS_CSS_KS4_ks4_utlsms_MASK              (0x2000000U)
#define CSS_CSS_KS4_ks4_utlsms_SHIFT             (25U)
/*! ks4_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS4_ks4_utlsms(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_utlsms_SHIFT)) & CSS_CSS_KS4_ks4_utlsms_MASK)

#define CSS_CSS_KS4_ks4_ukgsrc_MASK              (0x4000000U)
#define CSS_CSS_KS4_ks4_ukgsrc_SHIFT             (26U)
/*! ks4_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS4_ks4_ukgsrc(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_ukgsrc_SHIFT)) & CSS_CSS_KS4_ks4_ukgsrc_MASK)

#define CSS_CSS_KS4_ks4_uhwo_MASK                (0x8000000U)
#define CSS_CSS_KS4_ks4_uhwo_SHIFT               (27U)
/*! ks4_uhwo - Hardware out key
 */
#define CSS_CSS_KS4_ks4_uhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_uhwo_SHIFT)) & CSS_CSS_KS4_ks4_uhwo_MASK)

#define CSS_CSS_KS4_ks4_uwrpok_MASK              (0x10000000U)
#define CSS_CSS_KS4_ks4_uwrpok_SHIFT             (28U)
/*! ks4_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS4_ks4_uwrpok(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_uwrpok_SHIFT)) & CSS_CSS_KS4_ks4_uwrpok_MASK)

#define CSS_CSS_KS4_ks4_uduk_MASK                (0x20000000U)
#define CSS_CSS_KS4_ks4_uduk_SHIFT               (29U)
/*! ks4_uduk - Device Unique Key
 */
#define CSS_CSS_KS4_ks4_uduk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_uduk_SHIFT)) & CSS_CSS_KS4_ks4_uduk_MASK)

#define CSS_CSS_KS4_ks4_upprot_MASK              (0xC0000000U)
#define CSS_CSS_KS4_ks4_upprot_SHIFT             (30U)
/*! ks4_upprot - Priviledge level
 */
#define CSS_CSS_KS4_ks4_upprot(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS4_ks4_upprot_SHIFT)) & CSS_CSS_KS4_ks4_upprot_MASK)
/*! @} */

/*! @name CSS_KS5 - Status register */
/*! @{ */

#define CSS_CSS_KS5_ks5_ksize_MASK               (0x1U)
#define CSS_CSS_KS5_ks5_ksize_SHIFT              (0U)
/*! ks5_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS5_ks5_ksize(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_ksize_SHIFT)) & CSS_CSS_KS5_ks5_ksize_MASK)

#define CSS_CSS_KS5_ks5_rsvd0_MASK               (0x1EU)
#define CSS_CSS_KS5_ks5_rsvd0_SHIFT              (1U)
/*! ks5_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS5_ks5_rsvd0(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_rsvd0_SHIFT)) & CSS_CSS_KS5_ks5_rsvd0_MASK)

#define CSS_CSS_KS5_ks5_kact_MASK                (0x20U)
#define CSS_CSS_KS5_ks5_kact_SHIFT               (5U)
/*! ks5_kact - Key is active
 */
#define CSS_CSS_KS5_ks5_kact(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_kact_SHIFT)) & CSS_CSS_KS5_ks5_kact_MASK)

#define CSS_CSS_KS5_ks5_kbase_MASK               (0x40U)
#define CSS_CSS_KS5_ks5_kbase_SHIFT              (6U)
/*! ks5_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS5_ks5_kbase(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_kbase_SHIFT)) & CSS_CSS_KS5_ks5_kbase_MASK)

#define CSS_CSS_KS5_ks5_fgp_MASK                 (0x80U)
#define CSS_CSS_KS5_ks5_fgp_SHIFT                (7U)
/*! ks5_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS5_ks5_fgp(x)                   (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_fgp_SHIFT)) & CSS_CSS_KS5_ks5_fgp_MASK)

#define CSS_CSS_KS5_ks5_frtn_MASK                (0x100U)
#define CSS_CSS_KS5_ks5_frtn_SHIFT               (8U)
/*! ks5_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS5_ks5_frtn(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_frtn_SHIFT)) & CSS_CSS_KS5_ks5_frtn_MASK)

#define CSS_CSS_KS5_ks5_fhwo_MASK                (0x200U)
#define CSS_CSS_KS5_ks5_fhwo_SHIFT               (9U)
/*! ks5_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS5_ks5_fhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_fhwo_SHIFT)) & CSS_CSS_KS5_ks5_fhwo_MASK)

