RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS5_ks5_rsvd1_MASK               (0x1C00U)
#define CSS_CSS_KS5_ks5_rsvd1_SHIFT              (10U)
/*! ks5_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS5_ks5_rsvd1(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_rsvd1_SHIFT)) & CSS_CSS_KS5_ks5_rsvd1_MASK)

#define CSS_CSS_KS5_ks5_ucmac_MASK               (0x2000U)
#define CSS_CSS_KS5_ks5_ucmac_SHIFT              (13U)
/*! ks5_ucmac - CMAC key
 */
#define CSS_CSS_KS5_ks5_ucmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_ucmac_SHIFT)) & CSS_CSS_KS5_ks5_ucmac_MASK)

#define CSS_CSS_KS5_ks5_uksk_MASK                (0x4000U)
#define CSS_CSS_KS5_ks5_uksk_SHIFT               (14U)
/*! ks5_uksk - KSK key
 */
#define CSS_CSS_KS5_ks5_uksk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_uksk_SHIFT)) & CSS_CSS_KS5_ks5_uksk_MASK)

#define CSS_CSS_KS5_ks5_urtf_MASK                (0x8000U)
#define CSS_CSS_KS5_ks5_urtf_SHIFT               (15U)
/*! ks5_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS5_ks5_urtf(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_urtf_SHIFT)) & CSS_CSS_KS5_ks5_urtf_MASK)

#define CSS_CSS_KS5_ks5_uckdf_MASK               (0x10000U)
#define CSS_CSS_KS5_ks5_uckdf_SHIFT              (16U)
/*! ks5_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS5_ks5_uckdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_uckdf_SHIFT)) & CSS_CSS_KS5_ks5_uckdf_MASK)

#define CSS_CSS_KS5_ks5_uhkdf_MASK               (0x20000U)
#define CSS_CSS_KS5_ks5_uhkdf_SHIFT              (17U)
/*! ks5_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS5_ks5_uhkdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_uhkdf_SHIFT)) & CSS_CSS_KS5_ks5_uhkdf_MASK)

#define CSS_CSS_KS5_ks5_uecsg_MASK               (0x40000U)
#define CSS_CSS_KS5_ks5_uecsg_SHIFT              (18U)
/*! ks5_uecsg - Ecc signing key
 */
#define CSS_CSS_KS5_ks5_uecsg(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_uecsg_SHIFT)) & CSS_CSS_KS5_ks5_uecsg_MASK)

#define CSS_CSS_KS5_ks5_uecdh_MASK               (0x80000U)
#define CSS_CSS_KS5_ks5_uecdh_SHIFT              (19U)
/*! ks5_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS5_ks5_uecdh(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_uecdh_SHIFT)) & CSS_CSS_KS5_ks5_uecdh_MASK)

#define CSS_CSS_KS5_ks5_uaes_MASK                (0x100000U)
#define CSS_CSS_KS5_ks5_uaes_SHIFT               (20U)
/*! ks5_uaes - Aes key
 */
#define CSS_CSS_KS5_ks5_uaes(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_uaes_SHIFT)) & CSS_CSS_KS5_ks5_uaes_MASK)

#define CSS_CSS_KS5_ks5_uhmac_MASK               (0x200000U)
#define CSS_CSS_KS5_ks5_uhmac_SHIFT              (21U)
/*! ks5_uhmac - Hmac key
 */
#define CSS_CSS_KS5_ks5_uhmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_uhmac_SHIFT)) & CSS_CSS_KS5_ks5_uhmac_MASK)

#define CSS_CSS_KS5_ks5_ukwk_MASK                (0x400000U)
#define CSS_CSS_KS5_ks5_ukwk_SHIFT               (22U)
/*! ks5_ukwk - Key wrapping key
 */
#define CSS_CSS_KS5_ks5_ukwk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_ukwk_SHIFT)) & CSS_CSS_KS5_ks5_ukwk_MASK)

#define CSS_CSS_KS5_ks5_ukuok_MASK               (0x800000U)
#define CSS_CSS_KS5_ks5_ukuok_SHIFT              (23U)
/*! ks5_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS5_ks5_ukuok(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_ukuok_SHIFT)) & CSS_CSS_KS5_ks5_ukuok_MASK)

#define CSS_CSS_KS5_ks5_utlspms_MASK             (0x1000000U)
#define CSS_CSS_KS5_ks5_utlspms_SHIFT            (24U)
/*! ks5_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS5_ks5_utlspms(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_utlspms_SHIFT)) & CSS_CSS_KS5_ks5_utlspms_MASK)

#define CSS_CSS_KS5_ks5_utlsms_MASK              (0x2000000U)
#define CSS_CSS_KS5_ks5_utlsms_SHIFT             (25U)
/*! ks5_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS5_ks5_utlsms(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_utlsms_SHIFT)) & CSS_CSS_KS5_ks5_utlsms_MASK)

#define CSS_CSS_KS5_ks5_ukgsrc_MASK              (0x4000000U)
#define CSS_CSS_KS5_ks5_ukgsrc_SHIFT             (26U)
/*! ks5_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS5_ks5_ukgsrc(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_ukgsrc_SHIFT)) & CSS_CSS_KS5_ks5_ukgsrc_MASK)

#define CSS_CSS_KS5_ks5_uhwo_MASK                (0x8000000U)
#define CSS_CSS_KS5_ks5_uhwo_SHIFT               (27U)
/*! ks5_uhwo - Hardware out key
 */
#define CSS_CSS_KS5_ks5_uhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_uhwo_SHIFT)) & CSS_CSS_KS5_ks5_uhwo_MASK)

#define CSS_CSS_KS5_ks5_uwrpok_MASK              (0x10000000U)
#define CSS_CSS_KS5_ks5_uwrpok_SHIFT             (28U)
/*! ks5_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS5_ks5_uwrpok(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_uwrpok_SHIFT)) & CSS_CSS_KS5_ks5_uwrpok_MASK)

#define CSS_CSS_KS5_ks5_uduk_MASK                (0x20000000U)
#define CSS_CSS_KS5_ks5_uduk_SHIFT               (29U)
/*! ks5_uduk - Device Unique Key
 */
#define CSS_CSS_KS5_ks5_uduk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_uduk_SHIFT)) & CSS_CSS_KS5_ks5_uduk_MASK)

#define CSS_CSS_KS5_ks5_upprot_MASK              (0xC0000000U)
#define CSS_CSS_KS5_ks5_upprot_SHIFT             (30U)
/*! ks5_upprot - Priviledge level
 */
#define CSS_CSS_KS5_ks5_upprot(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS5_ks5_upprot_SHIFT)) & CSS_CSS_KS5_ks5_upprot_MASK)
/*! @} */

/*! @name CSS_KS6 - Status register */
/*! @{ */

#define CSS_CSS_KS6_ks6_ksize_MASK               (0x1U)
#define CSS_CSS_KS6_ks6_ksize_SHIFT              (0U)
/*! ks6_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS6_ks6_ksize(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_ksize_SHIFT)) & CSS_CSS_KS6_ks6_ksize_MASK)

#define CSS_CSS_KS6_ks6_rsvd0_MASK               (0x1EU)
#define CSS_CSS_KS6_ks6_rsvd0_SHIFT              (1U)
/*! ks6_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS6_ks6_rsvd0(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_rsvd0_SHIFT)) & CSS_CSS_KS6_ks6_rsvd0_MASK)

#define CSS_CSS_KS6_ks6_kact_MASK                (0x20U)
#define CSS_CSS_KS6_ks6_kact_SHIFT               (5U)
/*! ks6_kact - Key is active
 */
#define CSS_CSS_KS6_ks6_kact(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_kact_SHIFT)) & CSS_CSS_KS6_ks6_kact_MASK)

