RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS6_ks6_kbase_MASK               (0x40U)
#define CSS_CSS_KS6_ks6_kbase_SHIFT              (6U)
/*! ks6_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS6_ks6_kbase(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_kbase_SHIFT)) & CSS_CSS_KS6_ks6_kbase_MASK)

#define CSS_CSS_KS6_ks6_fgp_MASK                 (0x80U)
#define CSS_CSS_KS6_ks6_fgp_SHIFT                (7U)
/*! ks6_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS6_ks6_fgp(x)                   (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_fgp_SHIFT)) & CSS_CSS_KS6_ks6_fgp_MASK)

#define CSS_CSS_KS6_ks6_frtn_MASK                (0x100U)
#define CSS_CSS_KS6_ks6_frtn_SHIFT               (8U)
/*! ks6_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS6_ks6_frtn(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_frtn_SHIFT)) & CSS_CSS_KS6_ks6_frtn_MASK)

#define CSS_CSS_KS6_ks6_fhwo_MASK                (0x200U)
#define CSS_CSS_KS6_ks6_fhwo_SHIFT               (9U)
/*! ks6_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS6_ks6_fhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_fhwo_SHIFT)) & CSS_CSS_KS6_ks6_fhwo_MASK)

#define CSS_CSS_KS6_ks6_rsvd1_MASK               (0x1C00U)
#define CSS_CSS_KS6_ks6_rsvd1_SHIFT              (10U)
/*! ks6_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS6_ks6_rsvd1(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_rsvd1_SHIFT)) & CSS_CSS_KS6_ks6_rsvd1_MASK)

#define CSS_CSS_KS6_ks6_ucmac_MASK               (0x2000U)
#define CSS_CSS_KS6_ks6_ucmac_SHIFT              (13U)
/*! ks6_ucmac - CMAC key
 */
#define CSS_CSS_KS6_ks6_ucmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_ucmac_SHIFT)) & CSS_CSS_KS6_ks6_ucmac_MASK)

#define CSS_CSS_KS6_ks6_uksk_MASK                (0x4000U)
#define CSS_CSS_KS6_ks6_uksk_SHIFT               (14U)
/*! ks6_uksk - KSK key
 */
#define CSS_CSS_KS6_ks6_uksk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_uksk_SHIFT)) & CSS_CSS_KS6_ks6_uksk_MASK)

#define CSS_CSS_KS6_ks6_urtf_MASK                (0x8000U)
#define CSS_CSS_KS6_ks6_urtf_SHIFT               (15U)
/*! ks6_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS6_ks6_urtf(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_urtf_SHIFT)) & CSS_CSS_KS6_ks6_urtf_MASK)

#define CSS_CSS_KS6_ks6_uckdf_MASK               (0x10000U)
#define CSS_CSS_KS6_ks6_uckdf_SHIFT              (16U)
/*! ks6_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS6_ks6_uckdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_uckdf_SHIFT)) & CSS_CSS_KS6_ks6_uckdf_MASK)

#define CSS_CSS_KS6_ks6_uhkdf_MASK               (0x20000U)
#define CSS_CSS_KS6_ks6_uhkdf_SHIFT              (17U)
/*! ks6_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS6_ks6_uhkdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_uhkdf_SHIFT)) & CSS_CSS_KS6_ks6_uhkdf_MASK)

#define CSS_CSS_KS6_ks6_uecsg_MASK               (0x40000U)
#define CSS_CSS_KS6_ks6_uecsg_SHIFT              (18U)
/*! ks6_uecsg - Ecc signing key
 */
#define CSS_CSS_KS6_ks6_uecsg(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_uecsg_SHIFT)) & CSS_CSS_KS6_ks6_uecsg_MASK)

#define CSS_CSS_KS6_ks6_uecdh_MASK               (0x80000U)
#define CSS_CSS_KS6_ks6_uecdh_SHIFT              (19U)
/*! ks6_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS6_ks6_uecdh(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_uecdh_SHIFT)) & CSS_CSS_KS6_ks6_uecdh_MASK)

#define CSS_CSS_KS6_ks6_uaes_MASK                (0x100000U)
#define CSS_CSS_KS6_ks6_uaes_SHIFT               (20U)
/*! ks6_uaes - Aes key
 */
#define CSS_CSS_KS6_ks6_uaes(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_uaes_SHIFT)) & CSS_CSS_KS6_ks6_uaes_MASK)

#define CSS_CSS_KS6_ks6_uhmac_MASK               (0x200000U)
#define CSS_CSS_KS6_ks6_uhmac_SHIFT              (21U)
/*! ks6_uhmac - Hmac key
 */
#define CSS_CSS_KS6_ks6_uhmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_uhmac_SHIFT)) & CSS_CSS_KS6_ks6_uhmac_MASK)

#define CSS_CSS_KS6_ks6_ukwk_MASK                (0x400000U)
#define CSS_CSS_KS6_ks6_ukwk_SHIFT               (22U)
/*! ks6_ukwk - Key wrapping key
 */
#define CSS_CSS_KS6_ks6_ukwk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_ukwk_SHIFT)) & CSS_CSS_KS6_ks6_ukwk_MASK)

#define CSS_CSS_KS6_ks6_ukuok_MASK               (0x800000U)
#define CSS_CSS_KS6_ks6_ukuok_SHIFT              (23U)
/*! ks6_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS6_ks6_ukuok(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_ukuok_SHIFT)) & CSS_CSS_KS6_ks6_ukuok_MASK)

#define CSS_CSS_KS6_ks6_utlspms_MASK             (0x1000000U)
#define CSS_CSS_KS6_ks6_utlspms_SHIFT            (24U)
/*! ks6_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS6_ks6_utlspms(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_utlspms_SHIFT)) & CSS_CSS_KS6_ks6_utlspms_MASK)

#define CSS_CSS_KS6_ks6_utlsms_MASK              (0x2000000U)
#define CSS_CSS_KS6_ks6_utlsms_SHIFT             (25U)
/*! ks6_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS6_ks6_utlsms(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_utlsms_SHIFT)) & CSS_CSS_KS6_ks6_utlsms_MASK)

#define CSS_CSS_KS6_ks6_ukgsrc_MASK              (0x4000000U)
#define CSS_CSS_KS6_ks6_ukgsrc_SHIFT             (26U)
/*! ks6_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS6_ks6_ukgsrc(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_ukgsrc_SHIFT)) & CSS_CSS_KS6_ks6_ukgsrc_MASK)

#define CSS_CSS_KS6_ks6_uhwo_MASK                (0x8000000U)
#define CSS_CSS_KS6_ks6_uhwo_SHIFT               (27U)
/*! ks6_uhwo - Hardware out key
 */
#define CSS_CSS_KS6_ks6_uhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_uhwo_SHIFT)) & CSS_CSS_KS6_ks6_uhwo_MASK)

#define CSS_CSS_KS6_ks6_uwrpok_MASK              (0x10000000U)
#define CSS_CSS_KS6_ks6_uwrpok_SHIFT             (28U)
/*! ks6_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS6_ks6_uwrpok(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_uwrpok_SHIFT)) & CSS_CSS_KS6_ks6_uwrpok_MASK)

