RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS6_ks6_uduk_MASK                (0x20000000U)
#define CSS_CSS_KS6_ks6_uduk_SHIFT               (29U)
/*! ks6_uduk - Device Unique Key
 */
#define CSS_CSS_KS6_ks6_uduk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_uduk_SHIFT)) & CSS_CSS_KS6_ks6_uduk_MASK)

#define CSS_CSS_KS6_ks6_upprot_MASK              (0xC0000000U)
#define CSS_CSS_KS6_ks6_upprot_SHIFT             (30U)
/*! ks6_upprot - Priviledge level
 */
#define CSS_CSS_KS6_ks6_upprot(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS6_ks6_upprot_SHIFT)) & CSS_CSS_KS6_ks6_upprot_MASK)
/*! @} */

/*! @name CSS_KS7 - Status register */
/*! @{ */

#define CSS_CSS_KS7_ks7_ksize_MASK               (0x1U)
#define CSS_CSS_KS7_ks7_ksize_SHIFT              (0U)
/*! ks7_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS7_ks7_ksize(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_ksize_SHIFT)) & CSS_CSS_KS7_ks7_ksize_MASK)

#define CSS_CSS_KS7_ks7_rsvd0_MASK               (0x1EU)
#define CSS_CSS_KS7_ks7_rsvd0_SHIFT              (1U)
/*! ks7_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS7_ks7_rsvd0(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_rsvd0_SHIFT)) & CSS_CSS_KS7_ks7_rsvd0_MASK)

#define CSS_CSS_KS7_ks7_kact_MASK                (0x20U)
#define CSS_CSS_KS7_ks7_kact_SHIFT               (5U)
/*! ks7_kact - Key is active
 */
#define CSS_CSS_KS7_ks7_kact(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_kact_SHIFT)) & CSS_CSS_KS7_ks7_kact_MASK)

#define CSS_CSS_KS7_ks7_kbase_MASK               (0x40U)
#define CSS_CSS_KS7_ks7_kbase_SHIFT              (6U)
/*! ks7_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS7_ks7_kbase(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_kbase_SHIFT)) & CSS_CSS_KS7_ks7_kbase_MASK)

#define CSS_CSS_KS7_ks7_fgp_MASK                 (0x80U)
#define CSS_CSS_KS7_ks7_fgp_SHIFT                (7U)
/*! ks7_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS7_ks7_fgp(x)                   (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_fgp_SHIFT)) & CSS_CSS_KS7_ks7_fgp_MASK)

#define CSS_CSS_KS7_ks7_frtn_MASK                (0x100U)
#define CSS_CSS_KS7_ks7_frtn_SHIFT               (8U)
/*! ks7_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS7_ks7_frtn(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_frtn_SHIFT)) & CSS_CSS_KS7_ks7_frtn_MASK)

#define CSS_CSS_KS7_ks7_fhwo_MASK                (0x200U)
#define CSS_CSS_KS7_ks7_fhwo_SHIFT               (9U)
/*! ks7_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS7_ks7_fhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_fhwo_SHIFT)) & CSS_CSS_KS7_ks7_fhwo_MASK)

#define CSS_CSS_KS7_ks7_rsvd1_MASK               (0x1C00U)
#define CSS_CSS_KS7_ks7_rsvd1_SHIFT              (10U)
/*! ks7_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS7_ks7_rsvd1(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_rsvd1_SHIFT)) & CSS_CSS_KS7_ks7_rsvd1_MASK)

#define CSS_CSS_KS7_ks7_ucmac_MASK               (0x2000U)
#define CSS_CSS_KS7_ks7_ucmac_SHIFT              (13U)
/*! ks7_ucmac - CMAC key
 */
#define CSS_CSS_KS7_ks7_ucmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_ucmac_SHIFT)) & CSS_CSS_KS7_ks7_ucmac_MASK)

#define CSS_CSS_KS7_ks7_uksk_MASK                (0x4000U)
#define CSS_CSS_KS7_ks7_uksk_SHIFT               (14U)
/*! ks7_uksk - KSK key
 */
#define CSS_CSS_KS7_ks7_uksk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_uksk_SHIFT)) & CSS_CSS_KS7_ks7_uksk_MASK)

#define CSS_CSS_KS7_ks7_urtf_MASK                (0x8000U)
#define CSS_CSS_KS7_ks7_urtf_SHIFT               (15U)
/*! ks7_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS7_ks7_urtf(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_urtf_SHIFT)) & CSS_CSS_KS7_ks7_urtf_MASK)

#define CSS_CSS_KS7_ks7_uckdf_MASK               (0x10000U)
#define CSS_CSS_KS7_ks7_uckdf_SHIFT              (16U)
/*! ks7_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS7_ks7_uckdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_uckdf_SHIFT)) & CSS_CSS_KS7_ks7_uckdf_MASK)

#define CSS_CSS_KS7_ks7_uhkdf_MASK               (0x20000U)
#define CSS_CSS_KS7_ks7_uhkdf_SHIFT              (17U)
/*! ks7_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS7_ks7_uhkdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_uhkdf_SHIFT)) & CSS_CSS_KS7_ks7_uhkdf_MASK)

#define CSS_CSS_KS7_ks7_uecsg_MASK               (0x40000U)
#define CSS_CSS_KS7_ks7_uecsg_SHIFT              (18U)
/*! ks7_uecsg - Ecc signing key
 */
#define CSS_CSS_KS7_ks7_uecsg(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_uecsg_SHIFT)) & CSS_CSS_KS7_ks7_uecsg_MASK)

#define CSS_CSS_KS7_ks7_uecdh_MASK               (0x80000U)
#define CSS_CSS_KS7_ks7_uecdh_SHIFT              (19U)
/*! ks7_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS7_ks7_uecdh(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_uecdh_SHIFT)) & CSS_CSS_KS7_ks7_uecdh_MASK)

#define CSS_CSS_KS7_ks7_uaes_MASK                (0x100000U)
#define CSS_CSS_KS7_ks7_uaes_SHIFT               (20U)
/*! ks7_uaes - Aes key
 */
#define CSS_CSS_KS7_ks7_uaes(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_uaes_SHIFT)) & CSS_CSS_KS7_ks7_uaes_MASK)

#define CSS_CSS_KS7_ks7_uhmac_MASK               (0x200000U)
#define CSS_CSS_KS7_ks7_uhmac_SHIFT              (21U)
/*! ks7_uhmac - Hmac key
 */
#define CSS_CSS_KS7_ks7_uhmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_uhmac_SHIFT)) & CSS_CSS_KS7_ks7_uhmac_MASK)

#define CSS_CSS_KS7_ks7_ukwk_MASK                (0x400000U)
#define CSS_CSS_KS7_ks7_ukwk_SHIFT               (22U)
/*! ks7_ukwk - Key wrapping key
 */
#define CSS_CSS_KS7_ks7_ukwk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_ukwk_SHIFT)) & CSS_CSS_KS7_ks7_ukwk_MASK)

#define CSS_CSS_KS7_ks7_ukuok_MASK               (0x800000U)
#define CSS_CSS_KS7_ks7_ukuok_SHIFT              (23U)
/*! ks7_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS7_ks7_ukuok(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_ukuok_SHIFT)) & CSS_CSS_KS7_ks7_ukuok_MASK)

#define CSS_CSS_KS7_ks7_utlspms_MASK             (0x1000000U)
#define CSS_CSS_KS7_ks7_utlspms_SHIFT            (24U)
/*! ks7_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS7_ks7_utlspms(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_utlspms_SHIFT)) & CSS_CSS_KS7_ks7_utlspms_MASK)

#define CSS_CSS_KS7_ks7_utlsms_MASK              (0x2000000U)
#define CSS_CSS_KS7_ks7_utlsms_SHIFT             (25U)
/*! ks7_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS7_ks7_utlsms(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_utlsms_SHIFT)) & CSS_CSS_KS7_ks7_utlsms_MASK)

#define CSS_CSS_KS7_ks7_ukgsrc_MASK              (0x4000000U)
#define CSS_CSS_KS7_ks7_ukgsrc_SHIFT             (26U)
/*! ks7_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS7_ks7_ukgsrc(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_ukgsrc_SHIFT)) & CSS_CSS_KS7_ks7_ukgsrc_MASK)

#define CSS_CSS_KS7_ks7_uhwo_MASK                (0x8000000U)
#define CSS_CSS_KS7_ks7_uhwo_SHIFT               (27U)
/*! ks7_uhwo - Hardware out key
 */
#define CSS_CSS_KS7_ks7_uhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_uhwo_SHIFT)) & CSS_CSS_KS7_ks7_uhwo_MASK)

