RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS7_ks7_uwrpok_MASK              (0x10000000U)
#define CSS_CSS_KS7_ks7_uwrpok_SHIFT             (28U)
/*! ks7_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS7_ks7_uwrpok(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_uwrpok_SHIFT)) & CSS_CSS_KS7_ks7_uwrpok_MASK)

#define CSS_CSS_KS7_ks7_uduk_MASK                (0x20000000U)
#define CSS_CSS_KS7_ks7_uduk_SHIFT               (29U)
/*! ks7_uduk - Device Unique Key
 */
#define CSS_CSS_KS7_ks7_uduk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_uduk_SHIFT)) & CSS_CSS_KS7_ks7_uduk_MASK)

#define CSS_CSS_KS7_ks7_upprot_MASK              (0xC0000000U)
#define CSS_CSS_KS7_ks7_upprot_SHIFT             (30U)
/*! ks7_upprot - Priviledge level
 */
#define CSS_CSS_KS7_ks7_upprot(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS7_ks7_upprot_SHIFT)) & CSS_CSS_KS7_ks7_upprot_MASK)
/*! @} */

/*! @name CSS_KS8 - Status register */
/*! @{ */

#define CSS_CSS_KS8_ks8_ksize_MASK               (0x1U)
#define CSS_CSS_KS8_ks8_ksize_SHIFT              (0U)
/*! ks8_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS8_ks8_ksize(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_ksize_SHIFT)) & CSS_CSS_KS8_ks8_ksize_MASK)

#define CSS_CSS_KS8_ks8_rsvd0_MASK               (0x1EU)
#define CSS_CSS_KS8_ks8_rsvd0_SHIFT              (1U)
/*! ks8_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS8_ks8_rsvd0(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_rsvd0_SHIFT)) & CSS_CSS_KS8_ks8_rsvd0_MASK)

#define CSS_CSS_KS8_ks8_kact_MASK                (0x20U)
#define CSS_CSS_KS8_ks8_kact_SHIFT               (5U)
/*! ks8_kact - Key is active
 */
#define CSS_CSS_KS8_ks8_kact(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_kact_SHIFT)) & CSS_CSS_KS8_ks8_kact_MASK)

#define CSS_CSS_KS8_ks8_kbase_MASK               (0x40U)
#define CSS_CSS_KS8_ks8_kbase_SHIFT              (6U)
/*! ks8_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS8_ks8_kbase(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_kbase_SHIFT)) & CSS_CSS_KS8_ks8_kbase_MASK)

#define CSS_CSS_KS8_ks8_fgp_MASK                 (0x80U)
#define CSS_CSS_KS8_ks8_fgp_SHIFT                (7U)
/*! ks8_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS8_ks8_fgp(x)                   (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_fgp_SHIFT)) & CSS_CSS_KS8_ks8_fgp_MASK)

#define CSS_CSS_KS8_ks8_frtn_MASK                (0x100U)
#define CSS_CSS_KS8_ks8_frtn_SHIFT               (8U)
/*! ks8_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS8_ks8_frtn(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_frtn_SHIFT)) & CSS_CSS_KS8_ks8_frtn_MASK)

#define CSS_CSS_KS8_ks8_fhwo_MASK                (0x200U)
#define CSS_CSS_KS8_ks8_fhwo_SHIFT               (9U)
/*! ks8_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS8_ks8_fhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_fhwo_SHIFT)) & CSS_CSS_KS8_ks8_fhwo_MASK)

#define CSS_CSS_KS8_ks8_rsvd1_MASK               (0x1C00U)
#define CSS_CSS_KS8_ks8_rsvd1_SHIFT              (10U)
/*! ks8_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS8_ks8_rsvd1(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_rsvd1_SHIFT)) & CSS_CSS_KS8_ks8_rsvd1_MASK)

#define CSS_CSS_KS8_ks8_ucmac_MASK               (0x2000U)
#define CSS_CSS_KS8_ks8_ucmac_SHIFT              (13U)
/*! ks8_ucmac - CMAC key
 */
#define CSS_CSS_KS8_ks8_ucmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_ucmac_SHIFT)) & CSS_CSS_KS8_ks8_ucmac_MASK)

#define CSS_CSS_KS8_ks8_uksk_MASK                (0x4000U)
#define CSS_CSS_KS8_ks8_uksk_SHIFT               (14U)
/*! ks8_uksk - KSK key
 */
#define CSS_CSS_KS8_ks8_uksk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_uksk_SHIFT)) & CSS_CSS_KS8_ks8_uksk_MASK)

#define CSS_CSS_KS8_ks8_urtf_MASK                (0x8000U)
#define CSS_CSS_KS8_ks8_urtf_SHIFT               (15U)
/*! ks8_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS8_ks8_urtf(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_urtf_SHIFT)) & CSS_CSS_KS8_ks8_urtf_MASK)

#define CSS_CSS_KS8_ks8_uckdf_MASK               (0x10000U)
#define CSS_CSS_KS8_ks8_uckdf_SHIFT              (16U)
/*! ks8_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS8_ks8_uckdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_uckdf_SHIFT)) & CSS_CSS_KS8_ks8_uckdf_MASK)

#define CSS_CSS_KS8_ks8_uhkdf_MASK               (0x20000U)
#define CSS_CSS_KS8_ks8_uhkdf_SHIFT              (17U)
/*! ks8_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS8_ks8_uhkdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_uhkdf_SHIFT)) & CSS_CSS_KS8_ks8_uhkdf_MASK)

#define CSS_CSS_KS8_ks8_uecsg_MASK               (0x40000U)
#define CSS_CSS_KS8_ks8_uecsg_SHIFT              (18U)
/*! ks8_uecsg - Ecc signing key
 */
#define CSS_CSS_KS8_ks8_uecsg(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_uecsg_SHIFT)) & CSS_CSS_KS8_ks8_uecsg_MASK)

#define CSS_CSS_KS8_ks8_uecdh_MASK               (0x80000U)
#define CSS_CSS_KS8_ks8_uecdh_SHIFT              (19U)
/*! ks8_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS8_ks8_uecdh(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_uecdh_SHIFT)) & CSS_CSS_KS8_ks8_uecdh_MASK)

#define CSS_CSS_KS8_ks8_uaes_MASK                (0x100000U)
#define CSS_CSS_KS8_ks8_uaes_SHIFT               (20U)
/*! ks8_uaes - Aes key
 */
#define CSS_CSS_KS8_ks8_uaes(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_uaes_SHIFT)) & CSS_CSS_KS8_ks8_uaes_MASK)

#define CSS_CSS_KS8_ks8_uhmac_MASK               (0x200000U)
#define CSS_CSS_KS8_ks8_uhmac_SHIFT              (21U)
/*! ks8_uhmac - Hmac key
 */
#define CSS_CSS_KS8_ks8_uhmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_uhmac_SHIFT)) & CSS_CSS_KS8_ks8_uhmac_MASK)

#define CSS_CSS_KS8_ks8_ukwk_MASK                (0x400000U)
#define CSS_CSS_KS8_ks8_ukwk_SHIFT               (22U)
/*! ks8_ukwk - Key wrapping key
 */
#define CSS_CSS_KS8_ks8_ukwk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_ukwk_SHIFT)) & CSS_CSS_KS8_ks8_ukwk_MASK)

#define CSS_CSS_KS8_ks8_ukuok_MASK               (0x800000U)
#define CSS_CSS_KS8_ks8_ukuok_SHIFT              (23U)
/*! ks8_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS8_ks8_ukuok(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_ukuok_SHIFT)) & CSS_CSS_KS8_ks8_ukuok_MASK)

#define CSS_CSS_KS8_ks8_utlspms_MASK             (0x1000000U)
#define CSS_CSS_KS8_ks8_utlspms_SHIFT            (24U)
/*! ks8_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS8_ks8_utlspms(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_utlspms_SHIFT)) & CSS_CSS_KS8_ks8_utlspms_MASK)

#define CSS_CSS_KS8_ks8_utlsms_MASK              (0x2000000U)
#define CSS_CSS_KS8_ks8_utlsms_SHIFT             (25U)
/*! ks8_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS8_ks8_utlsms(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_utlsms_SHIFT)) & CSS_CSS_KS8_ks8_utlsms_MASK)

#define CSS_CSS_KS8_ks8_ukgsrc_MASK              (0x4000000U)
#define CSS_CSS_KS8_ks8_ukgsrc_SHIFT             (26U)
/*! ks8_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS8_ks8_ukgsrc(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_ukgsrc_SHIFT)) & CSS_CSS_KS8_ks8_ukgsrc_MASK)

