RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS8_ks8_uhwo_MASK                (0x8000000U)
#define CSS_CSS_KS8_ks8_uhwo_SHIFT               (27U)
/*! ks8_uhwo - Hardware out key
 */
#define CSS_CSS_KS8_ks8_uhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_uhwo_SHIFT)) & CSS_CSS_KS8_ks8_uhwo_MASK)

#define CSS_CSS_KS8_ks8_uwrpok_MASK              (0x10000000U)
#define CSS_CSS_KS8_ks8_uwrpok_SHIFT             (28U)
/*! ks8_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS8_ks8_uwrpok(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_uwrpok_SHIFT)) & CSS_CSS_KS8_ks8_uwrpok_MASK)

#define CSS_CSS_KS8_ks8_uduk_MASK                (0x20000000U)
#define CSS_CSS_KS8_ks8_uduk_SHIFT               (29U)
/*! ks8_uduk - Device Unique Key
 */
#define CSS_CSS_KS8_ks8_uduk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_uduk_SHIFT)) & CSS_CSS_KS8_ks8_uduk_MASK)

#define CSS_CSS_KS8_ks8_upprot_MASK              (0xC0000000U)
#define CSS_CSS_KS8_ks8_upprot_SHIFT             (30U)
/*! ks8_upprot - Priviledge level
 */
#define CSS_CSS_KS8_ks8_upprot(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS8_ks8_upprot_SHIFT)) & CSS_CSS_KS8_ks8_upprot_MASK)
/*! @} */

/*! @name CSS_KS9 - Status register */
/*! @{ */

#define CSS_CSS_KS9_ks9_ksize_MASK               (0x1U)
#define CSS_CSS_KS9_ks9_ksize_SHIFT              (0U)
/*! ks9_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS9_ks9_ksize(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_ksize_SHIFT)) & CSS_CSS_KS9_ks9_ksize_MASK)

#define CSS_CSS_KS9_ks9_rsvd0_MASK               (0x1EU)
#define CSS_CSS_KS9_ks9_rsvd0_SHIFT              (1U)
/*! ks9_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS9_ks9_rsvd0(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_rsvd0_SHIFT)) & CSS_CSS_KS9_ks9_rsvd0_MASK)

#define CSS_CSS_KS9_ks9_kact_MASK                (0x20U)
#define CSS_CSS_KS9_ks9_kact_SHIFT               (5U)
/*! ks9_kact - Key is active
 */
#define CSS_CSS_KS9_ks9_kact(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_kact_SHIFT)) & CSS_CSS_KS9_ks9_kact_MASK)

#define CSS_CSS_KS9_ks9_kbase_MASK               (0x40U)
#define CSS_CSS_KS9_ks9_kbase_SHIFT              (6U)
/*! ks9_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS9_ks9_kbase(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_kbase_SHIFT)) & CSS_CSS_KS9_ks9_kbase_MASK)

#define CSS_CSS_KS9_ks9_fgp_MASK                 (0x80U)
#define CSS_CSS_KS9_ks9_fgp_SHIFT                (7U)
/*! ks9_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS9_ks9_fgp(x)                   (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_fgp_SHIFT)) & CSS_CSS_KS9_ks9_fgp_MASK)

#define CSS_CSS_KS9_ks9_frtn_MASK                (0x100U)
#define CSS_CSS_KS9_ks9_frtn_SHIFT               (8U)
/*! ks9_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS9_ks9_frtn(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_frtn_SHIFT)) & CSS_CSS_KS9_ks9_frtn_MASK)

#define CSS_CSS_KS9_ks9_fhwo_MASK                (0x200U)
#define CSS_CSS_KS9_ks9_fhwo_SHIFT               (9U)
/*! ks9_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS9_ks9_fhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_fhwo_SHIFT)) & CSS_CSS_KS9_ks9_fhwo_MASK)

#define CSS_CSS_KS9_ks9_rsvd1_MASK               (0x1C00U)
#define CSS_CSS_KS9_ks9_rsvd1_SHIFT              (10U)
/*! ks9_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS9_ks9_rsvd1(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_rsvd1_SHIFT)) & CSS_CSS_KS9_ks9_rsvd1_MASK)

#define CSS_CSS_KS9_ks9_ucmac_MASK               (0x2000U)
#define CSS_CSS_KS9_ks9_ucmac_SHIFT              (13U)
/*! ks9_ucmac - CMAC key
 */
#define CSS_CSS_KS9_ks9_ucmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_ucmac_SHIFT)) & CSS_CSS_KS9_ks9_ucmac_MASK)

#define CSS_CSS_KS9_ks9_uksk_MASK                (0x4000U)
#define CSS_CSS_KS9_ks9_uksk_SHIFT               (14U)
/*! ks9_uksk - KSK key
 */
#define CSS_CSS_KS9_ks9_uksk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_uksk_SHIFT)) & CSS_CSS_KS9_ks9_uksk_MASK)

#define CSS_CSS_KS9_ks9_urtf_MASK                (0x8000U)
#define CSS_CSS_KS9_ks9_urtf_SHIFT               (15U)
/*! ks9_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS9_ks9_urtf(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_urtf_SHIFT)) & CSS_CSS_KS9_ks9_urtf_MASK)

#define CSS_CSS_KS9_ks9_uckdf_MASK               (0x10000U)
#define CSS_CSS_KS9_ks9_uckdf_SHIFT              (16U)
/*! ks9_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS9_ks9_uckdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_uckdf_SHIFT)) & CSS_CSS_KS9_ks9_uckdf_MASK)

#define CSS_CSS_KS9_ks9_uhkdf_MASK               (0x20000U)
#define CSS_CSS_KS9_ks9_uhkdf_SHIFT              (17U)
/*! ks9_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS9_ks9_uhkdf(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_uhkdf_SHIFT)) & CSS_CSS_KS9_ks9_uhkdf_MASK)

#define CSS_CSS_KS9_ks9_uecsg_MASK               (0x40000U)
#define CSS_CSS_KS9_ks9_uecsg_SHIFT              (18U)
/*! ks9_uecsg - Ecc signing key
 */
#define CSS_CSS_KS9_ks9_uecsg(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_uecsg_SHIFT)) & CSS_CSS_KS9_ks9_uecsg_MASK)

#define CSS_CSS_KS9_ks9_uecdh_MASK               (0x80000U)
#define CSS_CSS_KS9_ks9_uecdh_SHIFT              (19U)
/*! ks9_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS9_ks9_uecdh(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_uecdh_SHIFT)) & CSS_CSS_KS9_ks9_uecdh_MASK)

#define CSS_CSS_KS9_ks9_uaes_MASK                (0x100000U)
#define CSS_CSS_KS9_ks9_uaes_SHIFT               (20U)
/*! ks9_uaes - Aes key
 */
#define CSS_CSS_KS9_ks9_uaes(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_uaes_SHIFT)) & CSS_CSS_KS9_ks9_uaes_MASK)

#define CSS_CSS_KS9_ks9_uhmac_MASK               (0x200000U)
#define CSS_CSS_KS9_ks9_uhmac_SHIFT              (21U)
/*! ks9_uhmac - Hmac key
 */
#define CSS_CSS_KS9_ks9_uhmac(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_uhmac_SHIFT)) & CSS_CSS_KS9_ks9_uhmac_MASK)

#define CSS_CSS_KS9_ks9_ukwk_MASK                (0x400000U)
#define CSS_CSS_KS9_ks9_ukwk_SHIFT               (22U)
/*! ks9_ukwk - Key wrapping key
 */
#define CSS_CSS_KS9_ks9_ukwk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_ukwk_SHIFT)) & CSS_CSS_KS9_ks9_ukwk_MASK)

#define CSS_CSS_KS9_ks9_ukuok_MASK               (0x800000U)
#define CSS_CSS_KS9_ks9_ukuok_SHIFT              (23U)
/*! ks9_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS9_ks9_ukuok(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_ukuok_SHIFT)) & CSS_CSS_KS9_ks9_ukuok_MASK)

#define CSS_CSS_KS9_ks9_utlspms_MASK             (0x1000000U)
#define CSS_CSS_KS9_ks9_utlspms_SHIFT            (24U)
/*! ks9_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS9_ks9_utlspms(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_utlspms_SHIFT)) & CSS_CSS_KS9_ks9_utlspms_MASK)

#define CSS_CSS_KS9_ks9_utlsms_MASK              (0x2000000U)
#define CSS_CSS_KS9_ks9_utlsms_SHIFT             (25U)
/*! ks9_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS9_ks9_utlsms(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_utlsms_SHIFT)) & CSS_CSS_KS9_ks9_utlsms_MASK)

#define CSS_CSS_KS9_ks9_ukgsrc_MASK              (0x4000000U)
#define CSS_CSS_KS9_ks9_ukgsrc_SHIFT             (26U)
/*! ks9_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS9_ks9_ukgsrc(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_ukgsrc_SHIFT)) & CSS_CSS_KS9_ks9_ukgsrc_MASK)

#define CSS_CSS_KS9_ks9_uhwo_MASK                (0x8000000U)
#define CSS_CSS_KS9_ks9_uhwo_SHIFT               (27U)
/*! ks9_uhwo - Hardware out key
 */
#define CSS_CSS_KS9_ks9_uhwo(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_uhwo_SHIFT)) & CSS_CSS_KS9_ks9_uhwo_MASK)

#define CSS_CSS_KS9_ks9_uwrpok_MASK              (0x10000000U)
#define CSS_CSS_KS9_ks9_uwrpok_SHIFT             (28U)
/*! ks9_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS9_ks9_uwrpok(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_uwrpok_SHIFT)) & CSS_CSS_KS9_ks9_uwrpok_MASK)

#define CSS_CSS_KS9_ks9_uduk_MASK                (0x20000000U)
#define CSS_CSS_KS9_ks9_uduk_SHIFT               (29U)
/*! ks9_uduk - Device Unique Key
 */
#define CSS_CSS_KS9_ks9_uduk(x)                  (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_uduk_SHIFT)) & CSS_CSS_KS9_ks9_uduk_MASK)

