RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS9_ks9_upprot_MASK              (0xC0000000U)
#define CSS_CSS_KS9_ks9_upprot_SHIFT             (30U)
/*! ks9_upprot - Priviledge level
 */
#define CSS_CSS_KS9_ks9_upprot(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS9_ks9_upprot_SHIFT)) & CSS_CSS_KS9_ks9_upprot_MASK)
/*! @} */

/*! @name CSS_KS10 - Status register */
/*! @{ */

#define CSS_CSS_KS10_ks10_ksize_MASK             (0x1U)
#define CSS_CSS_KS10_ks10_ksize_SHIFT            (0U)
/*! ks10_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS10_ks10_ksize(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_ksize_SHIFT)) & CSS_CSS_KS10_ks10_ksize_MASK)

#define CSS_CSS_KS10_ks10_rsvd0_MASK             (0x1EU)
#define CSS_CSS_KS10_ks10_rsvd0_SHIFT            (1U)
/*! ks10_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS10_ks10_rsvd0(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_rsvd0_SHIFT)) & CSS_CSS_KS10_ks10_rsvd0_MASK)

#define CSS_CSS_KS10_ks10_kact_MASK              (0x20U)
#define CSS_CSS_KS10_ks10_kact_SHIFT             (5U)
/*! ks10_kact - Key is active
 */
#define CSS_CSS_KS10_ks10_kact(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_kact_SHIFT)) & CSS_CSS_KS10_ks10_kact_MASK)

#define CSS_CSS_KS10_ks10_kbase_MASK             (0x40U)
#define CSS_CSS_KS10_ks10_kbase_SHIFT            (6U)
/*! ks10_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS10_ks10_kbase(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_kbase_SHIFT)) & CSS_CSS_KS10_ks10_kbase_MASK)

#define CSS_CSS_KS10_ks10_fgp_MASK               (0x80U)
#define CSS_CSS_KS10_ks10_fgp_SHIFT              (7U)
/*! ks10_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS10_ks10_fgp(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_fgp_SHIFT)) & CSS_CSS_KS10_ks10_fgp_MASK)

#define CSS_CSS_KS10_ks10_frtn_MASK              (0x100U)
#define CSS_CSS_KS10_ks10_frtn_SHIFT             (8U)
/*! ks10_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS10_ks10_frtn(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_frtn_SHIFT)) & CSS_CSS_KS10_ks10_frtn_MASK)

#define CSS_CSS_KS10_ks10_fhwo_MASK              (0x200U)
#define CSS_CSS_KS10_ks10_fhwo_SHIFT             (9U)
/*! ks10_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS10_ks10_fhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_fhwo_SHIFT)) & CSS_CSS_KS10_ks10_fhwo_MASK)

#define CSS_CSS_KS10_ks10_rsvd1_MASK             (0x1C00U)
#define CSS_CSS_KS10_ks10_rsvd1_SHIFT            (10U)
/*! ks10_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS10_ks10_rsvd1(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_rsvd1_SHIFT)) & CSS_CSS_KS10_ks10_rsvd1_MASK)

#define CSS_CSS_KS10_ks10_ucmac_MASK             (0x2000U)
#define CSS_CSS_KS10_ks10_ucmac_SHIFT            (13U)
/*! ks10_ucmac - CMAC key
 */
#define CSS_CSS_KS10_ks10_ucmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_ucmac_SHIFT)) & CSS_CSS_KS10_ks10_ucmac_MASK)

#define CSS_CSS_KS10_ks10_uksk_MASK              (0x4000U)
#define CSS_CSS_KS10_ks10_uksk_SHIFT             (14U)
/*! ks10_uksk - KSK key
 */
#define CSS_CSS_KS10_ks10_uksk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_uksk_SHIFT)) & CSS_CSS_KS10_ks10_uksk_MASK)

#define CSS_CSS_KS10_ks10_urtf_MASK              (0x8000U)
#define CSS_CSS_KS10_ks10_urtf_SHIFT             (15U)
/*! ks10_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS10_ks10_urtf(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_urtf_SHIFT)) & CSS_CSS_KS10_ks10_urtf_MASK)

#define CSS_CSS_KS10_ks10_uckdf_MASK             (0x10000U)
#define CSS_CSS_KS10_ks10_uckdf_SHIFT            (16U)
/*! ks10_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS10_ks10_uckdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_uckdf_SHIFT)) & CSS_CSS_KS10_ks10_uckdf_MASK)

#define CSS_CSS_KS10_ks10_uhkdf_MASK             (0x20000U)
#define CSS_CSS_KS10_ks10_uhkdf_SHIFT            (17U)
/*! ks10_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS10_ks10_uhkdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_uhkdf_SHIFT)) & CSS_CSS_KS10_ks10_uhkdf_MASK)

#define CSS_CSS_KS10_ks10_uecsg_MASK             (0x40000U)
#define CSS_CSS_KS10_ks10_uecsg_SHIFT            (18U)
/*! ks10_uecsg - Ecc signing key
 */
#define CSS_CSS_KS10_ks10_uecsg(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_uecsg_SHIFT)) & CSS_CSS_KS10_ks10_uecsg_MASK)

#define CSS_CSS_KS10_ks10_uecdh_MASK             (0x80000U)
#define CSS_CSS_KS10_ks10_uecdh_SHIFT            (19U)
/*! ks10_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS10_ks10_uecdh(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_uecdh_SHIFT)) & CSS_CSS_KS10_ks10_uecdh_MASK)

#define CSS_CSS_KS10_ks10_uaes_MASK              (0x100000U)
#define CSS_CSS_KS10_ks10_uaes_SHIFT             (20U)
/*! ks10_uaes - Aes key
 */
#define CSS_CSS_KS10_ks10_uaes(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_uaes_SHIFT)) & CSS_CSS_KS10_ks10_uaes_MASK)

#define CSS_CSS_KS10_ks10_uhmac_MASK             (0x200000U)
#define CSS_CSS_KS10_ks10_uhmac_SHIFT            (21U)
/*! ks10_uhmac - Hmac key
 */
#define CSS_CSS_KS10_ks10_uhmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_uhmac_SHIFT)) & CSS_CSS_KS10_ks10_uhmac_MASK)

#define CSS_CSS_KS10_ks10_ukwk_MASK              (0x400000U)
#define CSS_CSS_KS10_ks10_ukwk_SHIFT             (22U)
/*! ks10_ukwk - Key wrapping key
 */
#define CSS_CSS_KS10_ks10_ukwk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_ukwk_SHIFT)) & CSS_CSS_KS10_ks10_ukwk_MASK)

#define CSS_CSS_KS10_ks10_ukuok_MASK             (0x800000U)
#define CSS_CSS_KS10_ks10_ukuok_SHIFT            (23U)
/*! ks10_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS10_ks10_ukuok(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_ukuok_SHIFT)) & CSS_CSS_KS10_ks10_ukuok_MASK)

