RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS10_ks10_utlspms_MASK           (0x1000000U)
#define CSS_CSS_KS10_ks10_utlspms_SHIFT          (24U)
/*! ks10_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS10_ks10_utlspms(x)             (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_utlspms_SHIFT)) & CSS_CSS_KS10_ks10_utlspms_MASK)

#define CSS_CSS_KS10_ks10_utlsms_MASK            (0x2000000U)
#define CSS_CSS_KS10_ks10_utlsms_SHIFT           (25U)
/*! ks10_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS10_ks10_utlsms(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_utlsms_SHIFT)) & CSS_CSS_KS10_ks10_utlsms_MASK)

#define CSS_CSS_KS10_ks10_ukgsrc_MASK            (0x4000000U)
#define CSS_CSS_KS10_ks10_ukgsrc_SHIFT           (26U)
/*! ks10_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS10_ks10_ukgsrc(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_ukgsrc_SHIFT)) & CSS_CSS_KS10_ks10_ukgsrc_MASK)

#define CSS_CSS_KS10_ks10_uhwo_MASK              (0x8000000U)
#define CSS_CSS_KS10_ks10_uhwo_SHIFT             (27U)
/*! ks10_uhwo - Hardware out key
 */
#define CSS_CSS_KS10_ks10_uhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_uhwo_SHIFT)) & CSS_CSS_KS10_ks10_uhwo_MASK)

#define CSS_CSS_KS10_ks10_uwrpok_MASK            (0x10000000U)
#define CSS_CSS_KS10_ks10_uwrpok_SHIFT           (28U)
/*! ks10_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS10_ks10_uwrpok(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_uwrpok_SHIFT)) & CSS_CSS_KS10_ks10_uwrpok_MASK)

#define CSS_CSS_KS10_ks10_uduk_MASK              (0x20000000U)
#define CSS_CSS_KS10_ks10_uduk_SHIFT             (29U)
/*! ks10_uduk - Device Unique Key
 */
#define CSS_CSS_KS10_ks10_uduk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_uduk_SHIFT)) & CSS_CSS_KS10_ks10_uduk_MASK)

#define CSS_CSS_KS10_ks10_upprot_MASK            (0xC0000000U)
#define CSS_CSS_KS10_ks10_upprot_SHIFT           (30U)
/*! ks10_upprot - Priviledge level
 */
#define CSS_CSS_KS10_ks10_upprot(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS10_ks10_upprot_SHIFT)) & CSS_CSS_KS10_ks10_upprot_MASK)
/*! @} */

/*! @name CSS_KS11 - Status register */
/*! @{ */

#define CSS_CSS_KS11_ks11_ksize_MASK             (0x1U)
#define CSS_CSS_KS11_ks11_ksize_SHIFT            (0U)
/*! ks11_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS11_ks11_ksize(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_ksize_SHIFT)) & CSS_CSS_KS11_ks11_ksize_MASK)

#define CSS_CSS_KS11_ks11_rsvd0_MASK             (0x1EU)
#define CSS_CSS_KS11_ks11_rsvd0_SHIFT            (1U)
/*! ks11_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS11_ks11_rsvd0(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_rsvd0_SHIFT)) & CSS_CSS_KS11_ks11_rsvd0_MASK)

#define CSS_CSS_KS11_ks11_kact_MASK              (0x20U)
#define CSS_CSS_KS11_ks11_kact_SHIFT             (5U)
/*! ks11_kact - Key is active
 */
#define CSS_CSS_KS11_ks11_kact(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_kact_SHIFT)) & CSS_CSS_KS11_ks11_kact_MASK)

#define CSS_CSS_KS11_ks11_kbase_MASK             (0x40U)
#define CSS_CSS_KS11_ks11_kbase_SHIFT            (6U)
/*! ks11_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS11_ks11_kbase(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_kbase_SHIFT)) & CSS_CSS_KS11_ks11_kbase_MASK)

#define CSS_CSS_KS11_ks11_fgp_MASK               (0x80U)
#define CSS_CSS_KS11_ks11_fgp_SHIFT              (7U)
/*! ks11_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS11_ks11_fgp(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_fgp_SHIFT)) & CSS_CSS_KS11_ks11_fgp_MASK)

#define CSS_CSS_KS11_ks11_frtn_MASK              (0x100U)
#define CSS_CSS_KS11_ks11_frtn_SHIFT             (8U)
/*! ks11_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS11_ks11_frtn(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_frtn_SHIFT)) & CSS_CSS_KS11_ks11_frtn_MASK)

#define CSS_CSS_KS11_ks11_fhwo_MASK              (0x200U)
#define CSS_CSS_KS11_ks11_fhwo_SHIFT             (9U)
/*! ks11_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS11_ks11_fhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_fhwo_SHIFT)) & CSS_CSS_KS11_ks11_fhwo_MASK)

#define CSS_CSS_KS11_ks11_rsvd1_MASK             (0x1C00U)
#define CSS_CSS_KS11_ks11_rsvd1_SHIFT            (10U)
/*! ks11_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS11_ks11_rsvd1(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_rsvd1_SHIFT)) & CSS_CSS_KS11_ks11_rsvd1_MASK)

#define CSS_CSS_KS11_ks11_ucmac_MASK             (0x2000U)
#define CSS_CSS_KS11_ks11_ucmac_SHIFT            (13U)
/*! ks11_ucmac - CMAC key
 */
#define CSS_CSS_KS11_ks11_ucmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_ucmac_SHIFT)) & CSS_CSS_KS11_ks11_ucmac_MASK)

#define CSS_CSS_KS11_ks11_uksk_MASK              (0x4000U)
#define CSS_CSS_KS11_ks11_uksk_SHIFT             (14U)
/*! ks11_uksk - KSK key
 */
#define CSS_CSS_KS11_ks11_uksk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_uksk_SHIFT)) & CSS_CSS_KS11_ks11_uksk_MASK)

#define CSS_CSS_KS11_ks11_urtf_MASK              (0x8000U)
#define CSS_CSS_KS11_ks11_urtf_SHIFT             (15U)
/*! ks11_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS11_ks11_urtf(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_urtf_SHIFT)) & CSS_CSS_KS11_ks11_urtf_MASK)

#define CSS_CSS_KS11_ks11_uckdf_MASK             (0x10000U)
#define CSS_CSS_KS11_ks11_uckdf_SHIFT            (16U)
/*! ks11_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS11_ks11_uckdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_uckdf_SHIFT)) & CSS_CSS_KS11_ks11_uckdf_MASK)

#define CSS_CSS_KS11_ks11_uhkdf_MASK             (0x20000U)
#define CSS_CSS_KS11_ks11_uhkdf_SHIFT            (17U)
/*! ks11_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS11_ks11_uhkdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_uhkdf_SHIFT)) & CSS_CSS_KS11_ks11_uhkdf_MASK)

