RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS11_ks11_uecsg_MASK             (0x40000U)
#define CSS_CSS_KS11_ks11_uecsg_SHIFT            (18U)
/*! ks11_uecsg - Ecc signing key
 */
#define CSS_CSS_KS11_ks11_uecsg(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_uecsg_SHIFT)) & CSS_CSS_KS11_ks11_uecsg_MASK)

#define CSS_CSS_KS11_ks11_uecdh_MASK             (0x80000U)
#define CSS_CSS_KS11_ks11_uecdh_SHIFT            (19U)
/*! ks11_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS11_ks11_uecdh(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_uecdh_SHIFT)) & CSS_CSS_KS11_ks11_uecdh_MASK)

#define CSS_CSS_KS11_ks11_uaes_MASK              (0x100000U)
#define CSS_CSS_KS11_ks11_uaes_SHIFT             (20U)
/*! ks11_uaes - Aes key
 */
#define CSS_CSS_KS11_ks11_uaes(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_uaes_SHIFT)) & CSS_CSS_KS11_ks11_uaes_MASK)

#define CSS_CSS_KS11_ks11_uhmac_MASK             (0x200000U)
#define CSS_CSS_KS11_ks11_uhmac_SHIFT            (21U)
/*! ks11_uhmac - Hmac key
 */
#define CSS_CSS_KS11_ks11_uhmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_uhmac_SHIFT)) & CSS_CSS_KS11_ks11_uhmac_MASK)

#define CSS_CSS_KS11_ks11_ukwk_MASK              (0x400000U)
#define CSS_CSS_KS11_ks11_ukwk_SHIFT             (22U)
/*! ks11_ukwk - Key wrapping key
 */
#define CSS_CSS_KS11_ks11_ukwk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_ukwk_SHIFT)) & CSS_CSS_KS11_ks11_ukwk_MASK)

#define CSS_CSS_KS11_ks11_ukuok_MASK             (0x800000U)
#define CSS_CSS_KS11_ks11_ukuok_SHIFT            (23U)
/*! ks11_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS11_ks11_ukuok(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_ukuok_SHIFT)) & CSS_CSS_KS11_ks11_ukuok_MASK)

#define CSS_CSS_KS11_ks11_utlspms_MASK           (0x1000000U)
#define CSS_CSS_KS11_ks11_utlspms_SHIFT          (24U)
/*! ks11_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS11_ks11_utlspms(x)             (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_utlspms_SHIFT)) & CSS_CSS_KS11_ks11_utlspms_MASK)

#define CSS_CSS_KS11_ks11_utlsms_MASK            (0x2000000U)
#define CSS_CSS_KS11_ks11_utlsms_SHIFT           (25U)
/*! ks11_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS11_ks11_utlsms(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_utlsms_SHIFT)) & CSS_CSS_KS11_ks11_utlsms_MASK)

#define CSS_CSS_KS11_ks11_ukgsrc_MASK            (0x4000000U)
#define CSS_CSS_KS11_ks11_ukgsrc_SHIFT           (26U)
/*! ks11_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS11_ks11_ukgsrc(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_ukgsrc_SHIFT)) & CSS_CSS_KS11_ks11_ukgsrc_MASK)

#define CSS_CSS_KS11_ks11_uhwo_MASK              (0x8000000U)
#define CSS_CSS_KS11_ks11_uhwo_SHIFT             (27U)
/*! ks11_uhwo - Hardware out key
 */
#define CSS_CSS_KS11_ks11_uhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_uhwo_SHIFT)) & CSS_CSS_KS11_ks11_uhwo_MASK)

#define CSS_CSS_KS11_ks11_uwrpok_MASK            (0x10000000U)
#define CSS_CSS_KS11_ks11_uwrpok_SHIFT           (28U)
/*! ks11_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS11_ks11_uwrpok(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_uwrpok_SHIFT)) & CSS_CSS_KS11_ks11_uwrpok_MASK)

#define CSS_CSS_KS11_ks11_uduk_MASK              (0x20000000U)
#define CSS_CSS_KS11_ks11_uduk_SHIFT             (29U)
/*! ks11_uduk - Device Unique Key
 */
#define CSS_CSS_KS11_ks11_uduk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_uduk_SHIFT)) & CSS_CSS_KS11_ks11_uduk_MASK)

#define CSS_CSS_KS11_ks11_upprot_MASK            (0xC0000000U)
#define CSS_CSS_KS11_ks11_upprot_SHIFT           (30U)
/*! ks11_upprot - Priviledge level
 */
#define CSS_CSS_KS11_ks11_upprot(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS11_ks11_upprot_SHIFT)) & CSS_CSS_KS11_ks11_upprot_MASK)
/*! @} */

/*! @name CSS_KS12 - Status register */
/*! @{ */

#define CSS_CSS_KS12_ks12_ksize_MASK             (0x1U)
#define CSS_CSS_KS12_ks12_ksize_SHIFT            (0U)
/*! ks12_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS12_ks12_ksize(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_ksize_SHIFT)) & CSS_CSS_KS12_ks12_ksize_MASK)

#define CSS_CSS_KS12_ks12_rsvd0_MASK             (0x1EU)
#define CSS_CSS_KS12_ks12_rsvd0_SHIFT            (1U)
/*! ks12_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS12_ks12_rsvd0(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_rsvd0_SHIFT)) & CSS_CSS_KS12_ks12_rsvd0_MASK)

#define CSS_CSS_KS12_ks12_kact_MASK              (0x20U)
#define CSS_CSS_KS12_ks12_kact_SHIFT             (5U)
/*! ks12_kact - Key is active
 */
#define CSS_CSS_KS12_ks12_kact(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_kact_SHIFT)) & CSS_CSS_KS12_ks12_kact_MASK)

#define CSS_CSS_KS12_ks12_kbase_MASK             (0x40U)
#define CSS_CSS_KS12_ks12_kbase_SHIFT            (6U)
/*! ks12_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS12_ks12_kbase(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_kbase_SHIFT)) & CSS_CSS_KS12_ks12_kbase_MASK)

#define CSS_CSS_KS12_ks12_fgp_MASK               (0x80U)
#define CSS_CSS_KS12_ks12_fgp_SHIFT              (7U)
/*! ks12_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS12_ks12_fgp(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_fgp_SHIFT)) & CSS_CSS_KS12_ks12_fgp_MASK)

#define CSS_CSS_KS12_ks12_frtn_MASK              (0x100U)
#define CSS_CSS_KS12_ks12_frtn_SHIFT             (8U)
/*! ks12_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS12_ks12_frtn(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_frtn_SHIFT)) & CSS_CSS_KS12_ks12_frtn_MASK)

#define CSS_CSS_KS12_ks12_fhwo_MASK              (0x200U)
#define CSS_CSS_KS12_ks12_fhwo_SHIFT             (9U)
/*! ks12_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS12_ks12_fhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_fhwo_SHIFT)) & CSS_CSS_KS12_ks12_fhwo_MASK)

#define CSS_CSS_KS12_ks12_rsvd1_MASK             (0x1C00U)
#define CSS_CSS_KS12_ks12_rsvd1_SHIFT            (10U)
/*! ks12_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS12_ks12_rsvd1(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_rsvd1_SHIFT)) & CSS_CSS_KS12_ks12_rsvd1_MASK)

#define CSS_CSS_KS12_ks12_ucmac_MASK             (0x2000U)
#define CSS_CSS_KS12_ks12_ucmac_SHIFT            (13U)
/*! ks12_ucmac - CMAC key
 */
#define CSS_CSS_KS12_ks12_ucmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_ucmac_SHIFT)) & CSS_CSS_KS12_ks12_ucmac_MASK)

#define CSS_CSS_KS12_ks12_uksk_MASK              (0x4000U)
#define CSS_CSS_KS12_ks12_uksk_SHIFT             (14U)
/*! ks12_uksk - KSK key
 */
#define CSS_CSS_KS12_ks12_uksk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_uksk_SHIFT)) & CSS_CSS_KS12_ks12_uksk_MASK)

