RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS12_ks12_urtf_MASK              (0x8000U)
#define CSS_CSS_KS12_ks12_urtf_SHIFT             (15U)
/*! ks12_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS12_ks12_urtf(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_urtf_SHIFT)) & CSS_CSS_KS12_ks12_urtf_MASK)

#define CSS_CSS_KS12_ks12_uckdf_MASK             (0x10000U)
#define CSS_CSS_KS12_ks12_uckdf_SHIFT            (16U)
/*! ks12_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS12_ks12_uckdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_uckdf_SHIFT)) & CSS_CSS_KS12_ks12_uckdf_MASK)

#define CSS_CSS_KS12_ks12_uhkdf_MASK             (0x20000U)
#define CSS_CSS_KS12_ks12_uhkdf_SHIFT            (17U)
/*! ks12_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS12_ks12_uhkdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_uhkdf_SHIFT)) & CSS_CSS_KS12_ks12_uhkdf_MASK)

#define CSS_CSS_KS12_ks12_uecsg_MASK             (0x40000U)
#define CSS_CSS_KS12_ks12_uecsg_SHIFT            (18U)
/*! ks12_uecsg - Ecc signing key
 */
#define CSS_CSS_KS12_ks12_uecsg(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_uecsg_SHIFT)) & CSS_CSS_KS12_ks12_uecsg_MASK)

#define CSS_CSS_KS12_ks12_uecdh_MASK             (0x80000U)
#define CSS_CSS_KS12_ks12_uecdh_SHIFT            (19U)
/*! ks12_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS12_ks12_uecdh(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_uecdh_SHIFT)) & CSS_CSS_KS12_ks12_uecdh_MASK)

#define CSS_CSS_KS12_ks12_uaes_MASK              (0x100000U)
#define CSS_CSS_KS12_ks12_uaes_SHIFT             (20U)
/*! ks12_uaes - Aes key
 */
#define CSS_CSS_KS12_ks12_uaes(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_uaes_SHIFT)) & CSS_CSS_KS12_ks12_uaes_MASK)

#define CSS_CSS_KS12_ks12_uhmac_MASK             (0x200000U)
#define CSS_CSS_KS12_ks12_uhmac_SHIFT            (21U)
/*! ks12_uhmac - Hmac key
 */
#define CSS_CSS_KS12_ks12_uhmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_uhmac_SHIFT)) & CSS_CSS_KS12_ks12_uhmac_MASK)

#define CSS_CSS_KS12_ks12_ukwk_MASK              (0x400000U)
#define CSS_CSS_KS12_ks12_ukwk_SHIFT             (22U)
/*! ks12_ukwk - Key wrapping key
 */
#define CSS_CSS_KS12_ks12_ukwk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_ukwk_SHIFT)) & CSS_CSS_KS12_ks12_ukwk_MASK)

#define CSS_CSS_KS12_ks12_ukuok_MASK             (0x800000U)
#define CSS_CSS_KS12_ks12_ukuok_SHIFT            (23U)
/*! ks12_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS12_ks12_ukuok(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_ukuok_SHIFT)) & CSS_CSS_KS12_ks12_ukuok_MASK)

#define CSS_CSS_KS12_ks12_utlspms_MASK           (0x1000000U)
#define CSS_CSS_KS12_ks12_utlspms_SHIFT          (24U)
/*! ks12_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS12_ks12_utlspms(x)             (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_utlspms_SHIFT)) & CSS_CSS_KS12_ks12_utlspms_MASK)

#define CSS_CSS_KS12_ks12_utlsms_MASK            (0x2000000U)
#define CSS_CSS_KS12_ks12_utlsms_SHIFT           (25U)
/*! ks12_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS12_ks12_utlsms(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_utlsms_SHIFT)) & CSS_CSS_KS12_ks12_utlsms_MASK)

#define CSS_CSS_KS12_ks12_ukgsrc_MASK            (0x4000000U)
#define CSS_CSS_KS12_ks12_ukgsrc_SHIFT           (26U)
/*! ks12_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS12_ks12_ukgsrc(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_ukgsrc_SHIFT)) & CSS_CSS_KS12_ks12_ukgsrc_MASK)

#define CSS_CSS_KS12_ks12_uhwo_MASK              (0x8000000U)
#define CSS_CSS_KS12_ks12_uhwo_SHIFT             (27U)
/*! ks12_uhwo - Hardware out key
 */
#define CSS_CSS_KS12_ks12_uhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_uhwo_SHIFT)) & CSS_CSS_KS12_ks12_uhwo_MASK)

#define CSS_CSS_KS12_ks12_uwrpok_MASK            (0x10000000U)
#define CSS_CSS_KS12_ks12_uwrpok_SHIFT           (28U)
/*! ks12_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS12_ks12_uwrpok(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_uwrpok_SHIFT)) & CSS_CSS_KS12_ks12_uwrpok_MASK)

#define CSS_CSS_KS12_ks12_uduk_MASK              (0x20000000U)
#define CSS_CSS_KS12_ks12_uduk_SHIFT             (29U)
/*! ks12_uduk - Device Unique Key
 */
#define CSS_CSS_KS12_ks12_uduk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_uduk_SHIFT)) & CSS_CSS_KS12_ks12_uduk_MASK)

#define CSS_CSS_KS12_ks12_upprot_MASK            (0xC0000000U)
#define CSS_CSS_KS12_ks12_upprot_SHIFT           (30U)
/*! ks12_upprot - Priviledge level
 */
#define CSS_CSS_KS12_ks12_upprot(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS12_ks12_upprot_SHIFT)) & CSS_CSS_KS12_ks12_upprot_MASK)
/*! @} */

/*! @name CSS_KS13 - Status register */
/*! @{ */

#define CSS_CSS_KS13_ks13_ksize_MASK             (0x1U)
#define CSS_CSS_KS13_ks13_ksize_SHIFT            (0U)
/*! ks13_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS13_ks13_ksize(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_ksize_SHIFT)) & CSS_CSS_KS13_ks13_ksize_MASK)

#define CSS_CSS_KS13_ks13_rsvd0_MASK             (0x1EU)
#define CSS_CSS_KS13_ks13_rsvd0_SHIFT            (1U)
/*! ks13_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS13_ks13_rsvd0(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_rsvd0_SHIFT)) & CSS_CSS_KS13_ks13_rsvd0_MASK)

#define CSS_CSS_KS13_ks13_kact_MASK              (0x20U)
#define CSS_CSS_KS13_ks13_kact_SHIFT             (5U)
/*! ks13_kact - Key is active
 */
#define CSS_CSS_KS13_ks13_kact(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_kact_SHIFT)) & CSS_CSS_KS13_ks13_kact_MASK)

#define CSS_CSS_KS13_ks13_kbase_MASK             (0x40U)
#define CSS_CSS_KS13_ks13_kbase_SHIFT            (6U)
/*! ks13_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS13_ks13_kbase(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_kbase_SHIFT)) & CSS_CSS_KS13_ks13_kbase_MASK)

