RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS13_ks13_fgp_MASK               (0x80U)
#define CSS_CSS_KS13_ks13_fgp_SHIFT              (7U)
/*! ks13_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS13_ks13_fgp(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_fgp_SHIFT)) & CSS_CSS_KS13_ks13_fgp_MASK)

#define CSS_CSS_KS13_ks13_frtn_MASK              (0x100U)
#define CSS_CSS_KS13_ks13_frtn_SHIFT             (8U)
/*! ks13_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS13_ks13_frtn(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_frtn_SHIFT)) & CSS_CSS_KS13_ks13_frtn_MASK)

#define CSS_CSS_KS13_ks13_fhwo_MASK              (0x200U)
#define CSS_CSS_KS13_ks13_fhwo_SHIFT             (9U)
/*! ks13_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS13_ks13_fhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_fhwo_SHIFT)) & CSS_CSS_KS13_ks13_fhwo_MASK)

#define CSS_CSS_KS13_ks13_rsvd1_MASK             (0x1C00U)
#define CSS_CSS_KS13_ks13_rsvd1_SHIFT            (10U)
/*! ks13_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS13_ks13_rsvd1(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_rsvd1_SHIFT)) & CSS_CSS_KS13_ks13_rsvd1_MASK)

#define CSS_CSS_KS13_ks13_ucmac_MASK             (0x2000U)
#define CSS_CSS_KS13_ks13_ucmac_SHIFT            (13U)
/*! ks13_ucmac - CMAC key
 */
#define CSS_CSS_KS13_ks13_ucmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_ucmac_SHIFT)) & CSS_CSS_KS13_ks13_ucmac_MASK)

#define CSS_CSS_KS13_ks13_uksk_MASK              (0x4000U)
#define CSS_CSS_KS13_ks13_uksk_SHIFT             (14U)
/*! ks13_uksk - KSK key
 */
#define CSS_CSS_KS13_ks13_uksk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_uksk_SHIFT)) & CSS_CSS_KS13_ks13_uksk_MASK)

#define CSS_CSS_KS13_ks13_urtf_MASK              (0x8000U)
#define CSS_CSS_KS13_ks13_urtf_SHIFT             (15U)
/*! ks13_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS13_ks13_urtf(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_urtf_SHIFT)) & CSS_CSS_KS13_ks13_urtf_MASK)

#define CSS_CSS_KS13_ks13_uckdf_MASK             (0x10000U)
#define CSS_CSS_KS13_ks13_uckdf_SHIFT            (16U)
/*! ks13_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS13_ks13_uckdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_uckdf_SHIFT)) & CSS_CSS_KS13_ks13_uckdf_MASK)

#define CSS_CSS_KS13_ks13_uhkdf_MASK             (0x20000U)
#define CSS_CSS_KS13_ks13_uhkdf_SHIFT            (17U)
/*! ks13_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS13_ks13_uhkdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_uhkdf_SHIFT)) & CSS_CSS_KS13_ks13_uhkdf_MASK)

#define CSS_CSS_KS13_ks13_uecsg_MASK             (0x40000U)
#define CSS_CSS_KS13_ks13_uecsg_SHIFT            (18U)
/*! ks13_uecsg - Ecc signing key
 */
#define CSS_CSS_KS13_ks13_uecsg(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_uecsg_SHIFT)) & CSS_CSS_KS13_ks13_uecsg_MASK)

#define CSS_CSS_KS13_ks13_uecdh_MASK             (0x80000U)
#define CSS_CSS_KS13_ks13_uecdh_SHIFT            (19U)
/*! ks13_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS13_ks13_uecdh(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_uecdh_SHIFT)) & CSS_CSS_KS13_ks13_uecdh_MASK)

#define CSS_CSS_KS13_ks13_uaes_MASK              (0x100000U)
#define CSS_CSS_KS13_ks13_uaes_SHIFT             (20U)
/*! ks13_uaes - Aes key
 */
#define CSS_CSS_KS13_ks13_uaes(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_uaes_SHIFT)) & CSS_CSS_KS13_ks13_uaes_MASK)

#define CSS_CSS_KS13_ks13_uhmac_MASK             (0x200000U)
#define CSS_CSS_KS13_ks13_uhmac_SHIFT            (21U)
/*! ks13_uhmac - Hmac key
 */
#define CSS_CSS_KS13_ks13_uhmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_uhmac_SHIFT)) & CSS_CSS_KS13_ks13_uhmac_MASK)

#define CSS_CSS_KS13_ks13_ukwk_MASK              (0x400000U)
#define CSS_CSS_KS13_ks13_ukwk_SHIFT             (22U)
/*! ks13_ukwk - Key wrapping key
 */
#define CSS_CSS_KS13_ks13_ukwk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_ukwk_SHIFT)) & CSS_CSS_KS13_ks13_ukwk_MASK)

#define CSS_CSS_KS13_ks13_ukuok_MASK             (0x800000U)
#define CSS_CSS_KS13_ks13_ukuok_SHIFT            (23U)
/*! ks13_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS13_ks13_ukuok(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_ukuok_SHIFT)) & CSS_CSS_KS13_ks13_ukuok_MASK)

#define CSS_CSS_KS13_ks13_utlspms_MASK           (0x1000000U)
#define CSS_CSS_KS13_ks13_utlspms_SHIFT          (24U)
/*! ks13_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS13_ks13_utlspms(x)             (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_utlspms_SHIFT)) & CSS_CSS_KS13_ks13_utlspms_MASK)

#define CSS_CSS_KS13_ks13_utlsms_MASK            (0x2000000U)
#define CSS_CSS_KS13_ks13_utlsms_SHIFT           (25U)
/*! ks13_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS13_ks13_utlsms(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_utlsms_SHIFT)) & CSS_CSS_KS13_ks13_utlsms_MASK)

#define CSS_CSS_KS13_ks13_ukgsrc_MASK            (0x4000000U)
#define CSS_CSS_KS13_ks13_ukgsrc_SHIFT           (26U)
/*! ks13_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS13_ks13_ukgsrc(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_ukgsrc_SHIFT)) & CSS_CSS_KS13_ks13_ukgsrc_MASK)

#define CSS_CSS_KS13_ks13_uhwo_MASK              (0x8000000U)
#define CSS_CSS_KS13_ks13_uhwo_SHIFT             (27U)
/*! ks13_uhwo - Hardware out key
 */
#define CSS_CSS_KS13_ks13_uhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_uhwo_SHIFT)) & CSS_CSS_KS13_ks13_uhwo_MASK)

#define CSS_CSS_KS13_ks13_uwrpok_MASK            (0x10000000U)
#define CSS_CSS_KS13_ks13_uwrpok_SHIFT           (28U)
/*! ks13_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS13_ks13_uwrpok(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_uwrpok_SHIFT)) & CSS_CSS_KS13_ks13_uwrpok_MASK)

