RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS13_ks13_uduk_MASK              (0x20000000U)
#define CSS_CSS_KS13_ks13_uduk_SHIFT             (29U)
/*! ks13_uduk - Device Unique Key
 */
#define CSS_CSS_KS13_ks13_uduk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_uduk_SHIFT)) & CSS_CSS_KS13_ks13_uduk_MASK)

#define CSS_CSS_KS13_ks13_upprot_MASK            (0xC0000000U)
#define CSS_CSS_KS13_ks13_upprot_SHIFT           (30U)
/*! ks13_upprot - Priviledge level
 */
#define CSS_CSS_KS13_ks13_upprot(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS13_ks13_upprot_SHIFT)) & CSS_CSS_KS13_ks13_upprot_MASK)
/*! @} */

/*! @name CSS_KS14 - Status register */
/*! @{ */

#define CSS_CSS_KS14_ks14_ksize_MASK             (0x1U)
#define CSS_CSS_KS14_ks14_ksize_SHIFT            (0U)
/*! ks14_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS14_ks14_ksize(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_ksize_SHIFT)) & CSS_CSS_KS14_ks14_ksize_MASK)

#define CSS_CSS_KS14_ks14_rsvd0_MASK             (0x1EU)
#define CSS_CSS_KS14_ks14_rsvd0_SHIFT            (1U)
/*! ks14_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS14_ks14_rsvd0(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_rsvd0_SHIFT)) & CSS_CSS_KS14_ks14_rsvd0_MASK)

#define CSS_CSS_KS14_ks14_kact_MASK              (0x20U)
#define CSS_CSS_KS14_ks14_kact_SHIFT             (5U)
/*! ks14_kact - Key is active
 */
#define CSS_CSS_KS14_ks14_kact(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_kact_SHIFT)) & CSS_CSS_KS14_ks14_kact_MASK)

#define CSS_CSS_KS14_ks14_kbase_MASK             (0x40U)
#define CSS_CSS_KS14_ks14_kbase_SHIFT            (6U)
/*! ks14_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS14_ks14_kbase(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_kbase_SHIFT)) & CSS_CSS_KS14_ks14_kbase_MASK)

#define CSS_CSS_KS14_ks14_fgp_MASK               (0x80U)
#define CSS_CSS_KS14_ks14_fgp_SHIFT              (7U)
/*! ks14_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS14_ks14_fgp(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_fgp_SHIFT)) & CSS_CSS_KS14_ks14_fgp_MASK)

#define CSS_CSS_KS14_ks14_frtn_MASK              (0x100U)
#define CSS_CSS_KS14_ks14_frtn_SHIFT             (8U)
/*! ks14_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS14_ks14_frtn(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_frtn_SHIFT)) & CSS_CSS_KS14_ks14_frtn_MASK)

#define CSS_CSS_KS14_ks14_fhwo_MASK              (0x200U)
#define CSS_CSS_KS14_ks14_fhwo_SHIFT             (9U)
/*! ks14_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS14_ks14_fhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_fhwo_SHIFT)) & CSS_CSS_KS14_ks14_fhwo_MASK)

#define CSS_CSS_KS14_ks14_rsvd1_MASK             (0x1C00U)
#define CSS_CSS_KS14_ks14_rsvd1_SHIFT            (10U)
/*! ks14_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS14_ks14_rsvd1(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_rsvd1_SHIFT)) & CSS_CSS_KS14_ks14_rsvd1_MASK)

#define CSS_CSS_KS14_ks14_ucmac_MASK             (0x2000U)
#define CSS_CSS_KS14_ks14_ucmac_SHIFT            (13U)
/*! ks14_ucmac - CMAC key
 */
#define CSS_CSS_KS14_ks14_ucmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_ucmac_SHIFT)) & CSS_CSS_KS14_ks14_ucmac_MASK)

#define CSS_CSS_KS14_ks14_uksk_MASK              (0x4000U)
#define CSS_CSS_KS14_ks14_uksk_SHIFT             (14U)
/*! ks14_uksk - KSK key
 */
#define CSS_CSS_KS14_ks14_uksk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_uksk_SHIFT)) & CSS_CSS_KS14_ks14_uksk_MASK)

#define CSS_CSS_KS14_ks14_urtf_MASK              (0x8000U)
#define CSS_CSS_KS14_ks14_urtf_SHIFT             (15U)
/*! ks14_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS14_ks14_urtf(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_urtf_SHIFT)) & CSS_CSS_KS14_ks14_urtf_MASK)

#define CSS_CSS_KS14_ks14_uckdf_MASK             (0x10000U)
#define CSS_CSS_KS14_ks14_uckdf_SHIFT            (16U)
/*! ks14_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS14_ks14_uckdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_uckdf_SHIFT)) & CSS_CSS_KS14_ks14_uckdf_MASK)

#define CSS_CSS_KS14_ks14_uhkdf_MASK             (0x20000U)
#define CSS_CSS_KS14_ks14_uhkdf_SHIFT            (17U)
/*! ks14_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS14_ks14_uhkdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_uhkdf_SHIFT)) & CSS_CSS_KS14_ks14_uhkdf_MASK)

#define CSS_CSS_KS14_ks14_uecsg_MASK             (0x40000U)
#define CSS_CSS_KS14_ks14_uecsg_SHIFT            (18U)
/*! ks14_uecsg - Ecc signing key
 */
#define CSS_CSS_KS14_ks14_uecsg(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_uecsg_SHIFT)) & CSS_CSS_KS14_ks14_uecsg_MASK)

#define CSS_CSS_KS14_ks14_uecdh_MASK             (0x80000U)
#define CSS_CSS_KS14_ks14_uecdh_SHIFT            (19U)
/*! ks14_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS14_ks14_uecdh(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_uecdh_SHIFT)) & CSS_CSS_KS14_ks14_uecdh_MASK)

#define CSS_CSS_KS14_ks14_uaes_MASK              (0x100000U)
#define CSS_CSS_KS14_ks14_uaes_SHIFT             (20U)
/*! ks14_uaes - Aes key
 */
#define CSS_CSS_KS14_ks14_uaes(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_uaes_SHIFT)) & CSS_CSS_KS14_ks14_uaes_MASK)

#define CSS_CSS_KS14_ks14_uhmac_MASK             (0x200000U)
#define CSS_CSS_KS14_ks14_uhmac_SHIFT            (21U)
/*! ks14_uhmac - Hmac key
 */
#define CSS_CSS_KS14_ks14_uhmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_uhmac_SHIFT)) & CSS_CSS_KS14_ks14_uhmac_MASK)

#define CSS_CSS_KS14_ks14_ukwk_MASK              (0x400000U)
#define CSS_CSS_KS14_ks14_ukwk_SHIFT             (22U)
/*! ks14_ukwk - Key wrapping key
 */
#define CSS_CSS_KS14_ks14_ukwk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_ukwk_SHIFT)) & CSS_CSS_KS14_ks14_ukwk_MASK)

#define CSS_CSS_KS14_ks14_ukuok_MASK             (0x800000U)
#define CSS_CSS_KS14_ks14_ukuok_SHIFT            (23U)
/*! ks14_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS14_ks14_ukuok(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_ukuok_SHIFT)) & CSS_CSS_KS14_ks14_ukuok_MASK)

