RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS14_ks14_utlspms_MASK           (0x1000000U)
#define CSS_CSS_KS14_ks14_utlspms_SHIFT          (24U)
/*! ks14_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS14_ks14_utlspms(x)             (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_utlspms_SHIFT)) & CSS_CSS_KS14_ks14_utlspms_MASK)

#define CSS_CSS_KS14_ks14_utlsms_MASK            (0x2000000U)
#define CSS_CSS_KS14_ks14_utlsms_SHIFT           (25U)
/*! ks14_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS14_ks14_utlsms(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_utlsms_SHIFT)) & CSS_CSS_KS14_ks14_utlsms_MASK)

#define CSS_CSS_KS14_ks14_ukgsrc_MASK            (0x4000000U)
#define CSS_CSS_KS14_ks14_ukgsrc_SHIFT           (26U)
/*! ks14_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS14_ks14_ukgsrc(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_ukgsrc_SHIFT)) & CSS_CSS_KS14_ks14_ukgsrc_MASK)

#define CSS_CSS_KS14_ks14_uhwo_MASK              (0x8000000U)
#define CSS_CSS_KS14_ks14_uhwo_SHIFT             (27U)
/*! ks14_uhwo - Hardware out key
 */
#define CSS_CSS_KS14_ks14_uhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_uhwo_SHIFT)) & CSS_CSS_KS14_ks14_uhwo_MASK)

#define CSS_CSS_KS14_ks14_uwrpok_MASK            (0x10000000U)
#define CSS_CSS_KS14_ks14_uwrpok_SHIFT           (28U)
/*! ks14_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS14_ks14_uwrpok(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_uwrpok_SHIFT)) & CSS_CSS_KS14_ks14_uwrpok_MASK)

#define CSS_CSS_KS14_ks14_uduk_MASK              (0x20000000U)
#define CSS_CSS_KS14_ks14_uduk_SHIFT             (29U)
/*! ks14_uduk - Device Unique Key
 */
#define CSS_CSS_KS14_ks14_uduk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_uduk_SHIFT)) & CSS_CSS_KS14_ks14_uduk_MASK)

#define CSS_CSS_KS14_ks14_upprot_MASK            (0xC0000000U)
#define CSS_CSS_KS14_ks14_upprot_SHIFT           (30U)
/*! ks14_upprot - Priviledge level
 */
#define CSS_CSS_KS14_ks14_upprot(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS14_ks14_upprot_SHIFT)) & CSS_CSS_KS14_ks14_upprot_MASK)
/*! @} */

/*! @name CSS_KS15 - Status register */
/*! @{ */

#define CSS_CSS_KS15_ks15_ksize_MASK             (0x1U)
#define CSS_CSS_KS15_ks15_ksize_SHIFT            (0U)
/*! ks15_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS15_ks15_ksize(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_ksize_SHIFT)) & CSS_CSS_KS15_ks15_ksize_MASK)

#define CSS_CSS_KS15_ks15_rsvd0_MASK             (0x1EU)
#define CSS_CSS_KS15_ks15_rsvd0_SHIFT            (1U)
/*! ks15_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS15_ks15_rsvd0(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_rsvd0_SHIFT)) & CSS_CSS_KS15_ks15_rsvd0_MASK)

#define CSS_CSS_KS15_ks15_kact_MASK              (0x20U)
#define CSS_CSS_KS15_ks15_kact_SHIFT             (5U)
/*! ks15_kact - Key is active
 */
#define CSS_CSS_KS15_ks15_kact(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_kact_SHIFT)) & CSS_CSS_KS15_ks15_kact_MASK)

#define CSS_CSS_KS15_ks15_kbase_MASK             (0x40U)
#define CSS_CSS_KS15_ks15_kbase_SHIFT            (6U)
/*! ks15_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS15_ks15_kbase(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_kbase_SHIFT)) & CSS_CSS_KS15_ks15_kbase_MASK)

#define CSS_CSS_KS15_ks15_fgp_MASK               (0x80U)
#define CSS_CSS_KS15_ks15_fgp_SHIFT              (7U)
/*! ks15_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS15_ks15_fgp(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_fgp_SHIFT)) & CSS_CSS_KS15_ks15_fgp_MASK)

#define CSS_CSS_KS15_ks15_frtn_MASK              (0x100U)
#define CSS_CSS_KS15_ks15_frtn_SHIFT             (8U)
/*! ks15_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS15_ks15_frtn(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_frtn_SHIFT)) & CSS_CSS_KS15_ks15_frtn_MASK)

#define CSS_CSS_KS15_ks15_fhwo_MASK              (0x200U)
#define CSS_CSS_KS15_ks15_fhwo_SHIFT             (9U)
/*! ks15_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS15_ks15_fhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_fhwo_SHIFT)) & CSS_CSS_KS15_ks15_fhwo_MASK)

#define CSS_CSS_KS15_ks15_rsvd1_MASK             (0x1C00U)
#define CSS_CSS_KS15_ks15_rsvd1_SHIFT            (10U)
/*! ks15_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS15_ks15_rsvd1(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_rsvd1_SHIFT)) & CSS_CSS_KS15_ks15_rsvd1_MASK)

#define CSS_CSS_KS15_ks15_ucmac_MASK             (0x2000U)
#define CSS_CSS_KS15_ks15_ucmac_SHIFT            (13U)
/*! ks15_ucmac - CMAC key
 */
#define CSS_CSS_KS15_ks15_ucmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_ucmac_SHIFT)) & CSS_CSS_KS15_ks15_ucmac_MASK)

#define CSS_CSS_KS15_ks15_uksk_MASK              (0x4000U)
#define CSS_CSS_KS15_ks15_uksk_SHIFT             (14U)
/*! ks15_uksk - KSK key
 */
#define CSS_CSS_KS15_ks15_uksk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_uksk_SHIFT)) & CSS_CSS_KS15_ks15_uksk_MASK)

#define CSS_CSS_KS15_ks15_urtf_MASK              (0x8000U)
#define CSS_CSS_KS15_ks15_urtf_SHIFT             (15U)
/*! ks15_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS15_ks15_urtf(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_urtf_SHIFT)) & CSS_CSS_KS15_ks15_urtf_MASK)

#define CSS_CSS_KS15_ks15_uckdf_MASK             (0x10000U)
#define CSS_CSS_KS15_ks15_uckdf_SHIFT            (16U)
/*! ks15_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS15_ks15_uckdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_uckdf_SHIFT)) & CSS_CSS_KS15_ks15_uckdf_MASK)

#define CSS_CSS_KS15_ks15_uhkdf_MASK             (0x20000U)
#define CSS_CSS_KS15_ks15_uhkdf_SHIFT            (17U)
/*! ks15_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS15_ks15_uhkdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_uhkdf_SHIFT)) & CSS_CSS_KS15_ks15_uhkdf_MASK)

#define CSS_CSS_KS15_ks15_uecsg_MASK             (0x40000U)
#define CSS_CSS_KS15_ks15_uecsg_SHIFT            (18U)
/*! ks15_uecsg - Ecc signing key
 */
#define CSS_CSS_KS15_ks15_uecsg(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_uecsg_SHIFT)) & CSS_CSS_KS15_ks15_uecsg_MASK)

