RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS15_ks15_uecdh_MASK             (0x80000U)
#define CSS_CSS_KS15_ks15_uecdh_SHIFT            (19U)
/*! ks15_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS15_ks15_uecdh(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_uecdh_SHIFT)) & CSS_CSS_KS15_ks15_uecdh_MASK)

#define CSS_CSS_KS15_ks15_uaes_MASK              (0x100000U)
#define CSS_CSS_KS15_ks15_uaes_SHIFT             (20U)
/*! ks15_uaes - Aes key
 */
#define CSS_CSS_KS15_ks15_uaes(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_uaes_SHIFT)) & CSS_CSS_KS15_ks15_uaes_MASK)

#define CSS_CSS_KS15_ks15_uhmac_MASK             (0x200000U)
#define CSS_CSS_KS15_ks15_uhmac_SHIFT            (21U)
/*! ks15_uhmac - Hmac key
 */
#define CSS_CSS_KS15_ks15_uhmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_uhmac_SHIFT)) & CSS_CSS_KS15_ks15_uhmac_MASK)

#define CSS_CSS_KS15_ks15_ukwk_MASK              (0x400000U)
#define CSS_CSS_KS15_ks15_ukwk_SHIFT             (22U)
/*! ks15_ukwk - Key wrapping key
 */
#define CSS_CSS_KS15_ks15_ukwk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_ukwk_SHIFT)) & CSS_CSS_KS15_ks15_ukwk_MASK)

#define CSS_CSS_KS15_ks15_ukuok_MASK             (0x800000U)
#define CSS_CSS_KS15_ks15_ukuok_SHIFT            (23U)
/*! ks15_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS15_ks15_ukuok(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_ukuok_SHIFT)) & CSS_CSS_KS15_ks15_ukuok_MASK)

#define CSS_CSS_KS15_ks15_utlspms_MASK           (0x1000000U)
#define CSS_CSS_KS15_ks15_utlspms_SHIFT          (24U)
/*! ks15_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS15_ks15_utlspms(x)             (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_utlspms_SHIFT)) & CSS_CSS_KS15_ks15_utlspms_MASK)

#define CSS_CSS_KS15_ks15_utlsms_MASK            (0x2000000U)
#define CSS_CSS_KS15_ks15_utlsms_SHIFT           (25U)
/*! ks15_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS15_ks15_utlsms(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_utlsms_SHIFT)) & CSS_CSS_KS15_ks15_utlsms_MASK)

#define CSS_CSS_KS15_ks15_ukgsrc_MASK            (0x4000000U)
#define CSS_CSS_KS15_ks15_ukgsrc_SHIFT           (26U)
/*! ks15_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS15_ks15_ukgsrc(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_ukgsrc_SHIFT)) & CSS_CSS_KS15_ks15_ukgsrc_MASK)

#define CSS_CSS_KS15_ks15_uhwo_MASK              (0x8000000U)
#define CSS_CSS_KS15_ks15_uhwo_SHIFT             (27U)
/*! ks15_uhwo - Hardware out key
 */
#define CSS_CSS_KS15_ks15_uhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_uhwo_SHIFT)) & CSS_CSS_KS15_ks15_uhwo_MASK)

#define CSS_CSS_KS15_ks15_uwrpok_MASK            (0x10000000U)
#define CSS_CSS_KS15_ks15_uwrpok_SHIFT           (28U)
/*! ks15_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS15_ks15_uwrpok(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_uwrpok_SHIFT)) & CSS_CSS_KS15_ks15_uwrpok_MASK)

#define CSS_CSS_KS15_ks15_uduk_MASK              (0x20000000U)
#define CSS_CSS_KS15_ks15_uduk_SHIFT             (29U)
/*! ks15_uduk - Device Unique Key
 */
#define CSS_CSS_KS15_ks15_uduk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_uduk_SHIFT)) & CSS_CSS_KS15_ks15_uduk_MASK)

#define CSS_CSS_KS15_ks15_upprot_MASK            (0xC0000000U)
#define CSS_CSS_KS15_ks15_upprot_SHIFT           (30U)
/*! ks15_upprot - Priviledge level
 */
#define CSS_CSS_KS15_ks15_upprot(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS15_ks15_upprot_SHIFT)) & CSS_CSS_KS15_ks15_upprot_MASK)
/*! @} */

/*! @name CSS_KS16 - Status register */
/*! @{ */

#define CSS_CSS_KS16_ks16_ksize_MASK             (0x1U)
#define CSS_CSS_KS16_ks16_ksize_SHIFT            (0U)
/*! ks16_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS16_ks16_ksize(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_ksize_SHIFT)) & CSS_CSS_KS16_ks16_ksize_MASK)

#define CSS_CSS_KS16_ks16_rsvd0_MASK             (0x1EU)
#define CSS_CSS_KS16_ks16_rsvd0_SHIFT            (1U)
/*! ks16_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS16_ks16_rsvd0(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_rsvd0_SHIFT)) & CSS_CSS_KS16_ks16_rsvd0_MASK)

#define CSS_CSS_KS16_ks16_kact_MASK              (0x20U)
#define CSS_CSS_KS16_ks16_kact_SHIFT             (5U)
/*! ks16_kact - Key is active
 */
#define CSS_CSS_KS16_ks16_kact(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_kact_SHIFT)) & CSS_CSS_KS16_ks16_kact_MASK)

#define CSS_CSS_KS16_ks16_kbase_MASK             (0x40U)
#define CSS_CSS_KS16_ks16_kbase_SHIFT            (6U)
/*! ks16_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS16_ks16_kbase(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_kbase_SHIFT)) & CSS_CSS_KS16_ks16_kbase_MASK)

#define CSS_CSS_KS16_ks16_fgp_MASK               (0x80U)
#define CSS_CSS_KS16_ks16_fgp_SHIFT              (7U)
/*! ks16_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS16_ks16_fgp(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_fgp_SHIFT)) & CSS_CSS_KS16_ks16_fgp_MASK)

#define CSS_CSS_KS16_ks16_frtn_MASK              (0x100U)
#define CSS_CSS_KS16_ks16_frtn_SHIFT             (8U)
/*! ks16_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS16_ks16_frtn(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_frtn_SHIFT)) & CSS_CSS_KS16_ks16_frtn_MASK)

#define CSS_CSS_KS16_ks16_fhwo_MASK              (0x200U)
#define CSS_CSS_KS16_ks16_fhwo_SHIFT             (9U)
/*! ks16_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS16_ks16_fhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_fhwo_SHIFT)) & CSS_CSS_KS16_ks16_fhwo_MASK)

#define CSS_CSS_KS16_ks16_rsvd1_MASK             (0x1C00U)
#define CSS_CSS_KS16_ks16_rsvd1_SHIFT            (10U)
/*! ks16_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS16_ks16_rsvd1(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_rsvd1_SHIFT)) & CSS_CSS_KS16_ks16_rsvd1_MASK)

#define CSS_CSS_KS16_ks16_ucmac_MASK             (0x2000U)
#define CSS_CSS_KS16_ks16_ucmac_SHIFT            (13U)
/*! ks16_ucmac - CMAC key
 */
#define CSS_CSS_KS16_ks16_ucmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_ucmac_SHIFT)) & CSS_CSS_KS16_ks16_ucmac_MASK)

