RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS16_ks16_uksk_MASK              (0x4000U)
#define CSS_CSS_KS16_ks16_uksk_SHIFT             (14U)
/*! ks16_uksk - KSK key
 */
#define CSS_CSS_KS16_ks16_uksk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_uksk_SHIFT)) & CSS_CSS_KS16_ks16_uksk_MASK)

#define CSS_CSS_KS16_ks16_urtf_MASK              (0x8000U)
#define CSS_CSS_KS16_ks16_urtf_SHIFT             (15U)
/*! ks16_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS16_ks16_urtf(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_urtf_SHIFT)) & CSS_CSS_KS16_ks16_urtf_MASK)

#define CSS_CSS_KS16_ks16_uckdf_MASK             (0x10000U)
#define CSS_CSS_KS16_ks16_uckdf_SHIFT            (16U)
/*! ks16_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS16_ks16_uckdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_uckdf_SHIFT)) & CSS_CSS_KS16_ks16_uckdf_MASK)

#define CSS_CSS_KS16_ks16_uhkdf_MASK             (0x20000U)
#define CSS_CSS_KS16_ks16_uhkdf_SHIFT            (17U)
/*! ks16_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS16_ks16_uhkdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_uhkdf_SHIFT)) & CSS_CSS_KS16_ks16_uhkdf_MASK)

#define CSS_CSS_KS16_ks16_uecsg_MASK             (0x40000U)
#define CSS_CSS_KS16_ks16_uecsg_SHIFT            (18U)
/*! ks16_uecsg - Ecc signing key
 */
#define CSS_CSS_KS16_ks16_uecsg(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_uecsg_SHIFT)) & CSS_CSS_KS16_ks16_uecsg_MASK)

#define CSS_CSS_KS16_ks16_uecdh_MASK             (0x80000U)
#define CSS_CSS_KS16_ks16_uecdh_SHIFT            (19U)
/*! ks16_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS16_ks16_uecdh(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_uecdh_SHIFT)) & CSS_CSS_KS16_ks16_uecdh_MASK)

#define CSS_CSS_KS16_ks16_uaes_MASK              (0x100000U)
#define CSS_CSS_KS16_ks16_uaes_SHIFT             (20U)
/*! ks16_uaes - Aes key
 */
#define CSS_CSS_KS16_ks16_uaes(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_uaes_SHIFT)) & CSS_CSS_KS16_ks16_uaes_MASK)

#define CSS_CSS_KS16_ks16_uhmac_MASK             (0x200000U)
#define CSS_CSS_KS16_ks16_uhmac_SHIFT            (21U)
/*! ks16_uhmac - Hmac key
 */
#define CSS_CSS_KS16_ks16_uhmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_uhmac_SHIFT)) & CSS_CSS_KS16_ks16_uhmac_MASK)

#define CSS_CSS_KS16_ks16_ukwk_MASK              (0x400000U)
#define CSS_CSS_KS16_ks16_ukwk_SHIFT             (22U)
/*! ks16_ukwk - Key wrapping key
 */
#define CSS_CSS_KS16_ks16_ukwk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_ukwk_SHIFT)) & CSS_CSS_KS16_ks16_ukwk_MASK)

#define CSS_CSS_KS16_ks16_ukuok_MASK             (0x800000U)
#define CSS_CSS_KS16_ks16_ukuok_SHIFT            (23U)
/*! ks16_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS16_ks16_ukuok(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_ukuok_SHIFT)) & CSS_CSS_KS16_ks16_ukuok_MASK)

#define CSS_CSS_KS16_ks16_utlspms_MASK           (0x1000000U)
#define CSS_CSS_KS16_ks16_utlspms_SHIFT          (24U)
/*! ks16_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS16_ks16_utlspms(x)             (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_utlspms_SHIFT)) & CSS_CSS_KS16_ks16_utlspms_MASK)

#define CSS_CSS_KS16_ks16_utlsms_MASK            (0x2000000U)
#define CSS_CSS_KS16_ks16_utlsms_SHIFT           (25U)
/*! ks16_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS16_ks16_utlsms(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_utlsms_SHIFT)) & CSS_CSS_KS16_ks16_utlsms_MASK)

#define CSS_CSS_KS16_ks16_ukgsrc_MASK            (0x4000000U)
#define CSS_CSS_KS16_ks16_ukgsrc_SHIFT           (26U)
/*! ks16_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS16_ks16_ukgsrc(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_ukgsrc_SHIFT)) & CSS_CSS_KS16_ks16_ukgsrc_MASK)

#define CSS_CSS_KS16_ks16_uhwo_MASK              (0x8000000U)
#define CSS_CSS_KS16_ks16_uhwo_SHIFT             (27U)
/*! ks16_uhwo - Hardware out key
 */
#define CSS_CSS_KS16_ks16_uhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_uhwo_SHIFT)) & CSS_CSS_KS16_ks16_uhwo_MASK)

#define CSS_CSS_KS16_ks16_uwrpok_MASK            (0x10000000U)
#define CSS_CSS_KS16_ks16_uwrpok_SHIFT           (28U)
/*! ks16_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS16_ks16_uwrpok(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_uwrpok_SHIFT)) & CSS_CSS_KS16_ks16_uwrpok_MASK)

#define CSS_CSS_KS16_ks16_uduk_MASK              (0x20000000U)
#define CSS_CSS_KS16_ks16_uduk_SHIFT             (29U)
/*! ks16_uduk - Device Unique Key
 */
#define CSS_CSS_KS16_ks16_uduk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_uduk_SHIFT)) & CSS_CSS_KS16_ks16_uduk_MASK)

#define CSS_CSS_KS16_ks16_upprot_MASK            (0xC0000000U)
#define CSS_CSS_KS16_ks16_upprot_SHIFT           (30U)
/*! ks16_upprot - Priviledge level
 */
#define CSS_CSS_KS16_ks16_upprot(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS16_ks16_upprot_SHIFT)) & CSS_CSS_KS16_ks16_upprot_MASK)
/*! @} */

/*! @name CSS_KS17 - Status register */
/*! @{ */

#define CSS_CSS_KS17_ks17_ksize_MASK             (0x1U)
#define CSS_CSS_KS17_ks17_ksize_SHIFT            (0U)
/*! ks17_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS17_ks17_ksize(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_ksize_SHIFT)) & CSS_CSS_KS17_ks17_ksize_MASK)

#define CSS_CSS_KS17_ks17_rsvd0_MASK             (0x1EU)
#define CSS_CSS_KS17_ks17_rsvd0_SHIFT            (1U)
/*! ks17_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS17_ks17_rsvd0(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_rsvd0_SHIFT)) & CSS_CSS_KS17_ks17_rsvd0_MASK)

#define CSS_CSS_KS17_ks17_kact_MASK              (0x20U)
#define CSS_CSS_KS17_ks17_kact_SHIFT             (5U)
/*! ks17_kact - Key is active
 */
#define CSS_CSS_KS17_ks17_kact(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_kact_SHIFT)) & CSS_CSS_KS17_ks17_kact_MASK)

#define CSS_CSS_KS17_ks17_kbase_MASK             (0x40U)
#define CSS_CSS_KS17_ks17_kbase_SHIFT            (6U)
/*! ks17_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS17_ks17_kbase(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_kbase_SHIFT)) & CSS_CSS_KS17_ks17_kbase_MASK)

#define CSS_CSS_KS17_ks17_fgp_MASK               (0x80U)
#define CSS_CSS_KS17_ks17_fgp_SHIFT              (7U)
/*! ks17_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS17_ks17_fgp(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_fgp_SHIFT)) & CSS_CSS_KS17_ks17_fgp_MASK)

#define CSS_CSS_KS17_ks17_frtn_MASK              (0x100U)
#define CSS_CSS_KS17_ks17_frtn_SHIFT             (8U)
/*! ks17_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS17_ks17_frtn(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_frtn_SHIFT)) & CSS_CSS_KS17_ks17_frtn_MASK)

#define CSS_CSS_KS17_ks17_fhwo_MASK              (0x200U)
#define CSS_CSS_KS17_ks17_fhwo_SHIFT             (9U)
/*! ks17_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS17_ks17_fhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_fhwo_SHIFT)) & CSS_CSS_KS17_ks17_fhwo_MASK)

#define CSS_CSS_KS17_ks17_rsvd1_MASK             (0x1C00U)
#define CSS_CSS_KS17_ks17_rsvd1_SHIFT            (10U)
/*! ks17_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS17_ks17_rsvd1(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_rsvd1_SHIFT)) & CSS_CSS_KS17_ks17_rsvd1_MASK)

#define CSS_CSS_KS17_ks17_ucmac_MASK             (0x2000U)
#define CSS_CSS_KS17_ks17_ucmac_SHIFT            (13U)
/*! ks17_ucmac - CMAC key
 */
#define CSS_CSS_KS17_ks17_ucmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_ucmac_SHIFT)) & CSS_CSS_KS17_ks17_ucmac_MASK)

#define CSS_CSS_KS17_ks17_uksk_MASK              (0x4000U)
#define CSS_CSS_KS17_ks17_uksk_SHIFT             (14U)
/*! ks17_uksk - KSK key
 */
#define CSS_CSS_KS17_ks17_uksk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_uksk_SHIFT)) & CSS_CSS_KS17_ks17_uksk_MASK)

#define CSS_CSS_KS17_ks17_urtf_MASK              (0x8000U)
#define CSS_CSS_KS17_ks17_urtf_SHIFT             (15U)
/*! ks17_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS17_ks17_urtf(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_urtf_SHIFT)) & CSS_CSS_KS17_ks17_urtf_MASK)

#define CSS_CSS_KS17_ks17_uckdf_MASK             (0x10000U)
#define CSS_CSS_KS17_ks17_uckdf_SHIFT            (16U)
/*! ks17_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS17_ks17_uckdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_uckdf_SHIFT)) & CSS_CSS_KS17_ks17_uckdf_MASK)

#define CSS_CSS_KS17_ks17_uhkdf_MASK             (0x20000U)
#define CSS_CSS_KS17_ks17_uhkdf_SHIFT            (17U)
/*! ks17_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS17_ks17_uhkdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_uhkdf_SHIFT)) & CSS_CSS_KS17_ks17_uhkdf_MASK)

#define CSS_CSS_KS17_ks17_uecsg_MASK             (0x40000U)
#define CSS_CSS_KS17_ks17_uecsg_SHIFT            (18U)
/*! ks17_uecsg - Ecc signing key
 */
#define CSS_CSS_KS17_ks17_uecsg(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_uecsg_SHIFT)) & CSS_CSS_KS17_ks17_uecsg_MASK)

#define CSS_CSS_KS17_ks17_uecdh_MASK             (0x80000U)
#define CSS_CSS_KS17_ks17_uecdh_SHIFT            (19U)
/*! ks17_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS17_ks17_uecdh(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_uecdh_SHIFT)) & CSS_CSS_KS17_ks17_uecdh_MASK)

#define CSS_CSS_KS17_ks17_uaes_MASK              (0x100000U)
#define CSS_CSS_KS17_ks17_uaes_SHIFT             (20U)
/*! ks17_uaes - Aes key
 */
#define CSS_CSS_KS17_ks17_uaes(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_uaes_SHIFT)) & CSS_CSS_KS17_ks17_uaes_MASK)

#define CSS_CSS_KS17_ks17_uhmac_MASK             (0x200000U)
#define CSS_CSS_KS17_ks17_uhmac_SHIFT            (21U)
/*! ks17_uhmac - Hmac key
 */
#define CSS_CSS_KS17_ks17_uhmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_uhmac_SHIFT)) & CSS_CSS_KS17_ks17_uhmac_MASK)

#define CSS_CSS_KS17_ks17_ukwk_MASK              (0x400000U)
#define CSS_CSS_KS17_ks17_ukwk_SHIFT             (22U)
/*! ks17_ukwk - Key wrapping key
 */
#define CSS_CSS_KS17_ks17_ukwk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_ukwk_SHIFT)) & CSS_CSS_KS17_ks17_ukwk_MASK)

#define CSS_CSS_KS17_ks17_ukuok_MASK             (0x800000U)
#define CSS_CSS_KS17_ks17_ukuok_SHIFT            (23U)
/*! ks17_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS17_ks17_ukuok(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_ukuok_SHIFT)) & CSS_CSS_KS17_ks17_ukuok_MASK)

#define CSS_CSS_KS17_ks17_utlspms_MASK           (0x1000000U)
#define CSS_CSS_KS17_ks17_utlspms_SHIFT          (24U)
/*! ks17_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS17_ks17_utlspms(x)             (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_utlspms_SHIFT)) & CSS_CSS_KS17_ks17_utlspms_MASK)

#define CSS_CSS_KS17_ks17_utlsms_MASK            (0x2000000U)
#define CSS_CSS_KS17_ks17_utlsms_SHIFT           (25U)
/*! ks17_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS17_ks17_utlsms(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_utlsms_SHIFT)) & CSS_CSS_KS17_ks17_utlsms_MASK)

#define CSS_CSS_KS17_ks17_ukgsrc_MASK            (0x4000000U)
#define CSS_CSS_KS17_ks17_ukgsrc_SHIFT           (26U)
/*! ks17_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS17_ks17_ukgsrc(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_ukgsrc_SHIFT)) & CSS_CSS_KS17_ks17_ukgsrc_MASK)

