RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS17_ks17_uhwo_MASK              (0x8000000U)
#define CSS_CSS_KS17_ks17_uhwo_SHIFT             (27U)
/*! ks17_uhwo - Hardware out key
 */
#define CSS_CSS_KS17_ks17_uhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_uhwo_SHIFT)) & CSS_CSS_KS17_ks17_uhwo_MASK)

#define CSS_CSS_KS17_ks17_uwrpok_MASK            (0x10000000U)
#define CSS_CSS_KS17_ks17_uwrpok_SHIFT           (28U)
/*! ks17_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS17_ks17_uwrpok(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_uwrpok_SHIFT)) & CSS_CSS_KS17_ks17_uwrpok_MASK)

#define CSS_CSS_KS17_ks17_uduk_MASK              (0x20000000U)
#define CSS_CSS_KS17_ks17_uduk_SHIFT             (29U)
/*! ks17_uduk - Device Unique Key
 */
#define CSS_CSS_KS17_ks17_uduk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_uduk_SHIFT)) & CSS_CSS_KS17_ks17_uduk_MASK)

#define CSS_CSS_KS17_ks17_upprot_MASK            (0xC0000000U)
#define CSS_CSS_KS17_ks17_upprot_SHIFT           (30U)
/*! ks17_upprot - Priviledge level
 */
#define CSS_CSS_KS17_ks17_upprot(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS17_ks17_upprot_SHIFT)) & CSS_CSS_KS17_ks17_upprot_MASK)
/*! @} */

/*! @name CSS_KS18 - Status register */
/*! @{ */

#define CSS_CSS_KS18_ks18_ksize_MASK             (0x1U)
#define CSS_CSS_KS18_ks18_ksize_SHIFT            (0U)
/*! ks18_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS18_ks18_ksize(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_ksize_SHIFT)) & CSS_CSS_KS18_ks18_ksize_MASK)

#define CSS_CSS_KS18_ks18_rsvd0_MASK             (0x1EU)
#define CSS_CSS_KS18_ks18_rsvd0_SHIFT            (1U)
/*! ks18_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS18_ks18_rsvd0(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_rsvd0_SHIFT)) & CSS_CSS_KS18_ks18_rsvd0_MASK)

#define CSS_CSS_KS18_ks18_kact_MASK              (0x20U)
#define CSS_CSS_KS18_ks18_kact_SHIFT             (5U)
/*! ks18_kact - Key is active
 */
#define CSS_CSS_KS18_ks18_kact(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_kact_SHIFT)) & CSS_CSS_KS18_ks18_kact_MASK)

#define CSS_CSS_KS18_ks18_kbase_MASK             (0x40U)
#define CSS_CSS_KS18_ks18_kbase_SHIFT            (6U)
/*! ks18_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS18_ks18_kbase(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_kbase_SHIFT)) & CSS_CSS_KS18_ks18_kbase_MASK)

#define CSS_CSS_KS18_ks18_fgp_MASK               (0x80U)
#define CSS_CSS_KS18_ks18_fgp_SHIFT              (7U)
/*! ks18_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS18_ks18_fgp(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_fgp_SHIFT)) & CSS_CSS_KS18_ks18_fgp_MASK)

#define CSS_CSS_KS18_ks18_frtn_MASK              (0x100U)
#define CSS_CSS_KS18_ks18_frtn_SHIFT             (8U)
/*! ks18_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS18_ks18_frtn(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_frtn_SHIFT)) & CSS_CSS_KS18_ks18_frtn_MASK)

#define CSS_CSS_KS18_ks18_fhwo_MASK              (0x200U)
#define CSS_CSS_KS18_ks18_fhwo_SHIFT             (9U)
/*! ks18_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS18_ks18_fhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_fhwo_SHIFT)) & CSS_CSS_KS18_ks18_fhwo_MASK)

#define CSS_CSS_KS18_ks18_rsvd1_MASK             (0x1C00U)
#define CSS_CSS_KS18_ks18_rsvd1_SHIFT            (10U)
/*! ks18_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS18_ks18_rsvd1(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_rsvd1_SHIFT)) & CSS_CSS_KS18_ks18_rsvd1_MASK)

#define CSS_CSS_KS18_ks18_ucmac_MASK             (0x2000U)
#define CSS_CSS_KS18_ks18_ucmac_SHIFT            (13U)
/*! ks18_ucmac - CMAC key
 */
#define CSS_CSS_KS18_ks18_ucmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_ucmac_SHIFT)) & CSS_CSS_KS18_ks18_ucmac_MASK)

#define CSS_CSS_KS18_ks18_uksk_MASK              (0x4000U)
#define CSS_CSS_KS18_ks18_uksk_SHIFT             (14U)
/*! ks18_uksk - KSK key
 */
#define CSS_CSS_KS18_ks18_uksk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_uksk_SHIFT)) & CSS_CSS_KS18_ks18_uksk_MASK)

#define CSS_CSS_KS18_ks18_urtf_MASK              (0x8000U)
#define CSS_CSS_KS18_ks18_urtf_SHIFT             (15U)
/*! ks18_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS18_ks18_urtf(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_urtf_SHIFT)) & CSS_CSS_KS18_ks18_urtf_MASK)

#define CSS_CSS_KS18_ks18_uckdf_MASK             (0x10000U)
#define CSS_CSS_KS18_ks18_uckdf_SHIFT            (16U)
/*! ks18_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS18_ks18_uckdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_uckdf_SHIFT)) & CSS_CSS_KS18_ks18_uckdf_MASK)

#define CSS_CSS_KS18_ks18_uhkdf_MASK             (0x20000U)
#define CSS_CSS_KS18_ks18_uhkdf_SHIFT            (17U)
/*! ks18_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS18_ks18_uhkdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_uhkdf_SHIFT)) & CSS_CSS_KS18_ks18_uhkdf_MASK)

#define CSS_CSS_KS18_ks18_uecsg_MASK             (0x40000U)
#define CSS_CSS_KS18_ks18_uecsg_SHIFT            (18U)
/*! ks18_uecsg - Ecc signing key
 */
#define CSS_CSS_KS18_ks18_uecsg(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_uecsg_SHIFT)) & CSS_CSS_KS18_ks18_uecsg_MASK)

#define CSS_CSS_KS18_ks18_uecdh_MASK             (0x80000U)
#define CSS_CSS_KS18_ks18_uecdh_SHIFT            (19U)
/*! ks18_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS18_ks18_uecdh(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_uecdh_SHIFT)) & CSS_CSS_KS18_ks18_uecdh_MASK)

#define CSS_CSS_KS18_ks18_uaes_MASK              (0x100000U)
#define CSS_CSS_KS18_ks18_uaes_SHIFT             (20U)
/*! ks18_uaes - Aes key
 */
#define CSS_CSS_KS18_ks18_uaes(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_uaes_SHIFT)) & CSS_CSS_KS18_ks18_uaes_MASK)

#define CSS_CSS_KS18_ks18_uhmac_MASK             (0x200000U)
#define CSS_CSS_KS18_ks18_uhmac_SHIFT            (21U)
/*! ks18_uhmac - Hmac key
 */
#define CSS_CSS_KS18_ks18_uhmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_uhmac_SHIFT)) & CSS_CSS_KS18_ks18_uhmac_MASK)

#define CSS_CSS_KS18_ks18_ukwk_MASK              (0x400000U)
#define CSS_CSS_KS18_ks18_ukwk_SHIFT             (22U)
/*! ks18_ukwk - Key wrapping key
 */
#define CSS_CSS_KS18_ks18_ukwk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_ukwk_SHIFT)) & CSS_CSS_KS18_ks18_ukwk_MASK)

#define CSS_CSS_KS18_ks18_ukuok_MASK             (0x800000U)
#define CSS_CSS_KS18_ks18_ukuok_SHIFT            (23U)
/*! ks18_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS18_ks18_ukuok(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_ukuok_SHIFT)) & CSS_CSS_KS18_ks18_ukuok_MASK)

#define CSS_CSS_KS18_ks18_utlspms_MASK           (0x1000000U)
#define CSS_CSS_KS18_ks18_utlspms_SHIFT          (24U)
/*! ks18_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS18_ks18_utlspms(x)             (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_utlspms_SHIFT)) & CSS_CSS_KS18_ks18_utlspms_MASK)

