RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS18_ks18_utlsms_MASK            (0x2000000U)
#define CSS_CSS_KS18_ks18_utlsms_SHIFT           (25U)
/*! ks18_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS18_ks18_utlsms(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_utlsms_SHIFT)) & CSS_CSS_KS18_ks18_utlsms_MASK)

#define CSS_CSS_KS18_ks18_ukgsrc_MASK            (0x4000000U)
#define CSS_CSS_KS18_ks18_ukgsrc_SHIFT           (26U)
/*! ks18_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS18_ks18_ukgsrc(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_ukgsrc_SHIFT)) & CSS_CSS_KS18_ks18_ukgsrc_MASK)

#define CSS_CSS_KS18_ks18_uhwo_MASK              (0x8000000U)
#define CSS_CSS_KS18_ks18_uhwo_SHIFT             (27U)
/*! ks18_uhwo - Hardware out key
 */
#define CSS_CSS_KS18_ks18_uhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_uhwo_SHIFT)) & CSS_CSS_KS18_ks18_uhwo_MASK)

#define CSS_CSS_KS18_ks18_uwrpok_MASK            (0x10000000U)
#define CSS_CSS_KS18_ks18_uwrpok_SHIFT           (28U)
/*! ks18_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS18_ks18_uwrpok(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_uwrpok_SHIFT)) & CSS_CSS_KS18_ks18_uwrpok_MASK)

#define CSS_CSS_KS18_ks18_uduk_MASK              (0x20000000U)
#define CSS_CSS_KS18_ks18_uduk_SHIFT             (29U)
/*! ks18_uduk - Device Unique Key
 */
#define CSS_CSS_KS18_ks18_uduk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_uduk_SHIFT)) & CSS_CSS_KS18_ks18_uduk_MASK)

#define CSS_CSS_KS18_ks18_upprot_MASK            (0xC0000000U)
#define CSS_CSS_KS18_ks18_upprot_SHIFT           (30U)
/*! ks18_upprot - Priviledge level
 */
#define CSS_CSS_KS18_ks18_upprot(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS18_ks18_upprot_SHIFT)) & CSS_CSS_KS18_ks18_upprot_MASK)
/*! @} */

/*! @name CSS_KS19 - Status register */
/*! @{ */

#define CSS_CSS_KS19_ks19_ksize_MASK             (0x1U)
#define CSS_CSS_KS19_ks19_ksize_SHIFT            (0U)
/*! ks19_ksize - Key size: 0-128, 1-256
 */
#define CSS_CSS_KS19_ks19_ksize(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_ksize_SHIFT)) & CSS_CSS_KS19_ks19_ksize_MASK)

#define CSS_CSS_KS19_ks19_rsvd0_MASK             (0x1EU)
#define CSS_CSS_KS19_ks19_rsvd0_SHIFT            (1U)
/*! ks19_rsvd0 - Reserved 0
 */
#define CSS_CSS_KS19_ks19_rsvd0(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_rsvd0_SHIFT)) & CSS_CSS_KS19_ks19_rsvd0_MASK)

#define CSS_CSS_KS19_ks19_kact_MASK              (0x20U)
#define CSS_CSS_KS19_ks19_kact_SHIFT             (5U)
/*! ks19_kact - Key is active
 */
#define CSS_CSS_KS19_ks19_kact(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_kact_SHIFT)) & CSS_CSS_KS19_ks19_kact_MASK)

#define CSS_CSS_KS19_ks19_kbase_MASK             (0x40U)
#define CSS_CSS_KS19_ks19_kbase_SHIFT            (6U)
/*! ks19_kbase - First slot in a multislot key
 */
#define CSS_CSS_KS19_ks19_kbase(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_kbase_SHIFT)) & CSS_CSS_KS19_ks19_kbase_MASK)

#define CSS_CSS_KS19_ks19_fgp_MASK               (0x80U)
#define CSS_CSS_KS19_ks19_fgp_SHIFT              (7U)
/*! ks19_fgp - Hardware Feature General Purpose
 */
#define CSS_CSS_KS19_ks19_fgp(x)                 (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_fgp_SHIFT)) & CSS_CSS_KS19_ks19_fgp_MASK)

#define CSS_CSS_KS19_ks19_frtn_MASK              (0x100U)
#define CSS_CSS_KS19_ks19_frtn_SHIFT             (8U)
/*! ks19_frtn - Hardware Feature Retention
 */
#define CSS_CSS_KS19_ks19_frtn(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_frtn_SHIFT)) & CSS_CSS_KS19_ks19_frtn_MASK)

#define CSS_CSS_KS19_ks19_fhwo_MASK              (0x200U)
#define CSS_CSS_KS19_ks19_fhwo_SHIFT             (9U)
/*! ks19_fhwo - Hardware Feature Output
 */
#define CSS_CSS_KS19_ks19_fhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_fhwo_SHIFT)) & CSS_CSS_KS19_ks19_fhwo_MASK)

#define CSS_CSS_KS19_ks19_rsvd1_MASK             (0x1C00U)
#define CSS_CSS_KS19_ks19_rsvd1_SHIFT            (10U)
/*! ks19_rsvd1 - Reserved 1
 */
#define CSS_CSS_KS19_ks19_rsvd1(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_rsvd1_SHIFT)) & CSS_CSS_KS19_ks19_rsvd1_MASK)

#define CSS_CSS_KS19_ks19_ucmac_MASK             (0x2000U)
#define CSS_CSS_KS19_ks19_ucmac_SHIFT            (13U)
/*! ks19_ucmac - CMAC key
 */
#define CSS_CSS_KS19_ks19_ucmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_ucmac_SHIFT)) & CSS_CSS_KS19_ks19_ucmac_MASK)

#define CSS_CSS_KS19_ks19_uksk_MASK              (0x4000U)
#define CSS_CSS_KS19_ks19_uksk_SHIFT             (14U)
/*! ks19_uksk - KSK key
 */
#define CSS_CSS_KS19_ks19_uksk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_uksk_SHIFT)) & CSS_CSS_KS19_ks19_uksk_MASK)

#define CSS_CSS_KS19_ks19_urtf_MASK              (0x8000U)
#define CSS_CSS_KS19_ks19_urtf_SHIFT             (15U)
/*! ks19_urtf - Real Time Fingerprint key
 */
#define CSS_CSS_KS19_ks19_urtf(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_urtf_SHIFT)) & CSS_CSS_KS19_ks19_urtf_MASK)

#define CSS_CSS_KS19_ks19_uckdf_MASK             (0x10000U)
#define CSS_CSS_KS19_ks19_uckdf_SHIFT            (16U)
/*! ks19_uckdf - Derivation key for CKDF command
 */
#define CSS_CSS_KS19_ks19_uckdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_uckdf_SHIFT)) & CSS_CSS_KS19_ks19_uckdf_MASK)

#define CSS_CSS_KS19_ks19_uhkdf_MASK             (0x20000U)
#define CSS_CSS_KS19_ks19_uhkdf_SHIFT            (17U)
/*! ks19_uhkdf - Derivation key for HKDF command
 */
#define CSS_CSS_KS19_ks19_uhkdf(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_uhkdf_SHIFT)) & CSS_CSS_KS19_ks19_uhkdf_MASK)

#define CSS_CSS_KS19_ks19_uecsg_MASK             (0x40000U)
#define CSS_CSS_KS19_ks19_uecsg_SHIFT            (18U)
/*! ks19_uecsg - Ecc signing key
 */
#define CSS_CSS_KS19_ks19_uecsg(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_uecsg_SHIFT)) & CSS_CSS_KS19_ks19_uecsg_MASK)

#define CSS_CSS_KS19_ks19_uecdh_MASK             (0x80000U)
#define CSS_CSS_KS19_ks19_uecdh_SHIFT            (19U)
/*! ks19_uecdh - Ecc diffie hellman key
 */
#define CSS_CSS_KS19_ks19_uecdh(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_uecdh_SHIFT)) & CSS_CSS_KS19_ks19_uecdh_MASK)

#define CSS_CSS_KS19_ks19_uaes_MASK              (0x100000U)
#define CSS_CSS_KS19_ks19_uaes_SHIFT             (20U)
/*! ks19_uaes - Aes key
 */
#define CSS_CSS_KS19_ks19_uaes(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_uaes_SHIFT)) & CSS_CSS_KS19_ks19_uaes_MASK)

#define CSS_CSS_KS19_ks19_uhmac_MASK             (0x200000U)
#define CSS_CSS_KS19_ks19_uhmac_SHIFT            (21U)
/*! ks19_uhmac - Hmac key
 */
#define CSS_CSS_KS19_ks19_uhmac(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_uhmac_SHIFT)) & CSS_CSS_KS19_ks19_uhmac_MASK)

#define CSS_CSS_KS19_ks19_ukwk_MASK              (0x400000U)
#define CSS_CSS_KS19_ks19_ukwk_SHIFT             (22U)
/*! ks19_ukwk - Key wrapping key
 */
#define CSS_CSS_KS19_ks19_ukwk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_ukwk_SHIFT)) & CSS_CSS_KS19_ks19_ukwk_MASK)

#define CSS_CSS_KS19_ks19_ukuok_MASK             (0x800000U)
#define CSS_CSS_KS19_ks19_ukuok_SHIFT            (23U)
/*! ks19_ukuok - Key unwrapping key
 */
#define CSS_CSS_KS19_ks19_ukuok(x)               (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_ukuok_SHIFT)) & CSS_CSS_KS19_ks19_ukuok_MASK)

