RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define CSS_CSS_KS19_ks19_utlspms_MASK           (0x1000000U)
#define CSS_CSS_KS19_ks19_utlspms_SHIFT          (24U)
/*! ks19_utlspms - TLS Pre Master Secret
 */
#define CSS_CSS_KS19_ks19_utlspms(x)             (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_utlspms_SHIFT)) & CSS_CSS_KS19_ks19_utlspms_MASK)

#define CSS_CSS_KS19_ks19_utlsms_MASK            (0x2000000U)
#define CSS_CSS_KS19_ks19_utlsms_SHIFT           (25U)
/*! ks19_utlsms - TLS Master Secret
 */
#define CSS_CSS_KS19_ks19_utlsms(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_utlsms_SHIFT)) & CSS_CSS_KS19_ks19_utlsms_MASK)

#define CSS_CSS_KS19_ks19_ukgsrc_MASK            (0x4000000U)
#define CSS_CSS_KS19_ks19_ukgsrc_SHIFT           (26U)
/*! ks19_ukgsrc - Supply KEYGEN source
 */
#define CSS_CSS_KS19_ks19_ukgsrc(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_ukgsrc_SHIFT)) & CSS_CSS_KS19_ks19_ukgsrc_MASK)

#define CSS_CSS_KS19_ks19_uhwo_MASK              (0x8000000U)
#define CSS_CSS_KS19_ks19_uhwo_SHIFT             (27U)
/*! ks19_uhwo - Hardware out key
 */
#define CSS_CSS_KS19_ks19_uhwo(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_uhwo_SHIFT)) & CSS_CSS_KS19_ks19_uhwo_MASK)

#define CSS_CSS_KS19_ks19_uwrpok_MASK            (0x10000000U)
#define CSS_CSS_KS19_ks19_uwrpok_SHIFT           (28U)
/*! ks19_uwrpok - Ok to wrap key
 */
#define CSS_CSS_KS19_ks19_uwrpok(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_uwrpok_SHIFT)) & CSS_CSS_KS19_ks19_uwrpok_MASK)

#define CSS_CSS_KS19_ks19_uduk_MASK              (0x20000000U)
#define CSS_CSS_KS19_ks19_uduk_SHIFT             (29U)
/*! ks19_uduk - Device Unique Key
 */
#define CSS_CSS_KS19_ks19_uduk(x)                (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_uduk_SHIFT)) & CSS_CSS_KS19_ks19_uduk_MASK)

#define CSS_CSS_KS19_ks19_upprot_MASK            (0xC0000000U)
#define CSS_CSS_KS19_ks19_upprot_SHIFT           (30U)
/*! ks19_upprot - Priviledge level
 */
#define CSS_CSS_KS19_ks19_upprot(x)              (((uint32_t)(((uint32_t)(x)) << CSS_CSS_KS19_ks19_upprot_SHIFT)) & CSS_CSS_KS19_ks19_upprot_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group CSS_Register_Masks */


/* CSS - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CSS base address */
  #define CSS_BASE                                 (0x50030000u)
  /** Peripheral CSS base address */
  #define CSS_BASE_NS                              (0x40030000u)
  /** Peripheral CSS base pointer */
  #define CSS                                      ((CSS_Type *)CSS_BASE)
  /** Peripheral CSS base pointer */
  #define CSS_NS                                   ((CSS_Type *)CSS_BASE_NS)
  /** Array initializer of CSS peripheral base addresses */
  #define CSS_BASE_ADDRS                           { CSS_BASE }
  /** Array initializer of CSS peripheral base pointers */
  #define CSS_BASE_PTRS                            { CSS }
  /** Array initializer of CSS peripheral base addresses */
  #define CSS_BASE_ADDRS_NS                        { CSS_BASE_NS }
  /** Array initializer of CSS peripheral base pointers */
  #define CSS_BASE_PTRS_NS                         { CSS_NS }
#else
  /** Peripheral CSS base address */
  #define CSS_BASE                                 (0x40030000u)
  /** Peripheral CSS base pointer */
  #define CSS                                      ((CSS_Type *)CSS_BASE)
  /** Array initializer of CSS peripheral base addresses */
  #define CSS_BASE_ADDRS                           { CSS_BASE }
  /** Array initializer of CSS peripheral base pointers */
  #define CSS_BASE_PTRS                            { CSS }
#endif

/*!
 * @}
 */ /* end of group CSS_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- CTIMER Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CTIMER_Peripheral_Access_Layer CTIMER Peripheral Access Layer
 * @{
 */

/** CTIMER - Register Layout Typedef */
typedef struct {
  __IO uint32_t IR;                                /**< Interrupt Register, offset: 0x0 */
  __IO uint32_t TCR;                               /**< Timer Control Register, offset: 0x4 */
  __IO uint32_t TC;                                /**< Timer Counter, offset: 0x8 */
  __IO uint32_t PR;                                /**< Prescale Register, offset: 0xC */
  __IO uint32_t PC;                                /**< Prescale Counter, offset: 0x10 */
  __IO uint32_t MCR;                               /**< Match Control Register, offset: 0x14 */
  __IO uint32_t MR[4];                             /**< Match Register, array offset: 0x18, array step: 0x4 */
  __IO uint32_t CCR;                               /**< Capture Control Register, offset: 0x28 */
  __I  uint32_t CR[4];                             /**< Capture Register, array offset: 0x2C, array step: 0x4 */
  __IO uint32_t EMR;                               /**< External Match Register, offset: 0x3C */
       uint8_t RESERVED_0[48];
  __IO uint32_t CTCR;                              /**< Count Control Register, offset: 0x70 */
  __IO uint32_t PWMC;                              /**< PWM Control Register, offset: 0x74 */
  __IO uint32_t MSR[4];                            /**< Match Shadow Register, array offset: 0x78, array step: 0x4 */
} CTIMER_Type;

/* ----------------------------------------------------------------------------
   -- CTIMER Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CTIMER_Register_Masks CTIMER Register Masks
 * @{
 */

/*! @name IR - Interrupt Register */
/*! @{ */

#define CTIMER_IR_MR0INT_MASK                    (0x1U)
#define CTIMER_IR_MR0INT_SHIFT                   (0U)
/*! MR0INT - Interrupt flag for match channel 0
 */
#define CTIMER_IR_MR0INT(x)                      (((uint32_t)(((uint32_t)(x)) << CTIMER_IR_MR0INT_SHIFT)) & CTIMER_IR_MR0INT_MASK)

#define CTIMER_IR_MR1INT_MASK                    (0x2U)
#define CTIMER_IR_MR1INT_SHIFT                   (1U)
/*! MR1INT - Interrupt flag for match channel 1
 */
#define CTIMER_IR_MR1INT(x)                      (((uint32_t)(((uint32_t)(x)) << CTIMER_IR_MR1INT_SHIFT)) & CTIMER_IR_MR1INT_MASK)

#define CTIMER_IR_MR2INT_MASK                    (0x4U)
#define CTIMER_IR_MR2INT_SHIFT                   (2U)
/*! MR2INT - Interrupt flag for match channel 2
 */
#define CTIMER_IR_MR2INT(x)                      (((uint32_t)(((uint32_t)(x)) << CTIMER_IR_MR2INT_SHIFT)) & CTIMER_IR_MR2INT_MASK)

#define CTIMER_IR_MR3INT_MASK                    (0x8U)
#define CTIMER_IR_MR3INT_SHIFT                   (3U)
/*! MR3INT - Interrupt flag for match channel 3
 */
#define CTIMER_IR_MR3INT(x)                      (((uint32_t)(((uint32_t)(x)) << CTIMER_IR_MR3INT_SHIFT)) & CTIMER_IR_MR3INT_MASK)

#define CTIMER_IR_CR0INT_MASK                    (0x10U)
#define CTIMER_IR_CR0INT_SHIFT                   (4U)
/*! CR0INT - Interrupt flag for capture channel 0 event
 */
#define CTIMER_IR_CR0INT(x)                      (((uint32_t)(((uint32_t)(x)) << CTIMER_IR_CR0INT_SHIFT)) & CTIMER_IR_CR0INT_MASK)

#define CTIMER_IR_CR1INT_MASK                    (0x20U)
#define CTIMER_IR_CR1INT_SHIFT                   (5U)
/*! CR1INT - Interrupt flag for capture channel 1 event
 */
#define CTIMER_IR_CR1INT(x)                      (((uint32_t)(((uint32_t)(x)) << CTIMER_IR_CR1INT_SHIFT)) & CTIMER_IR_CR1INT_MASK)

