RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
/* The count of INPUTMUX_PINTSECSEL */
#define INPUTMUX_PINTSECSEL_COUNT                (2U)

/*! @name DMA1_ITRIG_INMUX - Trigger select for DMA1 channel */
/*! @{ */

#define INPUTMUX_DMA1_ITRIG_INMUX_INP_MASK       (0x1FU)
#define INPUTMUX_DMA1_ITRIG_INMUX_INP_SHIFT      (0U)
/*! INP - Trigger input number (binary value) for DMA channel n (n = 0 to 14).
 *  0b00000..Pin interrupt 0 (GPIO_INT0)
 *  0b00001..Pin interrupt 1 (GPIO_INT1)
 *  0b00010..Pin interrupt 2 (GPIO_INT2)
 *  0b00011..Pin interrupt 3 (GPIO_INT3)
 *  0b00100..Timer CTIMER0 Match 0 (T0_DMAREQ_M0)
 *  0b00101..Timer CTIMER0 Match 1 (T0_DMAREQ_M1)
 *  0b00110..Timer CTIMER2 Match 0 (T2_DMAREQ_M0)
 *  0b00111..Timer CTIMER4 Match 0 (T4_DMAREQ_M0)
 *  0b01000..SDMA1_TRIGOUT_A
 *  0b01001..SDMA1_TRIGOUT_B
 *  0b01010..SDMA1_TRIGOUT_C
 *  0b01011..SDMA1_TRIGOUT_D
 *  0b01100..SCT_DMA_REQ0
 *  0b01101..SCT_DMA_REQ1
 *  0b01110..FlexSPI_RX
 *  0b01111..FlexSPI_TX
 *  0b10000..AOI0_OUT0
 *  0b10001..AOI0_OUT1
 *  0b10010..AOI0_OUT2
 *  0b10011..AOI0_OUT3
 *  0b10100..AOI1_OUT0
 *  0b10101..AOI1_OUT1
 *  0b10110..AOI1_OUT2
 *  0b10111..AOI1_OUT3
 *  0b11000..TMPR_OUT
 *  0b11001-0b11111..Reserved
 */
#define INPUTMUX_DMA1_ITRIG_INMUX_INP(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIG_INMUX_INP_SHIFT)) & INPUTMUX_DMA1_ITRIG_INMUX_INP_MASK)
/*! @} */

/* The count of INPUTMUX_DMA1_ITRIG_INMUX */
#define INPUTMUX_DMA1_ITRIG_INMUX_COUNT          (16U)

/*! @name DMA1_OTRIG_INMUX - DMA1 output trigger selection for DMA1 input trigger */
/*! @{ */

#define INPUTMUX_DMA1_OTRIG_INMUX_SDMA1_CH_TRIGOUT_MASK (0xFU)
#define INPUTMUX_DMA1_OTRIG_INMUX_SDMA1_CH_TRIGOUT_SHIFT (0U)
/*! SDMA1_CH_TRIGOUT - DMA trigger output number (binary value) for DMA channel n (n = 0 to 15).
 *  0b0000..SDMA1_CH0_TRIGOUT
 *  0b0001..SDMA1_CH1_TRIGOUT
 *  0b0010..SDMA1_CH2_TRIGOUT
 *  0b0011..SDMA1_CH3_TRIGOUT
 *  0b0100..SDMA1_CH4_TRIGOUT
 *  0b0101..SDMA1_CH5_TRIGOUT
 *  0b0110..SDMA1_CH6_TRIGOUT
 *  0b0111..SDMA1_CH7_TRIGOUT
 *  0b1000..SDMA1_CH8_TRIGOUT
 *  0b1001..SDMA1_CH9_TRIGOUT
 *  0b1010..SDMA1_CH10_TRIGOUT
 *  0b1011..SDMA1_CH11_TRIGOUT
 *  0b1100..SDMA1_CH12_TRIGOUT
 *  0b1101..SDMA1_CH13_TRIGOUT
 *  0b1110-0b1111..Reserved
 */
#define INPUTMUX_DMA1_OTRIG_INMUX_SDMA1_CH_TRIGOUT(x) (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_OTRIG_INMUX_SDMA1_CH_TRIGOUT_SHIFT)) & INPUTMUX_DMA1_OTRIG_INMUX_SDMA1_CH_TRIGOUT_MASK)
/*! @} */

/* The count of INPUTMUX_DMA1_OTRIG_INMUX */
#define INPUTMUX_DMA1_OTRIG_INMUX_COUNT          (4U)

/*! @name HSCMP0_TRIG - Input connections for HSCMP0 */
/*! @{ */

#define INPUTMUX_HSCMP0_TRIG_TRIGIN_MASK         (0x3FU)
#define INPUTMUX_HSCMP0_TRIG_TRIGIN_SHIFT        (0U)
/*! TRIGIN - CMP0 input trigger
 *  0b000000..PIN_INT0
 *  0b000001..PIN_INT6
 *  0b000010..SCT_OUT4
 *  0b000011..SCT_OUT5
 *  0b000100..SCT_OUT6
 *  0b000101..T0_MAT3
 *  0b000110..T1_MAT3
 *  0b000111..T2_MAT3
 *  0b001000..T0_MAT0
 *  0b001001..T4_MAT0
 *  0b001010..Reserved
 *  0b001011..ARM_TXEV
 *  0b001100..GPIOINT_BMATCH
 *  0b001101..ADC0_tcomp[0]
 *  0b001110..ADC1_tcomp[0]
 *  0b001111..Reserved
 *  0b010000..Reserved
 *  0b010001..PWM0_SM0_MUX_TRIG0 | PWM0_SM0_MUX_TRIG1
 *  0b010010..PWM0_SM1_MUX_TRIG0 | PWM0_SM1_MUX_TRIG1
 *  0b010011..PWM0_SM2_MUX_TRIG0 | PWM0_SM2_MUX_TRIG1
 *  0b010100..PWM0_SM3_MUX_TRIG0 | PWM0_SM3_MUX_TRIG1
 *  0b010101..PWM1_SM0_MUX_TRIG0 | PWM1_SM0_MUX_TRIG1
 *  0b010110..PWM1_SM1_MUX_TRIG0 | PWM1_SM1_MUX_TRIG1
 *  0b010111..PWM1_SM2_MUX_TRIG0 | PWM1_SM2_MUX_TRIG1
 *  0b011000..PWM1_SM3_MUX_TRIG0 | PWM1_SM3_MUX_TRIG1
 *  0b011001..ENC0_CMP/POS_MATCH
 *  0b011010..ENC1_CMP/POS_MATCH
 *  0b011011..AOI0_OUT0
 *  0b011100..AOI0_OUT1
 *  0b011101..AOI0_OUT2
 *  0b011110..AOI0_OUT3
 *  0b011111..AOI1_OUT0
 *  0b100000..AOI1_OUT1
 *  0b100001..AOI1_OUT2
 *  0b100010..AOI1_OUT3
 *  0b100011..DMA0_TRIGOUT0
 *  0b100100..DMA0_TRIGOUT1
 *  0b100101..DMA0_TRIGOUT2
 */
#define INPUTMUX_HSCMP0_TRIG_TRIGIN(x)           (((uint32_t)(((uint32_t)(x)) << INPUTMUX_HSCMP0_TRIG_TRIGIN_SHIFT)) & INPUTMUX_HSCMP0_TRIG_TRIGIN_MASK)
/*! @} */

/*! @name ADC0_TRIGN_ADC0_TRIG - ADC0 Trigger input connections */
/*! @{ */

#define INPUTMUX_ADC0_TRIGN_ADC0_TRIG_TRIGIN_MASK (0x3FU)
#define INPUTMUX_ADC0_TRIGN_ADC0_TRIG_TRIGIN_SHIFT (0U)
/*! TRIGIN - ADC0 trigger inputs
 *  0b000000..PIN_INT0
 *  0b000001..PIN_INT1
 *  0b000010..SCT_OUT4
 *  0b000011..SCT_OUT5
 *  0b000100..SCT_OUT9
 *  0b000101..T0_MAT3
 *  0b000110..T1_MAT3
 *  0b000111..T2_MAT3
 *  0b001000..T3_MAT3
 *  0b001001..T4_MAT3
 *  0b001010..ACMP0_OUT
 *  0b001011..ARM_TXEV
 *  0b001100..GPIOINT_BMATCH
 *  0b001101..ADC0_tcomp[0]
 *  0b001110..ADC0_tcomp[1]
 *  0b001111..ADC0_tcomp[2]
 *  0b010000..ADC0_tcomp[3]
 *  0b010001..ADC1_tcomp[0]
 *  0b010010..ADC1_tcomp[1]
 *  0b010011..ADC1_tcomp[2]
 *  0b010100..ADC1_tcomp[3]
 *  0b010101..HSCMP0_OUT
 *  0b010110..HSCMP1_OUT
 *  0b010111..HSCMP2_OUT
 *  0b011000..PWM0_SM0_MUX_TRIG0
 *  0b011001..PWM0_SM0_MUX_TRIG1
 *  0b011010..PWM0_SM1_MUX_TRIG0
 *  0b011011..PWM0_SM1_MUX_TRIG1
 *  0b011100..PWM0_SM2_MUX_TRIG0
 *  0b011101..PWM0_SM2_MUX_TRIG1
 *  0b011110..PWM0_SM3_MUX_TRIG0
 *  0b011111..PWM0_SM3_MUX_TRIG1
 *  0b100000..PWM1_SM0_MUX_TRIG0
 *  0b100001..PWM1_SM0_MUX_TRIG1
 *  0b100010..PWM1_SM1_MUX_TRIG0
 *  0b100011..PWM1_SM1_MUX_TRIG1
 *  0b100100..PWM1_SM2_MUX_TRIG0
 *  0b100101..PWM1_SM2_MUX_TRIG1
 *  0b100110..PWM1_SM3_MUX_TRIG0
 *  0b100111..PWM1_SM3_MUX_TRIG1
 *  0b101000..ENC0_CMP/POS_MATCH
 *  0b101001..ENC1_CMP/POS_MATCH
 *  0b101010..AOI0_OUT0
 *  0b101011..AOI0_OUT1
 *  0b101100..AOI0_OUT2
 *  0b101101..AOI0_OUT3
 *  0b101110..AOI1_OUT0
 *  0b101111..AOI1_OUT1
 *  0b110000..AOI1_OUT2
 *  0b110001..AOI1_OUT3
 *  0b110010..DMA0_TRIGOUT0
 *  0b110011..DMA0_TRIGOUT1
 *  0b110100..DMA0_TRIGOUT2
 *  0b110101-0b111111..None
 */
#define INPUTMUX_ADC0_TRIGN_ADC0_TRIG_TRIGIN(x)  (((uint32_t)(((uint32_t)(x)) << INPUTMUX_ADC0_TRIGN_ADC0_TRIG_TRIGIN_SHIFT)) & INPUTMUX_ADC0_TRIGN_ADC0_TRIG_TRIGIN_MASK)
/*! @} */

/* The count of INPUTMUX_ADC0_TRIGN_ADC0_TRIG */
#define INPUTMUX_ADC0_TRIGN_ADC0_TRIG_COUNT      (4U)

/*! @name ADC1_TRIGN_ADC1_TRIG - ADC1 Trigger input connections */
/*! @{ */

#define INPUTMUX_ADC1_TRIGN_ADC1_TRIG_TRIGIN_MASK (0x3FU)
#define INPUTMUX_ADC1_TRIGN_ADC1_TRIG_TRIGIN_SHIFT (0U)
/*! TRIGIN - ADC1 trigger inputs
 *  0b000000..PIN_INT0
 *  0b000001..PIN_INT2
 *  0b000010..SCT_OUT4
 *  0b000011..SCT_OUT5
 *  0b000100..SCT_OUT3
 *  0b000101..T0_MAT3
 *  0b000110..T1_MAT3
 *  0b000111..T2_MAT3
 *  0b001000..T3_MAT2
 *  0b001001..T4_MAT1
 *  0b001010..ACMP0_OUT
 *  0b001011..ARM_TXEV
 *  0b001100..GPIOINT_BMATCH
 *  0b001101..ADC0_tcomp[0]
 *  0b001110..ADC0_tcomp[1]
 *  0b001111..ADC0_tcomp[2]
 *  0b010000..ADC0_tcomp[3]
 *  0b010001..ADC1_tcomp[0]
 *  0b010010..ADC1_tcomp[1]
 *  0b010011..ADC1_tcomp[2]
 *  0b010100..ADC1_tcomp[3]
 *  0b010101..HSCMP0_OUT
 *  0b010110..HSCMP1_OUT
 *  0b010111..HSCMP2_OUT
 *  0b011000..PWM0_SM0_MUX_TRIG0
 *  0b011001..PWM0_SM0_MUX_TRIG1
 *  0b011010..PWM0_SM1_MUX_TRIG0
 *  0b011011..PWM0_SM1_MUX_TRIG1
 *  0b011100..PWM0_SM2_MUX_TRIG0
 *  0b011101..PWM0_SM2_MUX_TRIG1
 *  0b011110..PWM0_SM3_MUX_TRIG0
 *  0b011111..PWM0_SM3_MUX_TRIG1
 *  0b100000..PWM1_SM0_MUX_TRIG0
 *  0b100001..PWM1_SM0_MUX_TRIG1
 *  0b100010..PWM1_SM1_MUX_TRIG0
 *  0b100011..PWM1_SM1_MUX_TRIG1
 *  0b100100..PWM1_SM2_MUX_TRIG0
 *  0b100101..PWM1_SM2_MUX_TRIG1
 *  0b100110..PWM1_SM3_MUX_TRIG0
 *  0b100111..PWM1_SM3_MUX_TRIG1
 *  0b101000..ENC0_CMP/POS_MATCH
 *  0b101001..ENC1_CMP/POS_MATCH
 *  0b101010..AOI0_OUT0
 *  0b101011..AOI0_OUT1
 *  0b101100..AOI0_OUT2
 *  0b101101..AOI0_OUT3
 *  0b101110..AOI1_OUT0
 *  0b101111..AOI1_OUT1
 *  0b110000..AOI1_OUT2
 *  0b110001..AOI1_OUT3
 *  0b110010..DMA0_TRIGOUT0
 *  0b110011..DMA0_TRIGOUT1
 *  0b110100..DMA0_TRIGOUT2
 *  0b110101-0b111111..None
 */
#define INPUTMUX_ADC1_TRIGN_ADC1_TRIG_TRIGIN(x)  (((uint32_t)(((uint32_t)(x)) << INPUTMUX_ADC1_TRIGN_ADC1_TRIG_TRIGIN_SHIFT)) & INPUTMUX_ADC1_TRIGN_ADC1_TRIG_TRIGIN_MASK)
/*! @} */

