RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define INPUTMUX_DMA0_REQEN0_REQ_ENA23_MASK      (0x800000U)
#define INPUTMUX_DMA0_REQEN0_REQ_ENA23_SHIFT     (23U)
/*! REQ_ENA23 - Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.
 */
#define INPUTMUX_DMA0_REQEN0_REQ_ENA23(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_REQ_ENA23_SHIFT)) & INPUTMUX_DMA0_REQEN0_REQ_ENA23_MASK)

#define INPUTMUX_DMA0_REQEN0_REQ_ENA24_MASK      (0x1000000U)
#define INPUTMUX_DMA0_REQEN0_REQ_ENA24_SHIFT     (24U)
/*! REQ_ENA24 - Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.
 */
#define INPUTMUX_DMA0_REQEN0_REQ_ENA24(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_REQ_ENA24_SHIFT)) & INPUTMUX_DMA0_REQEN0_REQ_ENA24_MASK)

#define INPUTMUX_DMA0_REQEN0_REQ_ENA25_MASK      (0x2000000U)
#define INPUTMUX_DMA0_REQEN0_REQ_ENA25_SHIFT     (25U)
/*! REQ_ENA25 - Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.
 */
#define INPUTMUX_DMA0_REQEN0_REQ_ENA25(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_REQ_ENA25_SHIFT)) & INPUTMUX_DMA0_REQEN0_REQ_ENA25_MASK)

#define INPUTMUX_DMA0_REQEN0_REQ_ENA26_MASK      (0x4000000U)
#define INPUTMUX_DMA0_REQEN0_REQ_ENA26_SHIFT     (26U)
/*! REQ_ENA26 - Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.
 */
#define INPUTMUX_DMA0_REQEN0_REQ_ENA26(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_REQ_ENA26_SHIFT)) & INPUTMUX_DMA0_REQEN0_REQ_ENA26_MASK)

#define INPUTMUX_DMA0_REQEN0_REQ_ENA27_MASK      (0x8000000U)
#define INPUTMUX_DMA0_REQEN0_REQ_ENA27_SHIFT     (27U)
/*! REQ_ENA27 - Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.
 */
#define INPUTMUX_DMA0_REQEN0_REQ_ENA27(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_REQ_ENA27_SHIFT)) & INPUTMUX_DMA0_REQEN0_REQ_ENA27_MASK)

#define INPUTMUX_DMA0_REQEN0_REQ_ENA28_MASK      (0x10000000U)
#define INPUTMUX_DMA0_REQEN0_REQ_ENA28_SHIFT     (28U)
/*! REQ_ENA28 - Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.
 */
#define INPUTMUX_DMA0_REQEN0_REQ_ENA28(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_REQ_ENA28_SHIFT)) & INPUTMUX_DMA0_REQEN0_REQ_ENA28_MASK)

#define INPUTMUX_DMA0_REQEN0_REQ_ENA29_MASK      (0x20000000U)
#define INPUTMUX_DMA0_REQEN0_REQ_ENA29_SHIFT     (29U)
/*! REQ_ENA29 - Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.
 */
#define INPUTMUX_DMA0_REQEN0_REQ_ENA29(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_REQ_ENA29_SHIFT)) & INPUTMUX_DMA0_REQEN0_REQ_ENA29_MASK)

#define INPUTMUX_DMA0_REQEN0_REQ_ENA30_MASK      (0x40000000U)
#define INPUTMUX_DMA0_REQEN0_REQ_ENA30_SHIFT     (30U)
/*! REQ_ENA30 - Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.
 */
#define INPUTMUX_DMA0_REQEN0_REQ_ENA30(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_REQ_ENA30_SHIFT)) & INPUTMUX_DMA0_REQEN0_REQ_ENA30_MASK)

#define INPUTMUX_DMA0_REQEN0_REQ_ENA31_MASK      (0x80000000U)
#define INPUTMUX_DMA0_REQEN0_REQ_ENA31_SHIFT     (31U)
/*! REQ_ENA31 - Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.
 */
#define INPUTMUX_DMA0_REQEN0_REQ_ENA31(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_REQ_ENA31_SHIFT)) & INPUTMUX_DMA0_REQEN0_REQ_ENA31_MASK)
/*! @} */

/*! @name DMA0_REQEN1 - Enable DMA0 requests */
/*! @{ */

#define INPUTMUX_DMA0_REQEN1_REQ_ENA0_MASK       (0x1U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA0_SHIFT      (0U)
/*! REQ_ENA0 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA0(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA0_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA0_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA1_MASK       (0x2U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA1_SHIFT      (1U)
/*! REQ_ENA1 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA1(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA1_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA1_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA2_MASK       (0x4U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA2_SHIFT      (2U)
/*! REQ_ENA2 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA2(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA2_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA2_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA3_MASK       (0x8U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA3_SHIFT      (3U)
/*! REQ_ENA3 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA3(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA3_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA3_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA4_MASK       (0x10U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA4_SHIFT      (4U)
/*! REQ_ENA4 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA4(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA4_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA4_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA5_MASK       (0x20U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA5_SHIFT      (5U)
/*! REQ_ENA5 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA5(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA5_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA5_MASK)

