RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define INPUTMUX_DMA0_REQEN1_REQ_ENA6_MASK       (0x40U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA6_SHIFT      (6U)
/*! REQ_ENA6 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA6(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA6_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA6_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA7_MASK       (0x80U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA7_SHIFT      (7U)
/*! REQ_ENA7 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA7(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA7_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA7_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA8_MASK       (0x100U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA8_SHIFT      (8U)
/*! REQ_ENA8 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA8(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA8_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA8_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA9_MASK       (0x200U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA9_SHIFT      (9U)
/*! REQ_ENA9 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA9(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA9_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA9_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA10_MASK      (0x400U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA10_SHIFT     (10U)
/*! REQ_ENA10 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA10(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA10_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA10_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA11_MASK      (0x800U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA11_SHIFT     (11U)
/*! REQ_ENA11 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA11(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA11_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA11_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA12_MASK      (0x1000U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA12_SHIFT     (12U)
/*! REQ_ENA12 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA12(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA12_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA12_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA13_MASK      (0x2000U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA13_SHIFT     (13U)
/*! REQ_ENA13 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA13(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA13_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA13_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA14_MASK      (0x4000U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA14_SHIFT     (14U)
/*! REQ_ENA14 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA14(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA14_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA14_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA15_MASK      (0x8000U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA15_SHIFT     (15U)
/*! REQ_ENA15 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA15(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA15_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA15_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA16_MASK      (0x10000U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA16_SHIFT     (16U)
/*! REQ_ENA16 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA16(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA16_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA16_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA17_MASK      (0x20000U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA17_SHIFT     (17U)
/*! REQ_ENA17 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA17(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA17_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA17_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA18_MASK      (0x40000U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA18_SHIFT     (18U)
/*! REQ_ENA18 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA18(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA18_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA18_MASK)

#define INPUTMUX_DMA0_REQEN1_REQ_ENA19_MASK      (0x80000U)
#define INPUTMUX_DMA0_REQEN1_REQ_ENA19_SHIFT     (19U)
/*! REQ_ENA19 - Controls the remaining 20 request inputs of DMA0. If bit i is '1' the DMA request input #(i+32) is enabled.
 */
#define INPUTMUX_DMA0_REQEN1_REQ_ENA19(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_REQ_ENA19_SHIFT)) & INPUTMUX_DMA0_REQEN1_REQ_ENA19_MASK)
/*! @} */

/*! @name DMA0_REQEN0_SET - Set bits in DMA0_REQEN0 register */
/*! @{ */

#define INPUTMUX_DMA0_REQEN0_SET_SET0_MASK       (0x1U)
#define INPUTMUX_DMA0_REQEN0_SET_SET0_SHIFT      (0U)
/*! SET0 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is set to 1; if bit #i = 0, no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_SET_SET0(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_SET_SET0_SHIFT)) & INPUTMUX_DMA0_REQEN0_SET_SET0_MASK)

#define INPUTMUX_DMA0_REQEN0_SET_SET1_MASK       (0x2U)
#define INPUTMUX_DMA0_REQEN0_SET_SET1_SHIFT      (1U)
/*! SET1 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is set to 1; if bit #i = 0, no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_SET_SET1(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_SET_SET1_SHIFT)) & INPUTMUX_DMA0_REQEN0_SET_SET1_MASK)

