RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define INPUTMUX_DMA0_REQEN0_CLR_CLR16_MASK      (0x10000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR16_SHIFT     (16U)
/*! CLR16 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR16(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR16_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR16_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR17_MASK      (0x20000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR17_SHIFT     (17U)
/*! CLR17 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR17(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR17_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR17_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR18_MASK      (0x40000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR18_SHIFT     (18U)
/*! CLR18 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR18(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR18_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR18_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR19_MASK      (0x80000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR19_SHIFT     (19U)
/*! CLR19 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR19(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR19_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR19_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR20_MASK      (0x100000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR20_SHIFT     (20U)
/*! CLR20 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR20(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR20_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR20_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR21_MASK      (0x200000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR21_SHIFT     (21U)
/*! CLR21 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR21(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR21_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR21_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR22_MASK      (0x400000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR22_SHIFT     (22U)
/*! CLR22 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR22(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR22_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR22_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR23_MASK      (0x800000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR23_SHIFT     (23U)
/*! CLR23 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR23(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR23_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR23_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR24_MASK      (0x1000000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR24_SHIFT     (24U)
/*! CLR24 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR24(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR24_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR24_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR25_MASK      (0x2000000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR25_SHIFT     (25U)
/*! CLR25 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR25(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR25_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR25_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR26_MASK      (0x4000000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR26_SHIFT     (26U)
/*! CLR26 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR26(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR26_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR26_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR27_MASK      (0x8000000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR27_SHIFT     (27U)
/*! CLR27 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR27(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR27_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR27_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR28_MASK      (0x10000000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR28_SHIFT     (28U)
/*! CLR28 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR28(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR28_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR28_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR29_MASK      (0x20000000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR29_SHIFT     (29U)
/*! CLR29 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR29(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR29_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR29_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR30_MASK      (0x40000000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR30_SHIFT     (30U)
/*! CLR30 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR30(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR30_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR30_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR31_MASK      (0x80000000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR31_SHIFT     (31U)
/*! CLR31 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR31(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR31_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR31_MASK)
/*! @} */

/*! @name DMA0_REQEN1_CLR - Clear bits in DMA0_REQEN1 register */
/*! @{ */

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA0_MASK   (0x1U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA0_SHIFT  (0U)
/*! REQ_ENA0 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register.
 */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA0(x)     (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA0_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA0_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA1_MASK   (0x2U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA1_SHIFT  (1U)
/*! REQ_ENA1 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register.
 */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA1(x)     (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA1_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA1_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA2_MASK   (0x4U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA2_SHIFT  (2U)
/*! REQ_ENA2 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register.
 */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA2(x)     (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA2_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA2_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA3_MASK   (0x8U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA3_SHIFT  (3U)
/*! REQ_ENA3 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register.
 */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA3(x)     (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA3_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA3_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA4_MASK   (0x10U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA4_SHIFT  (4U)
/*! REQ_ENA4 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register.
 */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA4(x)     (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA4_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA4_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA5_MASK   (0x20U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA5_SHIFT  (5U)
/*! REQ_ENA5 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register.
 */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA5(x)     (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA5_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA5_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA6_MASK   (0x40U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA6_SHIFT  (6U)
/*! REQ_ENA6 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register.
 */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA6(x)     (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA6_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA6_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA7_MASK   (0x80U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA7_SHIFT  (7U)
/*! REQ_ENA7 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register.
 */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA7(x)     (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA7_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA7_MASK)

