RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define INPUTMUX_DMA1_REQEN_SET_SET6_MASK        (0x40U)
#define INPUTMUX_DMA1_REQEN_SET_SET6_SHIFT       (6U)
/*! SET6 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is set to 1; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_SET_SET6(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_SET_SET6_SHIFT)) & INPUTMUX_DMA1_REQEN_SET_SET6_MASK)

#define INPUTMUX_DMA1_REQEN_SET_SET7_MASK        (0x80U)
#define INPUTMUX_DMA1_REQEN_SET_SET7_SHIFT       (7U)
/*! SET7 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is set to 1; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_SET_SET7(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_SET_SET7_SHIFT)) & INPUTMUX_DMA1_REQEN_SET_SET7_MASK)

#define INPUTMUX_DMA1_REQEN_SET_SET8_MASK        (0x100U)
#define INPUTMUX_DMA1_REQEN_SET_SET8_SHIFT       (8U)
/*! SET8 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is set to 1; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_SET_SET8(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_SET_SET8_SHIFT)) & INPUTMUX_DMA1_REQEN_SET_SET8_MASK)

#define INPUTMUX_DMA1_REQEN_SET_SET9_MASK        (0x200U)
#define INPUTMUX_DMA1_REQEN_SET_SET9_SHIFT       (9U)
/*! SET9 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is set to 1; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_SET_SET9(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_SET_SET9_SHIFT)) & INPUTMUX_DMA1_REQEN_SET_SET9_MASK)

#define INPUTMUX_DMA1_REQEN_SET_SET10_MASK       (0x400U)
#define INPUTMUX_DMA1_REQEN_SET_SET10_SHIFT      (10U)
/*! SET10 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is set to 1; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_SET_SET10(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_SET_SET10_SHIFT)) & INPUTMUX_DMA1_REQEN_SET_SET10_MASK)

#define INPUTMUX_DMA1_REQEN_SET_SET11_MASK       (0x800U)
#define INPUTMUX_DMA1_REQEN_SET_SET11_SHIFT      (11U)
/*! SET11 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is set to 1; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_SET_SET11(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_SET_SET11_SHIFT)) & INPUTMUX_DMA1_REQEN_SET_SET11_MASK)

#define INPUTMUX_DMA1_REQEN_SET_SET12_MASK       (0x1000U)
#define INPUTMUX_DMA1_REQEN_SET_SET12_SHIFT      (12U)
/*! SET12 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is set to 1; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_SET_SET12(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_SET_SET12_SHIFT)) & INPUTMUX_DMA1_REQEN_SET_SET12_MASK)

#define INPUTMUX_DMA1_REQEN_SET_SET13_MASK       (0x2000U)
#define INPUTMUX_DMA1_REQEN_SET_SET13_SHIFT      (13U)
/*! SET13 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is set to 1; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_SET_SET13(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_SET_SET13_SHIFT)) & INPUTMUX_DMA1_REQEN_SET_SET13_MASK)

#define INPUTMUX_DMA1_REQEN_SET_SET14_MASK       (0x4000U)
#define INPUTMUX_DMA1_REQEN_SET_SET14_SHIFT      (14U)
/*! SET14 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is set to 1; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_SET_SET14(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_SET_SET14_SHIFT)) & INPUTMUX_DMA1_REQEN_SET_SET14_MASK)

#define INPUTMUX_DMA1_REQEN_SET_SET15_MASK       (0x8000U)
#define INPUTMUX_DMA1_REQEN_SET_SET15_SHIFT      (15U)
/*! SET15 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is set to 1; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_SET_SET15(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_SET_SET15_SHIFT)) & INPUTMUX_DMA1_REQEN_SET_SET15_MASK)
/*! @} */

/*! @name DMA1_REQEN_CLR - Clear bits in DMA1_REQEN register */
/*! @{ */

#define INPUTMUX_DMA1_REQEN_CLR_CLR0_MASK        (0x1U)
#define INPUTMUX_DMA1_REQEN_CLR_CLR0_SHIFT       (0U)
/*! CLR0 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is reset to 0; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_CLR_CLR0(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_CLR_CLR0_SHIFT)) & INPUTMUX_DMA1_REQEN_CLR_CLR0_MASK)

#define INPUTMUX_DMA1_REQEN_CLR_CLR1_MASK        (0x2U)
#define INPUTMUX_DMA1_REQEN_CLR_CLR1_SHIFT       (1U)
/*! CLR1 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is reset to 0; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_CLR_CLR1(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_CLR_CLR1_SHIFT)) & INPUTMUX_DMA1_REQEN_CLR_CLR1_MASK)

#define INPUTMUX_DMA1_REQEN_CLR_CLR2_MASK        (0x4U)
#define INPUTMUX_DMA1_REQEN_CLR_CLR2_SHIFT       (2U)
/*! CLR2 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is reset to 0; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_CLR_CLR2(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_CLR_CLR2_SHIFT)) & INPUTMUX_DMA1_REQEN_CLR_CLR2_MASK)

#define INPUTMUX_DMA1_REQEN_CLR_CLR3_MASK        (0x8U)
#define INPUTMUX_DMA1_REQEN_CLR_CLR3_SHIFT       (3U)
/*! CLR3 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is reset to 0; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_CLR_CLR3(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_CLR_CLR3_SHIFT)) & INPUTMUX_DMA1_REQEN_CLR_CLR3_MASK)

#define INPUTMUX_DMA1_REQEN_CLR_CLR4_MASK        (0x10U)
#define INPUTMUX_DMA1_REQEN_CLR_CLR4_SHIFT       (4U)
/*! CLR4 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is reset to 0; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_CLR_CLR4(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_CLR_CLR4_SHIFT)) & INPUTMUX_DMA1_REQEN_CLR_CLR4_MASK)

#define INPUTMUX_DMA1_REQEN_CLR_CLR5_MASK        (0x20U)
#define INPUTMUX_DMA1_REQEN_CLR_CLR5_SHIFT       (5U)
/*! CLR5 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is reset to 0; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_CLR_CLR5(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_CLR_CLR5_SHIFT)) & INPUTMUX_DMA1_REQEN_CLR_CLR5_MASK)

#define INPUTMUX_DMA1_REQEN_CLR_CLR6_MASK        (0x40U)
#define INPUTMUX_DMA1_REQEN_CLR_CLR6_SHIFT       (6U)
/*! CLR6 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is reset to 0; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_CLR_CLR6(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_CLR_CLR6_SHIFT)) & INPUTMUX_DMA1_REQEN_CLR_CLR6_MASK)

#define INPUTMUX_DMA1_REQEN_CLR_CLR7_MASK        (0x80U)
#define INPUTMUX_DMA1_REQEN_CLR_CLR7_SHIFT       (7U)
/*! CLR7 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is reset to 0; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_CLR_CLR7(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_CLR_CLR7_SHIFT)) & INPUTMUX_DMA1_REQEN_CLR_CLR7_MASK)

#define INPUTMUX_DMA1_REQEN_CLR_CLR8_MASK        (0x100U)
#define INPUTMUX_DMA1_REQEN_CLR_CLR8_SHIFT       (8U)
/*! CLR8 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is reset to 0; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_CLR_CLR8(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_CLR_CLR8_SHIFT)) & INPUTMUX_DMA1_REQEN_CLR_CLR8_MASK)

#define INPUTMUX_DMA1_REQEN_CLR_CLR9_MASK        (0x200U)
#define INPUTMUX_DMA1_REQEN_CLR_CLR9_SHIFT       (9U)
/*! CLR9 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is reset to 0; if bit #i = 0 , no change in DMA1_REQEN register
 */
#define INPUTMUX_DMA1_REQEN_CLR_CLR9(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_CLR_CLR9_SHIFT)) & INPUTMUX_DMA1_REQEN_CLR_CLR9_MASK)

