RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN30_MASK    (0x40000000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN30_SHIFT   (30U)
/*! ITRIGEN30 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN30(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN30_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN30_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN31_MASK    (0x80000000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN31_SHIFT   (31U)
/*! ITRIGEN31 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN31(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN31_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN31_MASK)
/*! @} */

/*! @name DMA0_ITRIGEN1 - Enable DMA0 triggers */
/*! @{ */

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN0_MASK     (0x1U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN0_SHIFT    (0U)
/*! ITRIGEN0 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN0(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN0_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN0_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN1_MASK     (0x2U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN1_SHIFT    (1U)
/*! ITRIGEN1 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN1(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN1_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN1_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN2_MASK     (0x4U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN2_SHIFT    (2U)
/*! ITRIGEN2 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN2(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN2_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN2_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN3_MASK     (0x8U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN3_SHIFT    (3U)
/*! ITRIGEN3 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN3(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN3_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN3_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN4_MASK     (0x10U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN4_SHIFT    (4U)
/*! ITRIGEN4 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN4(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN4_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN4_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN5_MASK     (0x20U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN5_SHIFT    (5U)
/*! ITRIGEN5 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN5(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN5_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN5_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN6_MASK     (0x40U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN6_SHIFT    (6U)
/*! ITRIGEN6 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN6(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN6_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN6_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN7_MASK     (0x80U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN7_SHIFT    (7U)
/*! ITRIGEN7 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN7(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN7_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN7_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN8_MASK     (0x100U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN8_SHIFT    (8U)
/*! ITRIGEN8 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN8(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN8_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN8_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN9_MASK     (0x200U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN9_SHIFT    (9U)
/*! ITRIGEN9 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN9(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN9_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN9_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN10_MASK    (0x400U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN10_SHIFT   (10U)
/*! ITRIGEN10 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN10(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN10_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN10_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN11_MASK    (0x800U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN11_SHIFT   (11U)
/*! ITRIGEN11 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN11(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN11_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN11_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN12_MASK    (0x1000U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN12_SHIFT   (12U)
/*! ITRIGEN12 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN12(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN12_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN12_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN13_MASK    (0x2000U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN13_SHIFT   (13U)
/*! ITRIGEN13 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN13(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN13_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN13_MASK)

