RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN14_MASK    (0x4000U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN14_SHIFT   (14U)
/*! ITRIGEN14 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN14(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN14_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN14_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN15_MASK    (0x8000U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN15_SHIFT   (15U)
/*! ITRIGEN15 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN15(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN15_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN15_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN16_MASK    (0x10000U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN16_SHIFT   (16U)
/*! ITRIGEN16 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN16(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN16_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN16_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN17_MASK    (0x20000U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN17_SHIFT   (17U)
/*! ITRIGEN17 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN17(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN17_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN17_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN18_MASK    (0x40000U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN18_SHIFT   (18U)
/*! ITRIGEN18 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN18(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN18_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN18_MASK)

#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN19_MASK    (0x80000U)
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN19_SHIFT   (19U)
/*! ITRIGEN19 - Controls the remaining 20 trigger inputs of DMA0. If bit n is '1' the DMA trigger input #(n+32) is enabled.
 */
#define INPUTMUX_DMA0_ITRIGEN1_ITRIGEN19(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN1_ITRIGEN19_SHIFT)) & INPUTMUX_DMA0_ITRIGEN1_ITRIGEN19_MASK)
/*! @} */

/*! @name DMA0_ITRIGEN0_SET - Set bits in DMA0_ITRIGEN0 register */
/*! @{ */

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET0_MASK     (0x1U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET0_SHIFT    (0U)
/*! SET0 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET0(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET0_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET0_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET1_MASK     (0x2U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET1_SHIFT    (1U)
/*! SET1 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET1(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET1_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET1_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET2_MASK     (0x4U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET2_SHIFT    (2U)
/*! SET2 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET2(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET2_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET2_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET3_MASK     (0x8U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET3_SHIFT    (3U)
/*! SET3 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET3(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET3_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET3_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET4_MASK     (0x10U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET4_SHIFT    (4U)
/*! SET4 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET4(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET4_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET4_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET5_MASK     (0x20U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET5_SHIFT    (5U)
/*! SET5 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET5(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET5_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET5_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET6_MASK     (0x40U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET6_SHIFT    (6U)
/*! SET6 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET6(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET6_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET6_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET7_MASK     (0x80U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET7_SHIFT    (7U)
/*! SET7 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET7(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET7_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET7_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET8_MASK     (0x100U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET8_SHIFT    (8U)
/*! SET8 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET8(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET8_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET8_MASK)

