RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN3_MASK      (0x8U)
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN3_SHIFT     (3U)
/*! ITRIGEN3 - Controls the 16 trigger inputs of DMA1. If bit i is '1' the DMA trigger input #i is enabled.
 */
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN3(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_ITRIGEN3_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_ITRIGEN3_MASK)

#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN4_MASK      (0x10U)
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN4_SHIFT     (4U)
/*! ITRIGEN4 - Controls the 16 trigger inputs of DMA1. If bit i is '1' the DMA trigger input #i is enabled.
 */
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN4(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_ITRIGEN4_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_ITRIGEN4_MASK)

#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN5_MASK      (0x20U)
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN5_SHIFT     (5U)
/*! ITRIGEN5 - Controls the 16 trigger inputs of DMA1. If bit i is '1' the DMA trigger input #i is enabled.
 */
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN5(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_ITRIGEN5_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_ITRIGEN5_MASK)

#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN6_MASK      (0x40U)
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN6_SHIFT     (6U)
/*! ITRIGEN6 - Controls the 16 trigger inputs of DMA1. If bit i is '1' the DMA trigger input #i is enabled.
 */
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN6(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_ITRIGEN6_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_ITRIGEN6_MASK)

#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN7_MASK      (0x80U)
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN7_SHIFT     (7U)
/*! ITRIGEN7 - Controls the 16 trigger inputs of DMA1. If bit i is '1' the DMA trigger input #i is enabled.
 */
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN7(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_ITRIGEN7_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_ITRIGEN7_MASK)

#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN8_MASK      (0x100U)
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN8_SHIFT     (8U)
/*! ITRIGEN8 - Controls the 16 trigger inputs of DMA1. If bit i is '1' the DMA trigger input #i is enabled.
 */
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN8(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_ITRIGEN8_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_ITRIGEN8_MASK)

#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN9_MASK      (0x200U)
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN9_SHIFT     (9U)
/*! ITRIGEN9 - Controls the 16 trigger inputs of DMA1. If bit i is '1' the DMA trigger input #i is enabled.
 */
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN9(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_ITRIGEN9_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_ITRIGEN9_MASK)

#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN10_MASK     (0x400U)
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN10_SHIFT    (10U)
/*! ITRIGEN10 - Controls the 16 trigger inputs of DMA1. If bit i is '1' the DMA trigger input #i is enabled.
 */
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN10(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_ITRIGEN10_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_ITRIGEN10_MASK)

#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN11_MASK     (0x800U)
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN11_SHIFT    (11U)
/*! ITRIGEN11 - Controls the 16 trigger inputs of DMA1. If bit i is '1' the DMA trigger input #i is enabled.
 */
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN11(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_ITRIGEN11_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_ITRIGEN11_MASK)

#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN12_MASK     (0x1000U)
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN12_SHIFT    (12U)
/*! ITRIGEN12 - Controls the 16 trigger inputs of DMA1. If bit i is '1' the DMA trigger input #i is enabled.
 */
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN12(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_ITRIGEN12_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_ITRIGEN12_MASK)

#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN13_MASK     (0x2000U)
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN13_SHIFT    (13U)
/*! ITRIGEN13 - Controls the 16 trigger inputs of DMA1. If bit i is '1' the DMA trigger input #i is enabled.
 */
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN13(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_ITRIGEN13_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_ITRIGEN13_MASK)

#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN14_MASK     (0x4000U)
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN14_SHIFT    (14U)
/*! ITRIGEN14 - Controls the 16 trigger inputs of DMA1. If bit i is '1' the DMA trigger input #i is enabled.
 */
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN14(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_ITRIGEN14_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_ITRIGEN14_MASK)

#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN15_MASK     (0x8000U)
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN15_SHIFT    (15U)
/*! ITRIGEN15 - Controls the 16 trigger inputs of DMA1. If bit i is '1' the DMA trigger input #i is enabled.
 */
#define INPUTMUX_DMA1_ITRIGEN_ITRIGEN15(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_ITRIGEN15_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_ITRIGEN15_MASK)
/*! @} */

/*! @name DMA1_ITRIGEN_SET - Set bits in DMA1_ITRIGEN register */
/*! @{ */

#define INPUTMUX_DMA1_ITRIGEN_SET_SET0_MASK      (0x1U)
#define INPUTMUX_DMA1_ITRIGEN_SET_SET0_SHIFT     (0U)
/*! SET0 - Write : If bit #i = 1, bit #i in DMA1_ITRIGEN register is set to 1; if bit #i = 0 , no change in DMA1_ITRIGEN register
 */
#define INPUTMUX_DMA1_ITRIGEN_SET_SET0(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_SET_SET0_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_SET_SET0_MASK)

#define INPUTMUX_DMA1_ITRIGEN_SET_SET1_MASK      (0x2U)
#define INPUTMUX_DMA1_ITRIGEN_SET_SET1_SHIFT     (1U)
/*! SET1 - Write : If bit #i = 1, bit #i in DMA1_ITRIGEN register is set to 1; if bit #i = 0 , no change in DMA1_ITRIGEN register
 */
#define INPUTMUX_DMA1_ITRIGEN_SET_SET1(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_SET_SET1_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_SET_SET1_MASK)

#define INPUTMUX_DMA1_ITRIGEN_SET_SET2_MASK      (0x4U)
#define INPUTMUX_DMA1_ITRIGEN_SET_SET2_SHIFT     (2U)
/*! SET2 - Write : If bit #i = 1, bit #i in DMA1_ITRIGEN register is set to 1; if bit #i = 0 , no change in DMA1_ITRIGEN register
 */
#define INPUTMUX_DMA1_ITRIGEN_SET_SET2(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_SET_SET2_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_SET_SET2_MASK)

