RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR6_MASK      (0x40U)
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR6_SHIFT     (6U)
/*! CLR6 - Write : If bit #i = 1, bit #i in DMA1_ITRIGEN register is reset to 0; if bit #i = 0 , no change in DMA1_ITRIGEN register
 */
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR6(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_CLR_CLR6_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_CLR_CLR6_MASK)

#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR7_MASK      (0x80U)
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR7_SHIFT     (7U)
/*! CLR7 - Write : If bit #i = 1, bit #i in DMA1_ITRIGEN register is reset to 0; if bit #i = 0 , no change in DMA1_ITRIGEN register
 */
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR7(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_CLR_CLR7_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_CLR_CLR7_MASK)

#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR8_MASK      (0x100U)
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR8_SHIFT     (8U)
/*! CLR8 - Write : If bit #i = 1, bit #i in DMA1_ITRIGEN register is reset to 0; if bit #i = 0 , no change in DMA1_ITRIGEN register
 */
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR8(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_CLR_CLR8_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_CLR_CLR8_MASK)

#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR9_MASK      (0x200U)
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR9_SHIFT     (9U)
/*! CLR9 - Write : If bit #i = 1, bit #i in DMA1_ITRIGEN register is reset to 0; if bit #i = 0 , no change in DMA1_ITRIGEN register
 */
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR9(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_CLR_CLR9_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_CLR_CLR9_MASK)

#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR10_MASK     (0x400U)
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR10_SHIFT    (10U)
/*! CLR10 - Write : If bit #i = 1, bit #i in DMA1_ITRIGEN register is reset to 0; if bit #i = 0 , no change in DMA1_ITRIGEN register
 */
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR10(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_CLR_CLR10_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_CLR_CLR10_MASK)

#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR11_MASK     (0x800U)
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR11_SHIFT    (11U)
/*! CLR11 - Write : If bit #i = 1, bit #i in DMA1_ITRIGEN register is reset to 0; if bit #i = 0 , no change in DMA1_ITRIGEN register
 */
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR11(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_CLR_CLR11_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_CLR_CLR11_MASK)

#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR12_MASK     (0x1000U)
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR12_SHIFT    (12U)
/*! CLR12 - Write : If bit #i = 1, bit #i in DMA1_ITRIGEN register is reset to 0; if bit #i = 0 , no change in DMA1_ITRIGEN register
 */
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR12(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_CLR_CLR12_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_CLR_CLR12_MASK)

#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR13_MASK     (0x2000U)
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR13_SHIFT    (13U)
/*! CLR13 - Write : If bit #i = 1, bit #i in DMA1_ITRIGEN register is reset to 0; if bit #i = 0 , no change in DMA1_ITRIGEN register
 */
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR13(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_CLR_CLR13_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_CLR_CLR13_MASK)

#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR14_MASK     (0x4000U)
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR14_SHIFT    (14U)
/*! CLR14 - Write : If bit #i = 1, bit #i in DMA1_ITRIGEN register is reset to 0; if bit #i = 0 , no change in DMA1_ITRIGEN register
 */
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR14(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_CLR_CLR14_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_CLR_CLR14_MASK)

#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR15_MASK     (0x8000U)
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR15_SHIFT    (15U)
/*! CLR15 - Write : If bit #i = 1, bit #i in DMA1_ITRIGEN register is reset to 0; if bit #i = 0 , no change in DMA1_ITRIGEN register
 */
#define INPUTMUX_DMA1_ITRIGEN_CLR_CLR15(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_ITRIGEN_CLR_CLR15_SHIFT)) & INPUTMUX_DMA1_ITRIGEN_CLR_CLR15_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group INPUTMUX_Register_Masks */


/* INPUTMUX - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral INPUTMUX base address */
  #define INPUTMUX_BASE                            (0x50006000u)
  /** Peripheral INPUTMUX base address */
  #define INPUTMUX_BASE_NS                         (0x40006000u)
  /** Peripheral INPUTMUX base pointer */
  #define INPUTMUX                                 ((INPUTMUX_Type *)INPUTMUX_BASE)
  /** Peripheral INPUTMUX base pointer */
  #define INPUTMUX_NS                              ((INPUTMUX_Type *)INPUTMUX_BASE_NS)
  /** Array initializer of INPUTMUX peripheral base addresses */
  #define INPUTMUX_BASE_ADDRS                      { INPUTMUX_BASE }
  /** Array initializer of INPUTMUX peripheral base pointers */
  #define INPUTMUX_BASE_PTRS                       { INPUTMUX }
  /** Array initializer of INPUTMUX peripheral base addresses */
  #define INPUTMUX_BASE_ADDRS_NS                   { INPUTMUX_BASE_NS }
  /** Array initializer of INPUTMUX peripheral base pointers */
  #define INPUTMUX_BASE_PTRS_NS                    { INPUTMUX_NS }
#else
  /** Peripheral INPUTMUX base address */
  #define INPUTMUX_BASE                            (0x40006000u)
  /** Peripheral INPUTMUX base pointer */
  #define INPUTMUX                                 ((INPUTMUX_Type *)INPUTMUX_BASE)
  /** Array initializer of INPUTMUX peripheral base addresses */
  #define INPUTMUX_BASE_ADDRS                      { INPUTMUX_BASE }
  /** Array initializer of INPUTMUX peripheral base pointers */
  #define INPUTMUX_BASE_PTRS                       { INPUTMUX }
#endif

/*!
 * @}
 */ /* end of group INPUTMUX_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- IOCON Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup IOCON_Peripheral_Access_Layer IOCON Peripheral Access Layer
 * @{
 */

/** IOCON - Register Layout Typedef */
typedef struct {
  __IO uint32_t PIO[4][32];                        /**< Analog/Digital I/O control for port..Digital I/O control for port, array offset: 0x0, array step: index*0x80, index2*0x4 */
} IOCON_Type;

/* ----------------------------------------------------------------------------
   -- IOCON Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup IOCON_Register_Masks IOCON Register Masks
 * @{
 */

/*! @name PIO - Analog/Digital I/O control for port..Digital I/O control for port */
/*! @{ */

#define IOCON_PIO_FUNC_MASK                      (0xFU)
#define IOCON_PIO_FUNC_SHIFT                     (0U)
/*! FUNC - Signal(function) select
 */
#define IOCON_PIO_FUNC(x)                        (((uint32_t)(((uint32_t)(x)) << IOCON_PIO_FUNC_SHIFT)) & IOCON_PIO_FUNC_MASK)

