RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define ITRC_STATUS_OUT0_STATUS_MASK             (0x10000U)
#define ITRC_STATUS_OUT0_STATUS_SHIFT            (16U)
/*! OUT0_STATUS - ITRC triggered ITRC_IRQ output.
 */
#define ITRC_STATUS_OUT0_STATUS(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS_OUT0_STATUS_SHIFT)) & ITRC_STATUS_OUT0_STATUS_MASK)

#define ITRC_STATUS_OUT1_STATUS_MASK             (0x20000U)
#define ITRC_STATUS_OUT1_STATUS_SHIFT            (17U)
/*! OUT1_STATUS - ITRC triggered CSS_RESET to clear CSS key store.
 */
#define ITRC_STATUS_OUT1_STATUS(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS_OUT1_STATUS_SHIFT)) & ITRC_STATUS_OUT1_STATUS_MASK)

#define ITRC_STATUS_OUT2_STATUS_MASK             (0x40000U)
#define ITRC_STATUS_OUT2_STATUS_SHIFT            (18U)
/*! OUT2_STATUS - ITRC triggered PUF_ZEROIZE to clear PUF key store and RAM.
 */
#define ITRC_STATUS_OUT2_STATUS(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS_OUT2_STATUS_SHIFT)) & ITRC_STATUS_OUT2_STATUS_MASK)

#define ITRC_STATUS_OUT3_STATUS_MASK             (0x80000U)
#define ITRC_STATUS_OUT3_STATUS_SHIFT            (19U)
/*! OUT3_STATUS - ITRC triggered RAM_ZEROIZE to clear retention and PKC RAM contents.
 */
#define ITRC_STATUS_OUT3_STATUS(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS_OUT3_STATUS_SHIFT)) & ITRC_STATUS_OUT3_STATUS_MASK)

#define ITRC_STATUS_OUT4_STATUS_MASK             (0x100000U)
#define ITRC_STATUS_OUT4_STATUS_SHIFT            (20U)
/*! OUT4_STATUS - ITRC triggered CHIP_RESET to reset the chip after all other response process finished.
 */
#define ITRC_STATUS_OUT4_STATUS(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS_OUT4_STATUS_SHIFT)) & ITRC_STATUS_OUT4_STATUS_MASK)

#define ITRC_STATUS_OUT5_STATUS_MASK             (0x200000U)
#define ITRC_STATUS_OUT5_STATUS_SHIFT            (21U)
/*! OUT5_STATUS - ITRC triggered TMPR_OUT internal signal connected to various on-chip multiplexers.
 */
#define ITRC_STATUS_OUT5_STATUS(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS_OUT5_STATUS_SHIFT)) & ITRC_STATUS_OUT5_STATUS_MASK)
/*! @} */

/*! @name OUT0_SEL0 - ITRC_IRQ trigger Source IN0 to IN15 selector 0 */
/*! @{ */

#define ITRC_OUT0_SEL0_IN0_SEL0_MASK             (0x3U)
#define ITRC_OUT0_SEL0_IN0_SEL0_SHIFT            (0U)
/*! IN0_SEL0 - Selects digital glitch detector as a trigger source.
 */
#define ITRC_OUT0_SEL0_IN0_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT0_SEL0_IN0_SEL0_SHIFT)) & ITRC_OUT0_SEL0_IN0_SEL0_MASK)

#define ITRC_OUT0_SEL0_IN1_SEL0_MASK             (0xCU)
#define ITRC_OUT0_SEL0_IN1_SEL0_SHIFT            (2U)
/*! IN1_SEL0 - Selects tamper pin event as a trigger source.
 */
#define ITRC_OUT0_SEL0_IN1_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT0_SEL0_IN1_SEL0_SHIFT)) & ITRC_OUT0_SEL0_IN1_SEL0_MASK)

#define ITRC_OUT0_SEL0_IN2_SEL0_MASK             (0x30U)
#define ITRC_OUT0_SEL0_IN2_SEL0_SHIFT            (4U)
/*! IN2_SEL0 - Selects Code Watch Dog event as a trigger source.
 */
#define ITRC_OUT0_SEL0_IN2_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT0_SEL0_IN2_SEL0_SHIFT)) & ITRC_OUT0_SEL0_IN2_SEL0_MASK)

#define ITRC_OUT0_SEL0_IN3_SEL0_MASK             (0xC0U)
#define ITRC_OUT0_SEL0_IN3_SEL0_SHIFT            (6U)
/*! IN3_SEL0 - Selects low-voltage event on VDD_MAIN rail as a trigger source.
 */
#define ITRC_OUT0_SEL0_IN3_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT0_SEL0_IN3_SEL0_SHIFT)) & ITRC_OUT0_SEL0_IN3_SEL0_MASK)

#define ITRC_OUT0_SEL0_IN4_SEL0_MASK             (0x300U)
#define ITRC_OUT0_SEL0_IN4_SEL0_SHIFT            (8U)
/*! IN4_SEL0 - Selects low-voltage event on VDD_CORE rail as a trigger source.
 */
#define ITRC_OUT0_SEL0_IN4_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT0_SEL0_IN4_SEL0_SHIFT)) & ITRC_OUT0_SEL0_IN4_SEL0_MASK)

#define ITRC_OUT0_SEL0_IN5_SEL0_MASK             (0xC00U)
#define ITRC_OUT0_SEL0_IN5_SEL0_SHIFT            (10U)
/*! IN5_SEL0 - Selects Watch Dog timer event as a trigger source.
 */
#define ITRC_OUT0_SEL0_IN5_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT0_SEL0_IN5_SEL0_SHIFT)) & ITRC_OUT0_SEL0_IN5_SEL0_MASK)

#define ITRC_OUT0_SEL0_IN6_SEL0_MASK             (0x3000U)
#define ITRC_OUT0_SEL0_IN6_SEL0_SHIFT            (12U)
/*! IN6_SEL0 - Selects Flash ECC mismatch event as a trigger source.
 */
#define ITRC_OUT0_SEL0_IN6_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT0_SEL0_IN6_SEL0_SHIFT)) & ITRC_OUT0_SEL0_IN6_SEL0_MASK)

#define ITRC_OUT0_SEL0_IN7_SEL0_MASK             (0xC000U)
#define ITRC_OUT0_SEL0_IN7_SEL0_SHIFT            (14U)
/*! IN7_SEL0 - Selects AHB secure bus illegal access event as a trigger source.
 */
#define ITRC_OUT0_SEL0_IN7_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT0_SEL0_IN7_SEL0_SHIFT)) & ITRC_OUT0_SEL0_IN7_SEL0_MASK)

#define ITRC_OUT0_SEL0_IN8_SEL0_MASK             (0x30000U)
#define ITRC_OUT0_SEL0_IN8_SEL0_SHIFT            (16U)
/*! IN8_SEL0 - Selects CSS error event as a trigger source.
 */
#define ITRC_OUT0_SEL0_IN8_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT0_SEL0_IN8_SEL0_SHIFT)) & ITRC_OUT0_SEL0_IN8_SEL0_MASK)

#define ITRC_OUT0_SEL0_IN10_SEL0_MASK            (0x300000U)
#define ITRC_OUT0_SEL0_IN10_SEL0_SHIFT           (20U)
/*! IN10_SEL0 - Selects PKC error event as a trigger source.
 */
#define ITRC_OUT0_SEL0_IN10_SEL0(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_OUT0_SEL0_IN10_SEL0_SHIFT)) & ITRC_OUT0_SEL0_IN10_SEL0_MASK)

#define ITRC_OUT0_SEL0_IN14_SEL0_MASK            (0x30000000U)
#define ITRC_OUT0_SEL0_IN14_SEL0_SHIFT           (28U)
/*! IN14_SEL0 - Selects software event 0 as a trigger source.
 */
#define ITRC_OUT0_SEL0_IN14_SEL0(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_OUT0_SEL0_IN14_SEL0_SHIFT)) & ITRC_OUT0_SEL0_IN14_SEL0_MASK)

#define ITRC_OUT0_SEL0_IN15_SEL0_MASK            (0xC0000000U)
#define ITRC_OUT0_SEL0_IN15_SEL0_SHIFT           (30U)
/*! IN15_SEL0 - Selects software event 1 as a trigger source.
 */
#define ITRC_OUT0_SEL0_IN15_SEL0(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_OUT0_SEL0_IN15_SEL0_SHIFT)) & ITRC_OUT0_SEL0_IN15_SEL0_MASK)
/*! @} */

/*! @name OUT0_SEL1 - ITRC_IRQ Trigger source IN0 to IN15 selector 1 */
/*! @{ */

