RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define ITRC_OUT1_SEL1_IN5_SEL1_MASK             (0xC00U)
#define ITRC_OUT1_SEL1_IN5_SEL1_SHIFT            (10U)
/*! IN5_SEL1 - Selects Watch Dog timer event as a trigger source.
 */
#define ITRC_OUT1_SEL1_IN5_SEL1(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT1_SEL1_IN5_SEL1_SHIFT)) & ITRC_OUT1_SEL1_IN5_SEL1_MASK)

#define ITRC_OUT1_SEL1_IN6_SEL1_MASK             (0x3000U)
#define ITRC_OUT1_SEL1_IN6_SEL1_SHIFT            (12U)
/*! IN6_SEL1 - Selects Flash ECC mismatch event as a trigger source.
 */
#define ITRC_OUT1_SEL1_IN6_SEL1(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT1_SEL1_IN6_SEL1_SHIFT)) & ITRC_OUT1_SEL1_IN6_SEL1_MASK)

#define ITRC_OUT1_SEL1_IN7_SEL1_MASK             (0xC000U)
#define ITRC_OUT1_SEL1_IN7_SEL1_SHIFT            (14U)
/*! IN7_SEL1 - Selects AHB secure bus illegal access event as a trigger source.
 */
#define ITRC_OUT1_SEL1_IN7_SEL1(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT1_SEL1_IN7_SEL1_SHIFT)) & ITRC_OUT1_SEL1_IN7_SEL1_MASK)

#define ITRC_OUT1_SEL1_IN8_SEL1_MASK             (0x30000U)
#define ITRC_OUT1_SEL1_IN8_SEL1_SHIFT            (16U)
/*! IN8_SEL1 - Selects CSS error event as a trigger source.
 */
#define ITRC_OUT1_SEL1_IN8_SEL1(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT1_SEL1_IN8_SEL1_SHIFT)) & ITRC_OUT1_SEL1_IN8_SEL1_MASK)

#define ITRC_OUT1_SEL1_IN10_SEL1_MASK            (0x300000U)
#define ITRC_OUT1_SEL1_IN10_SEL1_SHIFT           (20U)
/*! IN10_SEL1 - Selects PKC error event as a trigger source.
 */
#define ITRC_OUT1_SEL1_IN10_SEL1(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_OUT1_SEL1_IN10_SEL1_SHIFT)) & ITRC_OUT1_SEL1_IN10_SEL1_MASK)

#define ITRC_OUT1_SEL1_IN14_SEL1_MASK            (0x30000000U)
#define ITRC_OUT1_SEL1_IN14_SEL1_SHIFT           (28U)
/*! IN14_SEL1 - Selects software event 0 as a trigger source.
 */
#define ITRC_OUT1_SEL1_IN14_SEL1(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_OUT1_SEL1_IN14_SEL1_SHIFT)) & ITRC_OUT1_SEL1_IN14_SEL1_MASK)

#define ITRC_OUT1_SEL1_IN15_SEL1_MASK            (0xC0000000U)
#define ITRC_OUT1_SEL1_IN15_SEL1_SHIFT           (30U)
/*! IN15_SEL1 - Selects software event 1 as a trigger source.
 */
#define ITRC_OUT1_SEL1_IN15_SEL1(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_OUT1_SEL1_IN15_SEL1_SHIFT)) & ITRC_OUT1_SEL1_IN15_SEL1_MASK)
/*! @} */

/*! @name OUT2_SEL0 - PUF_ZEROIZE Trigger source IN0 to IN15 selector 0 */
/*! @{ */

#define ITRC_OUT2_SEL0_IN0_SEL0_MASK             (0x3U)
#define ITRC_OUT2_SEL0_IN0_SEL0_SHIFT            (0U)
/*! IN0_SEL0 - CSS_RESET Trigger source selector 0 register.
 */
#define ITRC_OUT2_SEL0_IN0_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL0_IN0_SEL0_SHIFT)) & ITRC_OUT2_SEL0_IN0_SEL0_MASK)

#define ITRC_OUT2_SEL0_IN1_SEL0_MASK             (0xCU)
#define ITRC_OUT2_SEL0_IN1_SEL0_SHIFT            (2U)
/*! IN1_SEL0 - Selects tamper pin event as a trigger source.
 */
#define ITRC_OUT2_SEL0_IN1_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL0_IN1_SEL0_SHIFT)) & ITRC_OUT2_SEL0_IN1_SEL0_MASK)

#define ITRC_OUT2_SEL0_IN2_SEL0_MASK             (0x30U)
#define ITRC_OUT2_SEL0_IN2_SEL0_SHIFT            (4U)
/*! IN2_SEL0 - Selects Code Watch Dog event as a trigger source.
 */
#define ITRC_OUT2_SEL0_IN2_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL0_IN2_SEL0_SHIFT)) & ITRC_OUT2_SEL0_IN2_SEL0_MASK)

#define ITRC_OUT2_SEL0_IN3_SEL0_MASK             (0xC0U)
#define ITRC_OUT2_SEL0_IN3_SEL0_SHIFT            (6U)
/*! IN3_SEL0 - Selects low-voltage event on VDD_MAIN rail as a trigger source.
 */
#define ITRC_OUT2_SEL0_IN3_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL0_IN3_SEL0_SHIFT)) & ITRC_OUT2_SEL0_IN3_SEL0_MASK)

#define ITRC_OUT2_SEL0_IN4_SEL0_MASK             (0x300U)
#define ITRC_OUT2_SEL0_IN4_SEL0_SHIFT            (8U)
/*! IN4_SEL0 - Selects low-voltage event on VDD_CORE rail as a trigger source.
 */
#define ITRC_OUT2_SEL0_IN4_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL0_IN4_SEL0_SHIFT)) & ITRC_OUT2_SEL0_IN4_SEL0_MASK)

#define ITRC_OUT2_SEL0_IN5_SEL0_MASK             (0xC00U)
#define ITRC_OUT2_SEL0_IN5_SEL0_SHIFT            (10U)
/*! IN5_SEL0 - Selects Watch Dog timer event as a trigger source.
 */
#define ITRC_OUT2_SEL0_IN5_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL0_IN5_SEL0_SHIFT)) & ITRC_OUT2_SEL0_IN5_SEL0_MASK)

#define ITRC_OUT2_SEL0_IN6_SEL0_MASK             (0x3000U)
#define ITRC_OUT2_SEL0_IN6_SEL0_SHIFT            (12U)
/*! IN6_SEL0 - Selects Flash ECC mismatch event as a trigger source.
 */
#define ITRC_OUT2_SEL0_IN6_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL0_IN6_SEL0_SHIFT)) & ITRC_OUT2_SEL0_IN6_SEL0_MASK)

#define ITRC_OUT2_SEL0_IN7_SEL0_MASK             (0xC000U)
#define ITRC_OUT2_SEL0_IN7_SEL0_SHIFT            (14U)
/*! IN7_SEL0 - Selects AHB secure bus illegal access event as a trigger source.
 */
#define ITRC_OUT2_SEL0_IN7_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL0_IN7_SEL0_SHIFT)) & ITRC_OUT2_SEL0_IN7_SEL0_MASK)

#define ITRC_OUT2_SEL0_IN8_SEL0_MASK             (0x30000U)
#define ITRC_OUT2_SEL0_IN8_SEL0_SHIFT            (16U)
/*! IN8_SEL0 - Selects CSS error event as a trigger source.
 */
#define ITRC_OUT2_SEL0_IN8_SEL0(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL0_IN8_SEL0_SHIFT)) & ITRC_OUT2_SEL0_IN8_SEL0_MASK)

#define ITRC_OUT2_SEL0_IN10_SEL0_MASK            (0x300000U)
#define ITRC_OUT2_SEL0_IN10_SEL0_SHIFT           (20U)
/*! IN10_SEL0 - Selects PKC error event as a trigger source.
 */
#define ITRC_OUT2_SEL0_IN10_SEL0(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL0_IN10_SEL0_SHIFT)) & ITRC_OUT2_SEL0_IN10_SEL0_MASK)

#define ITRC_OUT2_SEL0_IN14_SEL0_MASK            (0x30000000U)
#define ITRC_OUT2_SEL0_IN14_SEL0_SHIFT           (28U)
/*! IN14_SEL0 - Selects software event 0 as a trigger source.
 */
#define ITRC_OUT2_SEL0_IN14_SEL0(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL0_IN14_SEL0_SHIFT)) & ITRC_OUT2_SEL0_IN14_SEL0_MASK)

#define ITRC_OUT2_SEL0_IN15_SEL0_MASK            (0xC0000000U)
#define ITRC_OUT2_SEL0_IN15_SEL0_SHIFT           (30U)
/*! IN15_SEL0 - Selects software event 1 as a trigger source.
 */
#define ITRC_OUT2_SEL0_IN15_SEL0(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL0_IN15_SEL0_SHIFT)) & ITRC_OUT2_SEL0_IN15_SEL0_MASK)
/*! @} */

/*! @name OUT2_SEL1 - PUF_ZEROIZE Trigger source IN0 to IN15 selector 1 */
/*! @{ */

#define ITRC_OUT2_SEL1_IN0_SEL1_MASK             (0x3U)
#define ITRC_OUT2_SEL1_IN0_SEL1_SHIFT            (0U)
/*! IN0_SEL1 - Selects digital glitch detector as a trigger source.
 */
#define ITRC_OUT2_SEL1_IN0_SEL1(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL1_IN0_SEL1_SHIFT)) & ITRC_OUT2_SEL1_IN0_SEL1_MASK)

#define ITRC_OUT2_SEL1_IN1_SEL1_MASK             (0xCU)
#define ITRC_OUT2_SEL1_IN1_SEL1_SHIFT            (2U)
/*! IN1_SEL1 - Selects tamper pin event as a trigger source.
 */
#define ITRC_OUT2_SEL1_IN1_SEL1(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL1_IN1_SEL1_SHIFT)) & ITRC_OUT2_SEL1_IN1_SEL1_MASK)

#define ITRC_OUT2_SEL1_IN2_SEL1_MASK             (0x30U)
#define ITRC_OUT2_SEL1_IN2_SEL1_SHIFT            (4U)
/*! IN2_SEL1 - Selects Code Watch Dog event as a trigger source.
 */
#define ITRC_OUT2_SEL1_IN2_SEL1(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL1_IN2_SEL1_SHIFT)) & ITRC_OUT2_SEL1_IN2_SEL1_MASK)

#define ITRC_OUT2_SEL1_IN3_SEL1_MASK             (0xC0U)
#define ITRC_OUT2_SEL1_IN3_SEL1_SHIFT            (6U)
/*! IN3_SEL1 - Selects low-voltage event on VDD_MAIN rail as a trigger source.
 */
#define ITRC_OUT2_SEL1_IN3_SEL1(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL1_IN3_SEL1_SHIFT)) & ITRC_OUT2_SEL1_IN3_SEL1_MASK)

#define ITRC_OUT2_SEL1_IN4_SEL1_MASK             (0x300U)
#define ITRC_OUT2_SEL1_IN4_SEL1_SHIFT            (8U)
/*! IN4_SEL1 - Selects low-voltage event on VDD_CORE rail as a trigger source.
 */
#define ITRC_OUT2_SEL1_IN4_SEL1(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL1_IN4_SEL1_SHIFT)) & ITRC_OUT2_SEL1_IN4_SEL1_MASK)

#define ITRC_OUT2_SEL1_IN5_SEL1_MASK             (0xC00U)
#define ITRC_OUT2_SEL1_IN5_SEL1_SHIFT            (10U)
/*! IN5_SEL1 - Selects Watch Dog timer event as a trigger source.
 */
#define ITRC_OUT2_SEL1_IN5_SEL1(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL1_IN5_SEL1_SHIFT)) & ITRC_OUT2_SEL1_IN5_SEL1_MASK)

#define ITRC_OUT2_SEL1_IN6_SEL1_MASK             (0x3000U)
#define ITRC_OUT2_SEL1_IN6_SEL1_SHIFT            (12U)
/*! IN6_SEL1 - Selects Flash ECC mismatch event as a trigger source.
 */
#define ITRC_OUT2_SEL1_IN6_SEL1(x)               (((uint32_t)(((uint32_t)(x)) << ITRC_OUT2_SEL1_IN6_SEL1_SHIFT)) & ITRC_OUT2_SEL1_IN6_SEL1_MASK)

