RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define PKC_PKC_STATUS_zero_MASK                 (0x4U)
#define PKC_PKC_STATUS_zero_SHIFT                (2U)
/*! zero - Zero result flag: ZERO is set by the PKC at the end of a calculation in case the result
 *    of the calculation is equal zero. ZERO is updated for each PKC calculation mode, except for
 *    MUL1 (opcode 0x20) and MUL1_GF2 (opcode 0x24).
 */
#define PKC_PKC_STATUS_zero(x)                   (((uint32_t)(((uint32_t)(x)) << PKC_PKC_STATUS_zero_SHIFT)) & PKC_PKC_STATUS_zero_MASK)

#define PKC_PKC_STATUS_goany_MASK                (0x8U)
#define PKC_PKC_STATUS_goany_SHIFT               (3U)
/*! goany - Combined GO status flag: GOANY is set in case either PKC_CTRL.GOD1, GOD2, GOM1, GOM2 or
 *    GOU is set. The 1-to-0 transition of GOANY indicates that a calculation has been started and
 *    that a new GO bit can be set. If GOANY is cleared also all PKC_STATUS.LOCKED bits are cleared
 *    to indicate that the parameter set can be updated. GOANY is always '0' in case PKC_CTRL.RESET
 *    is set.
 */
#define PKC_PKC_STATUS_goany(x)                  (((uint32_t)(((uint32_t)(x)) << PKC_PKC_STATUS_goany_SHIFT)) & PKC_PKC_STATUS_goany_MASK)

#define PKC_PKC_STATUS_reserved4_MASK            (0x10U)
#define PKC_PKC_STATUS_reserved4_SHIFT           (4U)
/*! reserved4 - reserved
 */
#define PKC_PKC_STATUS_reserved4(x)              (((uint32_t)(((uint32_t)(x)) << PKC_PKC_STATUS_reserved4_SHIFT)) & PKC_PKC_STATUS_reserved4_MASK)

#define PKC_PKC_STATUS_locked_MASK               (0x60U)
#define PKC_PKC_STATUS_locked_SHIFT              (5U)
/*! locked - Parameter set locked: Indicates if parameter set is locked due to a pending calculation start or can be overwritten.
 */
#define PKC_PKC_STATUS_locked(x)                 (((uint32_t)(((uint32_t)(x)) << PKC_PKC_STATUS_locked_SHIFT)) & PKC_PKC_STATUS_locked_MASK)

#define PKC_PKC_STATUS_reserved31_MASK           (0xFFFFFF80U)
#define PKC_PKC_STATUS_reserved31_SHIFT          (7U)
/*! reserved31 - reserved
 */
#define PKC_PKC_STATUS_reserved31(x)             (((uint32_t)(((uint32_t)(x)) << PKC_PKC_STATUS_reserved31_SHIFT)) & PKC_PKC_STATUS_reserved31_MASK)
/*! @} */

/*! @name PKC_CTRL - Control register */
/*! @{ */

#define PKC_PKC_CTRL_reset_MASK                  (0x1U)
#define PKC_PKC_CTRL_reset_SHIFT                 (0U)
/*! reset - PKC reset control bit: RESET=1 enforces the PKC's reset state during which a calculation
 *    cannot be started and by which any ongoing calculation process is stopped. RESET can be
 *    set/cleared by the CPU in order to switch between PKC reset and calculation enable. RESET=1 is the
 *    default state after a chip reset.
 */
#define PKC_PKC_CTRL_reset(x)                    (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CTRL_reset_SHIFT)) & PKC_PKC_CTRL_reset_MASK)

#define PKC_PKC_CTRL_stop_MASK                   (0x2U)
#define PKC_PKC_CTRL_stop_SHIFT                  (1U)
/*! stop - Freeze PKC calculation: STOP=1 freezes all PKC activity incl. RAM accesses and reduces
 *    the PKC power consumption to its minimum. The difference compared to the reset of the PKC is
 *    that a stopped calculation can be continued when STOP is released (reset to '0') again. The
 *    status flags are not affected by the STOP control bit.
 */
#define PKC_PKC_CTRL_stop(x)                     (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CTRL_stop_SHIFT)) & PKC_PKC_CTRL_stop_MASK)

#define PKC_PKC_CTRL_god1_MASK                   (0x4U)
#define PKC_PKC_CTRL_god1_SHIFT                  (2U)
/*! god1 - Control bit to start direct operation using parameter set 1: If GOD1 is set PKC will
 *    start a direct / layer0 operation using parameter set 1 (PKC_MODE1, PKC_XYPTR1, PKC_ZRPTR1,
 *    PKC_LEN1).
 */
#define PKC_PKC_CTRL_god1(x)                     (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CTRL_god1_SHIFT)) & PKC_PKC_CTRL_god1_MASK)

#define PKC_PKC_CTRL_god2_MASK                   (0x8U)
#define PKC_PKC_CTRL_god2_SHIFT                  (3U)
/*! god2 - Control bit to start direct operation using parameter set 2: If GOD2 is set PKC will
 *    start a direct / layer0 operation using parameter set 2 (PKC_MODE2, PKC_XYPTR2, PKC_ZRPTR2,
 *    PKC_LEN2).
 */
#define PKC_PKC_CTRL_god2(x)                     (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CTRL_god2_SHIFT)) & PKC_PKC_CTRL_god2_MASK)

#define PKC_PKC_CTRL_gom1_MASK                   (0x10U)
#define PKC_PKC_CTRL_gom1_SHIFT                  (4U)
/*! gom1 - Control bit to start MC pattern using parameter set 1: If GOM1 is set PKC will start a MC
 *    pattern / layer1 operation using parameter set 1 (PKC_MODE1, PKC_XYPTR1, PKC_ZRPTR1,
 *    PKC_LEN1).
 */
#define PKC_PKC_CTRL_gom1(x)                     (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CTRL_gom1_SHIFT)) & PKC_PKC_CTRL_gom1_MASK)

#define PKC_PKC_CTRL_gom2_MASK                   (0x20U)
#define PKC_PKC_CTRL_gom2_SHIFT                  (5U)
/*! gom2 - Control bit to start MC pattern using parameter set 2: If GOM2 is set PKC will start a MC
 *    pattern / layer1 operation using parameter set 2 (PKC_MODE2, PKC_XYPTR2, PKC_ZRPTR2,
 *    PKC_LEN2).
 */
#define PKC_PKC_CTRL_gom2(x)                     (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CTRL_gom2_SHIFT)) & PKC_PKC_CTRL_gom2_MASK)

#define PKC_PKC_CTRL_gou_MASK                    (0x40U)
#define PKC_PKC_CTRL_gou_SHIFT                   (6U)
/*! gou - Control bit to start pipe operation: If GOU is set PKC will start the pipe / layer2
 *    operation (parameter fetch & calculation) described in section 'PKC Universal Pointer Fetch
 *    Operation'.
 */
#define PKC_PKC_CTRL_gou(x)                      (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CTRL_gou_SHIFT)) & PKC_PKC_CTRL_gou_MASK)

#define PKC_PKC_CTRL_gf2conv_MASK                (0x80U)
#define PKC_PKC_CTRL_gf2conv_SHIFT               (7U)
/*! gf2conv - Convert to GF2 calculation modes: If GF2CONV is set operations are mapped to their GF(2) equivalent operation modes.
 */
#define PKC_PKC_CTRL_gf2conv(x)                  (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CTRL_gf2conv_SHIFT)) & PKC_PKC_CTRL_gf2conv_MASK)

