RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define PKC_PKC_CTRL_clrcache_MASK               (0x100U)
#define PKC_PKC_CTRL_clrcache_SHIFT              (8U)
/*! clrcache - Clear universal pointer cache: Invalidates the cache such that all previously fetched
 *    parameters are withdrawn and have to be fetched again via DMA accesses.
 */
#define PKC_PKC_CTRL_clrcache(x)                 (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CTRL_clrcache_SHIFT)) & PKC_PKC_CTRL_clrcache_MASK)

#define PKC_PKC_CTRL_cache_en_MASK               (0x200U)
#define PKC_PKC_CTRL_cache_en_SHIFT              (9U)
/*! cache_en - Enable universal pointer cache: If CACHE_EN=1 the cache for the universal pointer
 *    parameters is enabled. In case a parameter value is found in the cache (from a previous fetch) no
 *    DMA access is triggered. As such the amount of DMA accesses for the parameter fetch vary
 *    between 0 and 4. To further optimize the cache utilization not used parameters, e.g. XPTR for a
 *    plain addition (opcode 0x0A), could be defined equal to a used one (e.g. equal YPTR or RPTR) or
 *    a previously fetched parameter.
 */
#define PKC_PKC_CTRL_cache_en(x)                 (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CTRL_cache_en_SHIFT)) & PKC_PKC_CTRL_cache_en_MASK)

#define PKC_PKC_CTRL_redmul_MASK                 (0xC00U)
#define PKC_PKC_CTRL_redmul_SHIFT                (10U)
/*! redmul - Reduced multiplier mode: REDMUL defines the operand width processed by the PKC coprocessor.
 *  0b00..full size mode, 3 least significant bits of pointer and length are ignored, minimum supported length 0x0008
 *  0b01..RFU Error Generated if selected
 *  0b10..64-bit mode, 3 least significant bits of pointer and length are ignored, minimum supported length 0x0008
 *  0b11..RFU Error Generated if selected
 */
#define PKC_PKC_CTRL_redmul(x)                   (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CTRL_redmul_SHIFT)) & PKC_PKC_CTRL_redmul_MASK)

#define PKC_PKC_CTRL_reserved31_MASK             (0xFFFFF000U)
#define PKC_PKC_CTRL_reserved31_SHIFT            (12U)
/*! reserved31 - reserved
 */
#define PKC_PKC_CTRL_reserved31(x)               (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CTRL_reserved31_SHIFT)) & PKC_PKC_CTRL_reserved31_MASK)
/*! @} */

/*! @name PKC_CFG - Configuration register */
/*! @{ */

#define PKC_PKC_CFG_idleop_MASK                  (0x1U)
#define PKC_PKC_CFG_idleop_SHIFT                 (0U)
/*! idleop - Idle operation feature not available in this version (flag is don't care).
 */
#define PKC_PKC_CFG_idleop(x)                    (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CFG_idleop_SHIFT)) & PKC_PKC_CFG_idleop_MASK)

#define PKC_PKC_CFG_rfu1_MASK                    (0x2U)
#define PKC_PKC_CFG_rfu1_SHIFT                   (1U)
/*! rfu1 - RFU
 */
#define PKC_PKC_CFG_rfu1(x)                      (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CFG_rfu1_SHIFT)) & PKC_PKC_CFG_rfu1_MASK)

#define PKC_PKC_CFG_rfu2_MASK                    (0x4U)
#define PKC_PKC_CFG_rfu2_SHIFT                   (2U)
/*! rfu2 - RFU
 */
#define PKC_PKC_CFG_rfu2(x)                      (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CFG_rfu2_SHIFT)) & PKC_PKC_CFG_rfu2_MASK)

#define PKC_PKC_CFG_clkrnd_MASK                  (0x8U)
#define PKC_PKC_CFG_clkrnd_SHIFT                 (3U)
/*! clkrnd - Clock randomization feature not available in this version (flag is don't care).
 */
#define PKC_PKC_CFG_clkrnd(x)                    (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CFG_clkrnd_SHIFT)) & PKC_PKC_CFG_clkrnd_MASK)

#define PKC_PKC_CFG_redmulnoise_MASK             (0x10U)
#define PKC_PKC_CFG_redmulnoise_SHIFT            (4U)
/*! redmulnoise - Noise in reduced multiplier mode feature not available in this version (flag is don't care).
 */
#define PKC_PKC_CFG_redmulnoise(x)               (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CFG_redmulnoise_SHIFT)) & PKC_PKC_CFG_redmulnoise_MASK)

#define PKC_PKC_CFG_rnddly_MASK                  (0xE0U)
#define PKC_PKC_CFG_rnddly_SHIFT                 (5U)
/*! rnddly - Random delay feature not available in this version (flag is don't care).
 */
#define PKC_PKC_CFG_rnddly(x)                    (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CFG_rnddly_SHIFT)) & PKC_PKC_CFG_rnddly_MASK)

#define PKC_PKC_CFG_sbxnoise_MASK                (0x100U)
#define PKC_PKC_CFG_sbxnoise_SHIFT               (8U)
/*! sbxnoise - Noise feature not available in this version (flag is don't care).
 */
#define PKC_PKC_CFG_sbxnoise(x)                  (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CFG_sbxnoise_SHIFT)) & PKC_PKC_CFG_sbxnoise_MASK)

#define PKC_PKC_CFG_alpnoise_MASK                (0x200U)
#define PKC_PKC_CFG_alpnoise_SHIFT               (9U)
/*! alpnoise - Noise feature not available in this version (flag is don't care).
 */
#define PKC_PKC_CFG_alpnoise(x)                  (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CFG_alpnoise_SHIFT)) & PKC_PKC_CFG_alpnoise_MASK)

#define PKC_PKC_CFG_fmulnoise_MASK               (0x400U)
#define PKC_PKC_CFG_fmulnoise_SHIFT              (10U)
/*! fmulnoise - Noise feature not available in this version (flag is don't care).
 */
#define PKC_PKC_CFG_fmulnoise(x)                 (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CFG_fmulnoise_SHIFT)) & PKC_PKC_CFG_fmulnoise_MASK)

#define PKC_PKC_CFG_reserved31_MASK              (0xFFFFF800U)
#define PKC_PKC_CFG_reserved31_SHIFT             (11U)
/*! reserved31 - reserved
 */
#define PKC_PKC_CFG_reserved31(x)                (((uint32_t)(((uint32_t)(x)) << PKC_PKC_CFG_reserved31_SHIFT)) & PKC_PKC_CFG_reserved31_MASK)
/*! @} */

/*! @name PKC_MODE1 - Mode register, parameter set 1 */
/*! @{ */

#define PKC_PKC_MODE1_mode_MASK                  (0xFFU)
#define PKC_PKC_MODE1_mode_SHIFT                 (0U)
/*! mode - Calculation Mode / MC Start address:
 */
#define PKC_PKC_MODE1_mode(x)                    (((uint32_t)(((uint32_t)(x)) << PKC_PKC_MODE1_mode_SHIFT)) & PKC_PKC_MODE1_mode_MASK)

#define PKC_PKC_MODE1_reserved31_MASK            (0xFFFFFF00U)
#define PKC_PKC_MODE1_reserved31_SHIFT           (8U)
/*! reserved31 - reserved
 */
#define PKC_PKC_MODE1_reserved31(x)              (((uint32_t)(((uint32_t)(x)) << PKC_PKC_MODE1_reserved31_SHIFT)) & PKC_PKC_MODE1_reserved31_MASK)
/*! @} */

/*! @name PKC_XYPTR1 - X+Y pointer register, parameter set 1 */
/*! @{ */

