RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define PKC_PKC_XYPTR1_xptr_MASK                 (0xFFFFU)
#define PKC_PKC_XYPTR1_xptr_SHIFT                (0U)
/*! xptr - Start address of X operand in PKCRAM with byte granularity: Least significant bits are
 *    ignored depending on PKC_CTRL.REDMUL setting. Most significant bits are ignored depending on
 *    available PKCRAM size.
 */
#define PKC_PKC_XYPTR1_xptr(x)                   (((uint32_t)(((uint32_t)(x)) << PKC_PKC_XYPTR1_xptr_SHIFT)) & PKC_PKC_XYPTR1_xptr_MASK)

#define PKC_PKC_XYPTR1_yptr_MASK                 (0xFFFF0000U)
#define PKC_PKC_XYPTR1_yptr_SHIFT                (16U)
/*! yptr - Start address of Y operand in PKCRAM with byte granularity: Least significant bits are
 *    ignored depending on PKC_CTRL.REDMUL setting. Most significant bits are ignored depending on
 *    available PKCRAM size.
 */
#define PKC_PKC_XYPTR1_yptr(x)                   (((uint32_t)(((uint32_t)(x)) << PKC_PKC_XYPTR1_yptr_SHIFT)) & PKC_PKC_XYPTR1_yptr_MASK)
/*! @} */

/*! @name PKC_ZRPTR1 - Z+R pointer register, parameter set 1 */
/*! @{ */

#define PKC_PKC_ZRPTR1_zptr_MASK                 (0xFFFFU)
#define PKC_PKC_ZRPTR1_zptr_SHIFT                (0U)
/*! zptr - Start address of Z operand in PKCRAM with byte granularity or constant for calculation modes using CONST:
 */
#define PKC_PKC_ZRPTR1_zptr(x)                   (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ZRPTR1_zptr_SHIFT)) & PKC_PKC_ZRPTR1_zptr_MASK)

#define PKC_PKC_ZRPTR1_rptr_MASK                 (0xFFFF0000U)
#define PKC_PKC_ZRPTR1_rptr_SHIFT                (16U)
/*! rptr - Start address of R result in PKCRAM with byte granularity: Least significant bits are
 *    ignored depending on PKC_CTRL.REDMUL setting. Most significant bits are ignored depending on
 *    available PKCRAM size.
 */
#define PKC_PKC_ZRPTR1_rptr(x)                   (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ZRPTR1_rptr_SHIFT)) & PKC_PKC_ZRPTR1_rptr_MASK)
/*! @} */

/*! @name PKC_LEN1 - Length register, parameter set 1 */
/*! @{ */

#define PKC_PKC_LEN1_len_MASK                    (0xFFFFU)
#define PKC_PKC_LEN1_len_SHIFT                   (0U)
/*! len - Operand length: LEN defines the length of the operands and the result in bytes. The length
 *    of Y, Z and R depend furthermore on the selected calculation mode.
 */
#define PKC_PKC_LEN1_len(x)                      (((uint32_t)(((uint32_t)(x)) << PKC_PKC_LEN1_len_SHIFT)) & PKC_PKC_LEN1_len_MASK)

#define PKC_PKC_LEN1_mclen_MASK                  (0xFFFF0000U)
#define PKC_PKC_LEN1_mclen_SHIFT                 (16U)
/*! mclen - Loop counter for microcode pattern: MCLEN defines the length of the loop counter that
 *    can be used in layer1 calculation mode, e.g. in MC opcode DecrTBNZ. For the hardcoded MC
 *    patterns Modular Multiplication (MC start address 0x00), Plain Multiplication (0x13), Plain
 *    Multiplication with Addition (0x1D) and Modular Reduction (0x33) MCLEN defines the length of the X
 *    operand in bytes.
 */
#define PKC_PKC_LEN1_mclen(x)                    (((uint32_t)(((uint32_t)(x)) << PKC_PKC_LEN1_mclen_SHIFT)) & PKC_PKC_LEN1_mclen_MASK)
/*! @} */

/*! @name PKC_MODE2 - Mode register, parameter set 2 */
/*! @{ */

#define PKC_PKC_MODE2_mode_MASK                  (0xFFU)
#define PKC_PKC_MODE2_mode_SHIFT                 (0U)
/*! mode - Calculation Mode / MC Start address:
 */
#define PKC_PKC_MODE2_mode(x)                    (((uint32_t)(((uint32_t)(x)) << PKC_PKC_MODE2_mode_SHIFT)) & PKC_PKC_MODE2_mode_MASK)

#define PKC_PKC_MODE2_reserved31_MASK            (0xFFFFFF00U)
#define PKC_PKC_MODE2_reserved31_SHIFT           (8U)
/*! reserved31 - reserved
 */
#define PKC_PKC_MODE2_reserved31(x)              (((uint32_t)(((uint32_t)(x)) << PKC_PKC_MODE2_reserved31_SHIFT)) & PKC_PKC_MODE2_reserved31_MASK)
/*! @} */

/*! @name PKC_XYPTR2 - X+Y pointer register, parameter set 2 */
/*! @{ */

#define PKC_PKC_XYPTR2_xptr_MASK                 (0xFFFFU)
#define PKC_PKC_XYPTR2_xptr_SHIFT                (0U)
/*! xptr - Start address of X operand in PKCRAM with byte granularity: Least significant bits are
 *    ignored depending on PKC_CTRL.REDMUL setting. Most significant bits are ignored depending on
 *    available PKCRAM size.
 */
#define PKC_PKC_XYPTR2_xptr(x)                   (((uint32_t)(((uint32_t)(x)) << PKC_PKC_XYPTR2_xptr_SHIFT)) & PKC_PKC_XYPTR2_xptr_MASK)

#define PKC_PKC_XYPTR2_yptr_MASK                 (0xFFFF0000U)
#define PKC_PKC_XYPTR2_yptr_SHIFT                (16U)
/*! yptr - Start address of Y operand in PKCRAM with byte granularity: Least significant bits are
 *    ignored depending on PKC_CTRL.REDMUL setting. Most significant bits are ignored depending on
 *    available PKCRAM size.
 */
#define PKC_PKC_XYPTR2_yptr(x)                   (((uint32_t)(((uint32_t)(x)) << PKC_PKC_XYPTR2_yptr_SHIFT)) & PKC_PKC_XYPTR2_yptr_MASK)
/*! @} */

/*! @name PKC_ZRPTR2 - Z+R pointer register, parameter set 2 */
/*! @{ */

#define PKC_PKC_ZRPTR2_zptr_MASK                 (0xFFFFU)
#define PKC_PKC_ZRPTR2_zptr_SHIFT                (0U)
/*! zptr - Start address of Z operand in PKCRAM with byte granularity or constant for calculation modes using CONST:
 */
#define PKC_PKC_ZRPTR2_zptr(x)                   (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ZRPTR2_zptr_SHIFT)) & PKC_PKC_ZRPTR2_zptr_MASK)

#define PKC_PKC_ZRPTR2_rptr_MASK                 (0xFFFF0000U)
#define PKC_PKC_ZRPTR2_rptr_SHIFT                (16U)
/*! rptr - Start address of R result in PKCRAM with byte granularity: Least significant bits are
 *    ignored depending on PKC_CTRL.REDMUL setting. Most significant bits are ignored depending on
 *    available PKCRAM size.
 */
#define PKC_PKC_ZRPTR2_rptr(x)                   (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ZRPTR2_rptr_SHIFT)) & PKC_PKC_ZRPTR2_rptr_MASK)
/*! @} */

/*! @name PKC_LEN2 - Length register, parameter set 2 */
/*! @{ */

#define PKC_PKC_LEN2_len_MASK                    (0xFFFFU)
#define PKC_PKC_LEN2_len_SHIFT                   (0U)
/*! len - Operand length: LEN defines the length of the operands and the result in bytes. The length
 *    of Y, Z and R depend furthermore on the selected calculation mode.
 */
#define PKC_PKC_LEN2_len(x)                      (((uint32_t)(((uint32_t)(x)) << PKC_PKC_LEN2_len_SHIFT)) & PKC_PKC_LEN2_len_MASK)

#define PKC_PKC_LEN2_mclen_MASK                  (0xFFFF0000U)
#define PKC_PKC_LEN2_mclen_SHIFT                 (16U)
/*! mclen - Loop counter for microcode pattern: MCLEN defines the length of the loop counter that
 *    can be used in layer1 calculation mode, e.g. in MC opcode DecrTBNZ. For the hardcoded MC
 *    patterns Modular Multiplication (MC start address 0x00)
 */
#define PKC_PKC_LEN2_mclen(x)                    (((uint32_t)(((uint32_t)(x)) << PKC_PKC_LEN2_mclen_SHIFT)) & PKC_PKC_LEN2_mclen_MASK)
/*! @} */

