RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
/*! @name PKC_UPTR - Universal pointer FUP program */
/*! @{ */

#define PKC_PKC_UPTR_ptr_MASK                    (0xFFFFFFFFU)
#define PKC_PKC_UPTR_ptr_SHIFT                   (0U)
/*! ptr - Pointer to start address of PKC FUP program: PKC_UPTR needs to be defined before starting
 *    a universal pointer PKC calculation (layer2) via PKC_CTRL.GOU. The pointer address needs to be
 *    valid and the memory space the pointer addresses needs to be enabled for PKC access by the
 *    system. Otherwise a security alarm is triggered (PKC_ACCESS_ERR.AHB is set).
 */
#define PKC_PKC_UPTR_ptr(x)                      (((uint32_t)(((uint32_t)(x)) << PKC_PKC_UPTR_ptr_SHIFT)) & PKC_PKC_UPTR_ptr_MASK)
/*! @} */

/*! @name PKC_UPTRT - Universal pointer FUP table */
/*! @{ */

#define PKC_PKC_UPTRT_ptr_MASK                   (0xFFFFFFFFU)
#define PKC_PKC_UPTRT_ptr_SHIFT                  (0U)
/*! ptr - Pointer to start address of PKC FUP table: PKC_UPTRT needs to be defined before starting a
 *    universal pointer PKC calculation (layer2) via PKC_CTRL.GOU. The pointer address needs to be
 *    valid and the memory space the pointer addresses needs to be enabled for PKC access by the
 *    system. Otherwise a security alarm is triggered (PKC_ACCESS_ERR.AHB is set).
 */
#define PKC_PKC_UPTRT_ptr(x)                     (((uint32_t)(((uint32_t)(x)) << PKC_PKC_UPTRT_ptr_SHIFT)) & PKC_PKC_UPTRT_ptr_MASK)
/*! @} */

/*! @name PKC_ULEN - Universal pointer length */
/*! @{ */

#define PKC_PKC_ULEN_len_MASK                    (0xFFU)
#define PKC_PKC_ULEN_len_SHIFT                   (0U)
/*! len - Length of universal pointer calculation: PKC_ULEN defines how many FUP program entries
 *    shall be processed for one layer2 calculation started via PKC_CTRL.GOU. The FUP program entries
 *    include layer0 calculations, layer1 calculations and CRC entries for FUP program integrity
 *    protection.
 */
#define PKC_PKC_ULEN_len(x)                      (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ULEN_len_SHIFT)) & PKC_PKC_ULEN_len_MASK)

#define PKC_PKC_ULEN_reserved31_MASK             (0xFFFFFF00U)
#define PKC_PKC_ULEN_reserved31_SHIFT            (8U)
/*! reserved31 - reserved
 */
#define PKC_PKC_ULEN_reserved31(x)               (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ULEN_reserved31_SHIFT)) & PKC_PKC_ULEN_reserved31_MASK)
/*! @} */

/*! @name PKC_MCDATA - MC pattern data interface */
/*! @{ */

#define PKC_PKC_MCDATA_mcdata_MASK               (0xFFFFFFFFU)
#define PKC_PKC_MCDATA_mcdata_SHIFT              (0U)
/*! mcdata - Microcode read/write data: This IP version does not support flexible MC patterns (only
 *    hard coded ones). Any read or write access to PKC_MCDATA triggers a security alarm
 *    (PKC_ACCESS_ERR.CTRL is set).
 */
#define PKC_PKC_MCDATA_mcdata(x)                 (((uint32_t)(((uint32_t)(x)) << PKC_PKC_MCDATA_mcdata_SHIFT)) & PKC_PKC_MCDATA_mcdata_MASK)
/*! @} */

/*! @name PKC_VERSION - PKC version register */
/*! @{ */

#define PKC_PKC_VERSION_mulsize_MASK             (0x3U)
#define PKC_PKC_VERSION_mulsize_SHIFT            (0U)
/*! mulsize - native multiplier size and operand granularity
 *  0b01..32-bit multiplier
 *  0b10..64-bit multiplier
 *  0b11..128-bit multiplier
 */
#define PKC_PKC_VERSION_mulsize(x)               (((uint32_t)(((uint32_t)(x)) << PKC_PKC_VERSION_mulsize_SHIFT)) & PKC_PKC_VERSION_mulsize_MASK)

#define PKC_PKC_VERSION_mcavail_MASK             (0x4U)
#define PKC_PKC_VERSION_mcavail_SHIFT            (2U)
/*! mcavail - MC feature (layer1 calculation) is available
 */
#define PKC_PKC_VERSION_mcavail(x)               (((uint32_t)(((uint32_t)(x)) << PKC_PKC_VERSION_mcavail_SHIFT)) & PKC_PKC_VERSION_mcavail_MASK)

#define PKC_PKC_VERSION_upavail_MASK             (0x8U)
#define PKC_PKC_VERSION_upavail_SHIFT            (3U)
/*! upavail - UP feature (layer2 calculation) is available
 */
#define PKC_PKC_VERSION_upavail(x)               (((uint32_t)(((uint32_t)(x)) << PKC_PKC_VERSION_upavail_SHIFT)) & PKC_PKC_VERSION_upavail_MASK)

#define PKC_PKC_VERSION_upcacheavail_MASK        (0x10U)
#define PKC_PKC_VERSION_upcacheavail_SHIFT       (4U)
/*! upcacheavail - UP cache is available
 */
#define PKC_PKC_VERSION_upcacheavail(x)          (((uint32_t)(((uint32_t)(x)) << PKC_PKC_VERSION_upcacheavail_SHIFT)) & PKC_PKC_VERSION_upcacheavail_MASK)

#define PKC_PKC_VERSION_gf2avail_MASK            (0x20U)
#define PKC_PKC_VERSION_gf2avail_SHIFT           (5U)
/*! gf2avail - GF2 calculation modes are available
 */
#define PKC_PKC_VERSION_gf2avail(x)              (((uint32_t)(((uint32_t)(x)) << PKC_PKC_VERSION_gf2avail_SHIFT)) & PKC_PKC_VERSION_gf2avail_MASK)

#define PKC_PKC_VERSION_paramnum_MASK            (0xC0U)
#define PKC_PKC_VERSION_paramnum_SHIFT           (6U)
/*! paramnum - Number of parameter sets for real calculation
 */
#define PKC_PKC_VERSION_paramnum(x)              (((uint32_t)(((uint32_t)(x)) << PKC_PKC_VERSION_paramnum_SHIFT)) & PKC_PKC_VERSION_paramnum_MASK)

#define PKC_PKC_VERSION_sbx0avail_MASK           (0x100U)
#define PKC_PKC_VERSION_sbx0avail_SHIFT          (8U)
/*! sbx0avail - SBX0 operation is available
 */
#define PKC_PKC_VERSION_sbx0avail(x)             (((uint32_t)(((uint32_t)(x)) << PKC_PKC_VERSION_sbx0avail_SHIFT)) & PKC_PKC_VERSION_sbx0avail_MASK)

#define PKC_PKC_VERSION_sbx1avail_MASK           (0x200U)
#define PKC_PKC_VERSION_sbx1avail_SHIFT          (9U)
/*! sbx1avail - SBX1 operation is available
 */
#define PKC_PKC_VERSION_sbx1avail(x)             (((uint32_t)(((uint32_t)(x)) << PKC_PKC_VERSION_sbx1avail_SHIFT)) & PKC_PKC_VERSION_sbx1avail_MASK)

#define PKC_PKC_VERSION_sbx2avail_MASK           (0x400U)
#define PKC_PKC_VERSION_sbx2avail_SHIFT          (10U)
/*! sbx2avail - SBX2 operation is available
 */
#define PKC_PKC_VERSION_sbx2avail(x)             (((uint32_t)(((uint32_t)(x)) << PKC_PKC_VERSION_sbx2avail_SHIFT)) & PKC_PKC_VERSION_sbx2avail_MASK)

#define PKC_PKC_VERSION_sbx3avail_MASK           (0x800U)
#define PKC_PKC_VERSION_sbx3avail_SHIFT          (11U)
/*! sbx3avail - SBX3 operation is available
 */
#define PKC_PKC_VERSION_sbx3avail(x)             (((uint32_t)(((uint32_t)(x)) << PKC_PKC_VERSION_sbx3avail_SHIFT)) & PKC_PKC_VERSION_sbx3avail_MASK)

#define PKC_PKC_VERSION_mcreconf_size_MASK       (0xFF000U)
#define PKC_PKC_VERSION_mcreconf_size_SHIFT      (12U)
/*! mcreconf_size - Size of reconfigurable MC table in bytes
 */
#define PKC_PKC_VERSION_mcreconf_size(x)         (((uint32_t)(((uint32_t)(x)) << PKC_PKC_VERSION_mcreconf_size_SHIFT)) & PKC_PKC_VERSION_mcreconf_size_MASK)

#define PKC_PKC_VERSION_reserved31_MASK          (0xFFF00000U)
#define PKC_PKC_VERSION_reserved31_SHIFT         (20U)
/*! reserved31 - reserved
 */
#define PKC_PKC_VERSION_reserved31(x)            (((uint32_t)(((uint32_t)(x)) << PKC_PKC_VERSION_reserved31_SHIFT)) & PKC_PKC_VERSION_reserved31_MASK)
/*! @} */

/*! @name PKC_SOFT_RST - Software reset */
/*! @{ */

