RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define PKC_PKC_SOFT_RST_soft_rst_MASK           (0x1U)
#define PKC_PKC_SOFT_RST_soft_rst_SHIFT          (0U)
/*! soft_rst - Write 1 to reset module (0 has no effect). All running and pending PKC calculation
 *    are stopped. All PKC SFRs are reset except PKC_ACCESS_ERR.
 */
#define PKC_PKC_SOFT_RST_soft_rst(x)             (((uint32_t)(((uint32_t)(x)) << PKC_PKC_SOFT_RST_soft_rst_SHIFT)) & PKC_PKC_SOFT_RST_soft_rst_MASK)

#define PKC_PKC_SOFT_RST_reserved31_MASK         (0xFFFFFFFEU)
#define PKC_PKC_SOFT_RST_reserved31_SHIFT        (1U)
/*! reserved31 - reserved
 */
#define PKC_PKC_SOFT_RST_reserved31(x)           (((uint32_t)(((uint32_t)(x)) << PKC_PKC_SOFT_RST_reserved31_SHIFT)) & PKC_PKC_SOFT_RST_reserved31_MASK)
/*! @} */

/*! @name PKC_ACCESS_ERR - Access Error */
/*! @{ */

#define PKC_PKC_ACCESS_ERR_apb_notav_MASK        (0x1U)
#define PKC_PKC_ACCESS_ERR_apb_notav_SHIFT       (0U)
/*! apb_notav - APB Error: address not available
 */
#define PKC_PKC_ACCESS_ERR_apb_notav(x)          (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_apb_notav_SHIFT)) & PKC_PKC_ACCESS_ERR_apb_notav_MASK)

#define PKC_PKC_ACCESS_ERR_apb_wrgmd_MASK        (0x2U)
#define PKC_PKC_ACCESS_ERR_apb_wrgmd_SHIFT       (1U)
/*! apb_wrgmd - APB Error: Wrong access mode
 */
#define PKC_PKC_ACCESS_ERR_apb_wrgmd(x)          (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_apb_wrgmd_SHIFT)) & PKC_PKC_ACCESS_ERR_apb_wrgmd_MASK)

#define PKC_PKC_ACCESS_ERR_reserved3_MASK        (0xCU)
#define PKC_PKC_ACCESS_ERR_reserved3_SHIFT       (2U)
/*! reserved3 - reserved for future erors on APB I/F
 */
#define PKC_PKC_ACCESS_ERR_reserved3(x)          (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_reserved3_SHIFT)) & PKC_PKC_ACCESS_ERR_reserved3_MASK)

#define PKC_PKC_ACCESS_ERR_apb_master_MASK       (0xF0U)
#define PKC_PKC_ACCESS_ERR_apb_master_SHIFT      (4U)
/*! apb_master - APB Master that triggered first APB error (APB_WRGMD or APB_NOTAV)
 */
#define PKC_PKC_ACCESS_ERR_apb_master(x)         (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_apb_master_SHIFT)) & PKC_PKC_ACCESS_ERR_apb_master_MASK)

#define PKC_PKC_ACCESS_ERR_reserved9_MASK        (0x300U)
#define PKC_PKC_ACCESS_ERR_reserved9_SHIFT       (8U)
/*! reserved9 - reserved for future erors on AHB I/F Layer2 Only
 */
#define PKC_PKC_ACCESS_ERR_reserved9(x)          (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_reserved9_SHIFT)) & PKC_PKC_ACCESS_ERR_reserved9_MASK)

#define PKC_PKC_ACCESS_ERR_ahb_MASK              (0x400U)
#define PKC_PKC_ACCESS_ERR_ahb_SHIFT             (10U)
/*! ahb - AHB Error: invalid AHB access Layer2 Only
 */
#define PKC_PKC_ACCESS_ERR_ahb(x)                (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_ahb_SHIFT)) & PKC_PKC_ACCESS_ERR_ahb_MASK)

#define PKC_PKC_ACCESS_ERR_reserved15_MASK       (0xF800U)
#define PKC_PKC_ACCESS_ERR_reserved15_SHIFT      (11U)
/*! reserved15 - reserved for future erors on AHB I/F Layer2 Only
 */
#define PKC_PKC_ACCESS_ERR_reserved15(x)         (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_reserved15_SHIFT)) & PKC_PKC_ACCESS_ERR_reserved15_MASK)

#define PKC_PKC_ACCESS_ERR_pkcc_MASK             (0x10000U)
#define PKC_PKC_ACCESS_ERR_pkcc_SHIFT            (16U)
/*! pkcc - Error in PKC coprocessor kernel
 */
#define PKC_PKC_ACCESS_ERR_pkcc(x)               (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_pkcc_SHIFT)) & PKC_PKC_ACCESS_ERR_pkcc_MASK)

#define PKC_PKC_ACCESS_ERR_fdet_MASK             (0x20000U)
#define PKC_PKC_ACCESS_ERR_fdet_SHIFT            (17U)
/*! fdet - Error due to error detection circuitry
 */
#define PKC_PKC_ACCESS_ERR_fdet(x)               (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_fdet_SHIFT)) & PKC_PKC_ACCESS_ERR_fdet_MASK)

#define PKC_PKC_ACCESS_ERR_ctrl_MASK             (0x40000U)
#define PKC_PKC_ACCESS_ERR_ctrl_SHIFT            (18U)
/*! ctrl - Error in PKC software control
 */
#define PKC_PKC_ACCESS_ERR_ctrl(x)               (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_ctrl_SHIFT)) & PKC_PKC_ACCESS_ERR_ctrl_MASK)

#define PKC_PKC_ACCESS_ERR_ucrc_MASK             (0x80000U)
#define PKC_PKC_ACCESS_ERR_ucrc_SHIFT            (19U)
/*! ucrc - Error in layer2 CRC check
 */
#define PKC_PKC_ACCESS_ERR_ucrc(x)               (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_ucrc_SHIFT)) & PKC_PKC_ACCESS_ERR_ucrc_MASK)

#define PKC_PKC_ACCESS_ERR_reserved20_MASK       (0x100000U)
#define PKC_PKC_ACCESS_ERR_reserved20_SHIFT      (20U)
/*! reserved20 - reserved
 */
#define PKC_PKC_ACCESS_ERR_reserved20(x)         (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_reserved20_SHIFT)) & PKC_PKC_ACCESS_ERR_reserved20_MASK)

#define PKC_PKC_ACCESS_ERR_reserved31_MASK       (0xFFE00000U)
#define PKC_PKC_ACCESS_ERR_reserved31_SHIFT      (21U)
/*! reserved31 - reserved for more block errors
 */
#define PKC_PKC_ACCESS_ERR_reserved31(x)         (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_reserved31_SHIFT)) & PKC_PKC_ACCESS_ERR_reserved31_MASK)
/*! @} */

/*! @name PKC_ACCESS_ERR_CLR - Clear Access Error */
/*! @{ */

#define PKC_PKC_ACCESS_ERR_CLR_err_clr_MASK      (0x1U)
#define PKC_PKC_ACCESS_ERR_CLR_err_clr_SHIFT     (0U)
/*! err_clr - Write 1 to reset PKC_ACCESS_ERR SFR.
 */
#define PKC_PKC_ACCESS_ERR_CLR_err_clr(x)        (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_CLR_err_clr_SHIFT)) & PKC_PKC_ACCESS_ERR_CLR_err_clr_MASK)

#define PKC_PKC_ACCESS_ERR_CLR_reserved31_MASK   (0xFFFFFFFEU)
#define PKC_PKC_ACCESS_ERR_CLR_reserved31_SHIFT  (1U)
/*! reserved31 - reserved
 */
#define PKC_PKC_ACCESS_ERR_CLR_reserved31(x)     (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_CLR_reserved31_SHIFT)) & PKC_PKC_ACCESS_ERR_CLR_reserved31_MASK)
/*! @} */

/*! @name PKC_INT_CLR_ENABLE - Interrupt enable clear */
/*! @{ */

#define PKC_PKC_INT_CLR_ENABLE_en_pdone_MASK     (0x1U)
#define PKC_PKC_INT_CLR_ENABLE_en_pdone_SHIFT    (0U)
/*! en_pdone - Write to clear PDONE interrupt enable flag (PKC_INT_ENABLE.EN_PDONE=0).
 */
#define PKC_PKC_INT_CLR_ENABLE_en_pdone(x)       (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_CLR_ENABLE_en_pdone_SHIFT)) & PKC_PKC_INT_CLR_ENABLE_en_pdone_MASK)

