RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
/*! @name PKC_MODULE_ID - Module ID */
/*! @{ */

#define PKC_PKC_MODULE_ID_size_MASK              (0xFFU)
#define PKC_PKC_MODULE_ID_size_SHIFT             (0U)
/*! size - Address space of the IP
 */
#define PKC_PKC_MODULE_ID_size(x)                (((uint32_t)(((uint32_t)(x)) << PKC_PKC_MODULE_ID_size_SHIFT)) & PKC_PKC_MODULE_ID_size_MASK)

#define PKC_PKC_MODULE_ID_minor_rev_MASK         (0xF00U)
#define PKC_PKC_MODULE_ID_minor_rev_SHIFT        (8U)
/*! minor_rev - Minor revision
 */
#define PKC_PKC_MODULE_ID_minor_rev(x)           (((uint32_t)(((uint32_t)(x)) << PKC_PKC_MODULE_ID_minor_rev_SHIFT)) & PKC_PKC_MODULE_ID_minor_rev_MASK)

#define PKC_PKC_MODULE_ID_major_rev_MASK         (0xF000U)
#define PKC_PKC_MODULE_ID_major_rev_SHIFT        (12U)
/*! major_rev - Major revision
 */
#define PKC_PKC_MODULE_ID_major_rev(x)           (((uint32_t)(((uint32_t)(x)) << PKC_PKC_MODULE_ID_major_rev_SHIFT)) & PKC_PKC_MODULE_ID_major_rev_MASK)

#define PKC_PKC_MODULE_ID_id_MASK                (0xFFFF0000U)
#define PKC_PKC_MODULE_ID_id_SHIFT               (16U)
/*! id - Module ID
 */
#define PKC_PKC_MODULE_ID_id(x)                  (((uint32_t)(((uint32_t)(x)) << PKC_PKC_MODULE_ID_id_SHIFT)) & PKC_PKC_MODULE_ID_id_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group PKC_Register_Masks */


/* PKC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral PKC base address */
  #define PKC_BASE                                 (0x5002F000u)
  /** Peripheral PKC base address */
  #define PKC_BASE_NS                              (0x4002F000u)
  /** Peripheral PKC base pointer */
  #define PKC                                      ((PKC_Type *)PKC_BASE)
  /** Peripheral PKC base pointer */
  #define PKC_NS                                   ((PKC_Type *)PKC_BASE_NS)
  /** Array initializer of PKC peripheral base addresses */
  #define PKC_BASE_ADDRS                           { PKC_BASE }
  /** Array initializer of PKC peripheral base pointers */
  #define PKC_BASE_PTRS                            { PKC }
  /** Array initializer of PKC peripheral base addresses */
  #define PKC_BASE_ADDRS_NS                        { PKC_BASE_NS }
  /** Array initializer of PKC peripheral base pointers */
  #define PKC_BASE_PTRS_NS                         { PKC_NS }
#else
  /** Peripheral PKC base address */
  #define PKC_BASE                                 (0x4002F000u)
  /** Peripheral PKC base pointer */
  #define PKC                                      ((PKC_Type *)PKC_BASE)
  /** Array initializer of PKC peripheral base addresses */
  #define PKC_BASE_ADDRS                           { PKC_BASE }
  /** Array initializer of PKC peripheral base pointers */
  #define PKC_BASE_PTRS                            { PKC }
#endif

/*!
 * @}
 */ /* end of group PKC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PMC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PMC_Peripheral_Access_Layer PMC Peripheral Access Layer
 * @{
 */

/** PMC - Register Layout Typedef */
typedef struct {
  __IO uint32_t CTRL;                              /**< Power Management Control [Reset by: PoR, Pin Reset, Software Reset and BoDs reset], offset: 0x0 */
  __I  uint32_t STATUS;                            /**< Power Management Controller FSM (Finite State Machines) status, offset: 0x4 */
  __IO uint32_t RESETCTRL;                         /**< Reset Control, offset: 0x8 */
  __IO uint32_t RESETCAUSE;                        /**< Reset Cause, offset: 0xC */
  __IO uint32_t DCDC0;                             /**< DCDC (first) control, offset: 0x10 */
  __IO uint32_t DCDC1;                             /**< DCDC (second) control register [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset], offset: 0x14 */
       uint8_t RESERVED_0[4];
  __IO uint32_t LDOPMU;                            /**< Power Management Unit (PMU) and Always-On domains LDO control [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset], offset: 0x1C */
  __IO uint32_t LDOMEM;                            /**< Memories LDO control register [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset], offset: 0x20 */
  __IO uint32_t LDOCORE0;                          /**< LDO CORE (first) control register [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset], offset: 0x24 */
  __IO uint32_t LDOFLASHNV;                        /**< Flash High Voltage LDO control register [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset], offset: 0x28 */
  __IO uint32_t LDOEFUSEPROG;                      /**< eFUSE (One Time Programmable Memory) Programming LDO control register [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset], offset: 0x2C */
  __IO uint32_t BODVDDMAIN;                        /**< VDDMAIN Brown Out Dectector control, offset: 0x30 */
       uint8_t RESERVED_1[4];
  __IO uint32_t BODCORE;                           /**< Digital Core logic Brown Out Dectector control register [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset], offset: 0x38 */
       uint8_t RESERVED_2[4];
  __IO uint32_t REFFASTWKUP;                       /**< Analog References fast wake-up Control register [Reset by: PoR], offset: 0x40 */
       uint8_t RESERVED_3[8];
  __IO uint32_t XTAL32K;                           /**< 32 KHz Crystal oscillator (XTAL) control register [Reset by: PoR, Brown Out Detectors Reset], offset: 0x4C */
  __IO uint32_t COMP;                              /**< Analog Comparator control, offset: 0x50 */
       uint8_t RESERVED_4[12];
  __O  uint32_t CMD;                               /**< DCDC and LDOCORE power state (enable/disable) control., offset: 0x60 */
  __IO uint32_t WAKEUPIOCTRL;                      /**< Deep Power Down wake-up source [Reset by: PoR, Pin Reset, Software Reset], offset: 0x64 */
  __IO uint32_t WAKEIOCAUSE;                       /**< Wake-up I/O source, offset: 0x68 */
  __IO uint32_t LIFECYCLESTATE;                    /**< Life Cycle State as configured in the OTP, offset: 0x6C */
  __I  uint32_t STATUSPWR;                         /**< Power status from various analog modules (DCDC, LDO, etc), offset: 0x70 */
  __IO uint32_t STATUSCLK;                         /**< Clock status, offset: 0x74 */
       uint8_t RESERVED_5[8];
  __IO uint32_t AOREG0;                            /**< Always-on 0, offset: 0x80 */
  __IO uint32_t AOREG1;                            /**< Always-on 1, offset: 0x84 */
       uint8_t RESERVED_6[8];
  __IO uint32_t MISCCTRL;                          /**< Miscellaneous Control Register for PMU [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset], offset: 0x90 */
       uint8_t RESERVED_7[4];
  __IO uint32_t RTCOSC32K;                         /**< 32 KHz clocks source control, offset: 0x98 */
  __IO uint32_t OSEVENTTIMER;                      /**< OS Event Timer control, offset: 0x9C */
  __IO uint32_t PDSLEEPCFG1;                       /**< Controls the power to various modules during Low Power modes - DEEP-SLEEP, POWER-DOWN and DEEP-POWER-DOWN [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Software Reset], offset: 0xA0 */
  __IO uint32_t TIMEOUTEVENTS;                     /**< Record time-out errors that might occur at different stages during IC power up, offset: 0xA4 */
       uint8_t RESERVED_8[8];
  __IO uint32_t PDSLEEPCFG0;                       /**< Controls the power to various modules during Low Power modes - DEEP-SLEEP, POWER-DOWN and DEEP-POWER-DOWN [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Software Reset], offset: 0xB0 */
  __IO uint32_t SRAMRETCTRL;                       /**< Controls all SRAM instances power down modes during Low Power modes [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Software Reset], offset: 0xB4 */
  __IO uint32_t PDRUNCFG0;                         /**< Power configuration 0, offset: 0xB8 */
  __IO uint32_t PDRUNCFG1;                         /**< Power configuration 1, offset: 0xBC */
  __O  uint32_t PDRUNCFGSET0;                      /**< Power configuration set 0, offset: 0xC0 */
  __O  uint32_t PDRUNCFGSET1;                      /**< Power configuration set 1, offset: 0xC4 */
  __O  uint32_t PDRUNCFGCLR0;                      /**< Power configuration clear 0, offset: 0xC8 */
  __O  uint32_t PDRUNCFGCLR1;                      /**< Power configuration clear 1, offset: 0xCC */
       uint8_t RESERVED_9[4];
  __IO uint32_t SRAMCTRL;                          /**< All SRAMs common control signals [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Software Reset], offset: 0xD4 */
  __IO uint32_t SRAMCTRL0;                         /**< RAM_X0, and RAM_00 to RAM_30 power modes controls [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset] When [LS, LSDEL, DSB, DSBDEL] is: 0011 : Normal Mode 1111 : Light sleep mode 0100 : Deep-sleep mode 1100 : Shut down Mode, offset: 0xD8 */
  __IO uint32_t SRAMCTRL1;                         /**< RAM_40 to RAM_43 power modes controls [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset] When [LS, LSDEL, DSB, DSBDEL] is: 0011 : Normal Mode 1111 : Light sleep mode 0100 : Deep-sleep mode 1100 : Shut down Mode, offset: 0xDC */
} PMC_Type;

/* ----------------------------------------------------------------------------
   -- PMC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PMC_Register_Masks PMC Register Masks
 * @{
 */

/*! @name CTRL - Power Management Control [Reset by: PoR, Pin Reset, Software Reset and BoDs reset] */
/*! @{ */

#define PMC_CTRL_LPMODE_MASK                     (0x3U)
#define PMC_CTRL_LPMODE_SHIFT                    (0U)
/*! LPMODE - Power Mode Control.
 *  0b00..ACTIVE power mode.
 *  0b01..DEEP-SLEEP low power mode.
 *  0b10..POWER-DOWN low power mode.
 *  0b11..DEEP-POWER-DOWN low power mode.
 */
#define PMC_CTRL_LPMODE(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_LPMODE_SHIFT)) & PMC_CTRL_LPMODE_MASK)

#define PMC_CTRL_SELCLOCK_MASK                   (0x4U)
#define PMC_CTRL_SELCLOCK_SHIFT                  (2U)
/*! SELCLOCK - Select the Power Management Controller (PMC) functional clock :
 *  0b0..1 MHz Free Running Oscillator.
 *  0b1..12 MHz Free Running Oscillator.
 */
#define PMC_CTRL_SELCLOCK(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_SELCLOCK_SHIFT)) & PMC_CTRL_SELCLOCK_MASK)

#define PMC_CTRL_SELMEMSUPPLY_MASK               (0x8U)
#define PMC_CTRL_SELMEMSUPPLY_SHIFT              (3U)
/*! SELMEMSUPPLY - Select Memories supply source in DEEP-SLEEP low power mode: Note: in POWER-DOWN
 *    and DEEP-POWER-DOWN, memories are always supplied by LDO_MEM.
 *  0b0..Memories are supplied by LDO_MEM in 'DEEP-SLEEP' low power mode.
 *  0b1..Memories are supplied by DCDC/LDO_CORE in 'DEEP-SLEEP' low power mode.
 */
#define PMC_CTRL_SELMEMSUPPLY(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_SELMEMSUPPLY_SHIFT)) & PMC_CTRL_SELMEMSUPPLY_MASK)

#define PMC_CTRL_SELCORESUPPLYWK_MASK            (0x10U)
#define PMC_CTRL_SELCORESUPPLYWK_SHIFT           (4U)
/*! SELCORESUPPLYWK - Select Core Logic supply source when waking up from DEEP-SLEEP and POWER-DOWN low power modes :
 *  0b0..Core Logic is supplied by DCDC Converter.
 *  0b1..Core Logic is supplied by LDO CORE (configured in High Power mode).
 */
#define PMC_CTRL_SELCORESUPPLYWK(x)              (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_SELCORESUPPLYWK_SHIFT)) & PMC_CTRL_SELCORESUPPLYWK_MASK)

#define PMC_CTRL_DEEPSLEEPCORESUPPLY_MASK        (0x60U)
#define PMC_CTRL_DEEPSLEEPCORESUPPLY_SHIFT       (5U)
/*! DEEPSLEEPCORESUPPLY - Select Core Logic supply source during DEEP-SLEEP low power mode :
 *  0b00..LDO CORE in Low Power Mode.
 *  0b01..LDO CORE in High Power Mode.
 *  0b10..DCDC Converter.
 */
#define PMC_CTRL_DEEPSLEEPCORESUPPLY(x)          (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_DEEPSLEEPCORESUPPLY_SHIFT)) & PMC_CTRL_DEEPSLEEPCORESUPPLY_MASK)
/*! @} */

/*! @name STATUS - Power Management Controller FSM (Finite State Machines) status */
/*! @{ */

#define PMC_STATUS_BOOTMODE_MASK                 (0xC0000U)
#define PMC_STATUS_BOOTMODE_SHIFT                (18U)
/*! BOOTMODE - Latest IC Boot cause:.
 *  0b00..Latest IC boot was a Full power cycle boot sequence (PoR, Pin Reset, Brown Out Detectors Reset, Software Reset).
 *  0b01..Latest IC boot was from DEEP-SLEEP low power mode.
 *  0b10..Latest IC boot was from POWER-DOWN low power mode.
 *  0b11..Latest IC boot was from DEEP-POWER-DOWN low power mode.
 */
#define PMC_STATUS_BOOTMODE(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_BOOTMODE_SHIFT)) & PMC_STATUS_BOOTMODE_MASK)

#define PMC_STATUS_FSMDCDCENABLE_MASK            (0x100000U)
#define PMC_STATUS_FSMDCDCENABLE_SHIFT           (20U)
/*! FSMDCDCENABLE - Indicates the power status of the DCDC (enabled or disabled) as driven by the Hardware Finite State Machines (FSM).
 *  0b0..DCDC is currently disabled by the Hardware Finite State Machine (FSM).
 *  0b1..DCDC is currently enabled by the Hardware Finite State Machine (FSM).
 */
#define PMC_STATUS_FSMDCDCENABLE(x)              (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_FSMDCDCENABLE_SHIFT)) & PMC_STATUS_FSMDCDCENABLE_MASK)

