RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define SECTRL_MASTER_SEC_LEVEL_EZH_I_MASK       (0xC000U)
#define SECTRL_MASTER_SEC_LEVEL_EZH_I_SHIFT      (14U)
/*! EZH_I - EZH Instruction
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define SECTRL_MASTER_SEC_LEVEL_EZH_I(x)         (((uint32_t)(((uint32_t)(x)) << SECTRL_MASTER_SEC_LEVEL_EZH_I_SHIFT)) & SECTRL_MASTER_SEC_LEVEL_EZH_I_MASK)

#define SECTRL_MASTER_SEC_LEVEL_MCAN_MASK        (0xC0000U)
#define SECTRL_MASTER_SEC_LEVEL_MCAN_SHIFT       (18U)
/*! MCAN - MCAN
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define SECTRL_MASTER_SEC_LEVEL_MCAN(x)          (((uint32_t)(((uint32_t)(x)) << SECTRL_MASTER_SEC_LEVEL_MCAN_SHIFT)) & SECTRL_MASTER_SEC_LEVEL_MCAN_MASK)

#define SECTRL_MASTER_SEC_LEVEL_POWERQUAD_MASK   (0x300000U)
#define SECTRL_MASTER_SEC_LEVEL_POWERQUAD_SHIFT  (20U)
/*! POWERQUAD - POWERQUAD
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define SECTRL_MASTER_SEC_LEVEL_POWERQUAD(x)     (((uint32_t)(((uint32_t)(x)) << SECTRL_MASTER_SEC_LEVEL_POWERQUAD_SHIFT)) & SECTRL_MASTER_SEC_LEVEL_POWERQUAD_MASK)

#define SECTRL_MASTER_SEC_LEVEL_PKC_MASK         (0xC00000U)
#define SECTRL_MASTER_SEC_LEVEL_PKC_SHIFT        (22U)
/*! PKC - PKC
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define SECTRL_MASTER_SEC_LEVEL_PKC(x)           (((uint32_t)(((uint32_t)(x)) << SECTRL_MASTER_SEC_LEVEL_PKC_SHIFT)) & SECTRL_MASTER_SEC_LEVEL_PKC_MASK)

#define SECTRL_MASTER_SEC_LEVEL_DSP_D_MASK       (0x3000000U)
#define SECTRL_MASTER_SEC_LEVEL_DSP_D_SHIFT      (24U)
/*! DSP_D - DSP Data
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define SECTRL_MASTER_SEC_LEVEL_DSP_D(x)         (((uint32_t)(((uint32_t)(x)) << SECTRL_MASTER_SEC_LEVEL_DSP_D_SHIFT)) & SECTRL_MASTER_SEC_LEVEL_DSP_D_MASK)

#define SECTRL_MASTER_SEC_LEVEL_DSP_I_MASK       (0xC000000U)
#define SECTRL_MASTER_SEC_LEVEL_DSP_I_SHIFT      (26U)
/*! DSP_I - DSP Instruction
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define SECTRL_MASTER_SEC_LEVEL_DSP_I(x)         (((uint32_t)(((uint32_t)(x)) << SECTRL_MASTER_SEC_LEVEL_DSP_I_SHIFT)) & SECTRL_MASTER_SEC_LEVEL_DSP_I_MASK)

#define SECTRL_MASTER_SEC_LEVEL_MASTER_SEC_LEVEL_LOCK_MASK (0xC0000000U)
#define SECTRL_MASTER_SEC_LEVEL_MASTER_SEC_LEVEL_LOCK_SHIFT (30U)
/*! MASTER_SEC_LEVEL_LOCK - Master Security Level Lock
 *  0b00..Reserved
 *  0b01..Lock writing to this register, including these (MASTER_SEC_LEVEL_LOCK) bits
 *  0b10..This register can be written
 *  0b11..Reserved
 */
#define SECTRL_MASTER_SEC_LEVEL_MASTER_SEC_LEVEL_LOCK(x) (((uint32_t)(((uint32_t)(x)) << SECTRL_MASTER_SEC_LEVEL_MASTER_SEC_LEVEL_LOCK_SHIFT)) & SECTRL_MASTER_SEC_LEVEL_MASTER_SEC_LEVEL_LOCK_MASK)
/*! @} */

/*! @name MASTER_SEC_ANTI_POL_REG - Master Secure Level */
/*! @{ */

#define SECTRL_MASTER_SEC_ANTI_POL_REG_DMA0_MASK (0x30U)
#define SECTRL_MASTER_SEC_ANTI_POL_REG_DMA0_SHIFT (4U)
/*! DMA0 - DMA0
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define SECTRL_MASTER_SEC_ANTI_POL_REG_DMA0(x)   (((uint32_t)(((uint32_t)(x)) << SECTRL_MASTER_SEC_ANTI_POL_REG_DMA0_SHIFT)) & SECTRL_MASTER_SEC_ANTI_POL_REG_DMA0_MASK)

#define SECTRL_MASTER_SEC_ANTI_POL_REG_DMA1_MASK (0xC0U)
#define SECTRL_MASTER_SEC_ANTI_POL_REG_DMA1_SHIFT (6U)
/*! DMA1 - DMA1
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define SECTRL_MASTER_SEC_ANTI_POL_REG_DMA1(x)   (((uint32_t)(((uint32_t)(x)) << SECTRL_MASTER_SEC_ANTI_POL_REG_DMA1_SHIFT)) & SECTRL_MASTER_SEC_ANTI_POL_REG_DMA1_MASK)

#define SECTRL_MASTER_SEC_ANTI_POL_REG_USBFSD_MASK (0x300U)
#define SECTRL_MASTER_SEC_ANTI_POL_REG_USBFSD_SHIFT (8U)
/*! USBFSD - USBFS Device
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define SECTRL_MASTER_SEC_ANTI_POL_REG_USBFSD(x) (((uint32_t)(((uint32_t)(x)) << SECTRL_MASTER_SEC_ANTI_POL_REG_USBFSD_SHIFT)) & SECTRL_MASTER_SEC_ANTI_POL_REG_USBFSD_MASK)

#define SECTRL_MASTER_SEC_ANTI_POL_REG_USBFSH_MASK (0xC00U)
#define SECTRL_MASTER_SEC_ANTI_POL_REG_USBFSH_SHIFT (10U)
/*! USBFSH - USBFS Host
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define SECTRL_MASTER_SEC_ANTI_POL_REG_USBFSH(x) (((uint32_t)(((uint32_t)(x)) << SECTRL_MASTER_SEC_ANTI_POL_REG_USBFSH_SHIFT)) & SECTRL_MASTER_SEC_ANTI_POL_REG_USBFSH_MASK)

#define SECTRL_MASTER_SEC_ANTI_POL_REG_EZH_D_MASK (0x3000U)
#define SECTRL_MASTER_SEC_ANTI_POL_REG_EZH_D_SHIFT (12U)
/*! EZH_D - EZH Data
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define SECTRL_MASTER_SEC_ANTI_POL_REG_EZH_D(x)  (((uint32_t)(((uint32_t)(x)) << SECTRL_MASTER_SEC_ANTI_POL_REG_EZH_D_SHIFT)) & SECTRL_MASTER_SEC_ANTI_POL_REG_EZH_D_MASK)

#define SECTRL_MASTER_SEC_ANTI_POL_REG_EZH_I_MASK (0xC000U)
#define SECTRL_MASTER_SEC_ANTI_POL_REG_EZH_I_SHIFT (14U)
/*! EZH_I - EZH Instruction
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define SECTRL_MASTER_SEC_ANTI_POL_REG_EZH_I(x)  (((uint32_t)(((uint32_t)(x)) << SECTRL_MASTER_SEC_ANTI_POL_REG_EZH_I_SHIFT)) & SECTRL_MASTER_SEC_ANTI_POL_REG_EZH_I_MASK)

#define SECTRL_MASTER_SEC_ANTI_POL_REG_MCAN_MASK (0xC0000U)
#define SECTRL_MASTER_SEC_ANTI_POL_REG_MCAN_SHIFT (18U)
/*! MCAN - MCAN
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define SECTRL_MASTER_SEC_ANTI_POL_REG_MCAN(x)   (((uint32_t)(((uint32_t)(x)) << SECTRL_MASTER_SEC_ANTI_POL_REG_MCAN_SHIFT)) & SECTRL_MASTER_SEC_ANTI_POL_REG_MCAN_MASK)

