RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
/*! @name ISR - Interrupt Register */
/*! @{ */

#define SPI_FILTER_ISR_P0_DIRTY_INT_MASK         (0x1000000U)
#define SPI_FILTER_ISR_P0_DIRTY_INT_SHIFT        (24U)
/*! P0_DIRTY_INT
 *  0b0..Indicates that a write has occurred to the FW Code region of the inactive Flash and that flash is now considered corrupt
 *  0b1..Indicates normal operation
 */
#define SPI_FILTER_ISR_P0_DIRTY_INT(x)           (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P0_DIRTY_INT_SHIFT)) & SPI_FILTER_ISR_P0_DIRTY_INT_MASK)

#define SPI_FILTER_ISR_P1_DIRTY_INT_MASK         (0x2000000U)
#define SPI_FILTER_ISR_P1_DIRTY_INT_SHIFT        (25U)
/*! P1_DIRTY_INT
 *  0b0..Indicates normal operation
 *  0b1..indicates that a write has occurred to the FW Code region of the inactive Flash and that flash is now considered corrupt
 */
#define SPI_FILTER_ISR_P1_DIRTY_INT(x)           (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P1_DIRTY_INT_SHIFT)) & SPI_FILTER_ISR_P1_DIRTY_INT_MASK)

#define SPI_FILTER_ISR_P0_BLK_INT_MASK           (0x4000000U)
#define SPI_FILTER_ISR_P0_BLK_INT_SHIFT          (26U)
/*! P0_BLK_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates that a blocked opcode has been detected
 */
#define SPI_FILTER_ISR_P0_BLK_INT(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P0_BLK_INT_SHIFT)) & SPI_FILTER_ISR_P0_BLK_INT_MASK)

#define SPI_FILTER_ISR_P1_BLK_INT_MASK           (0x8000000U)
#define SPI_FILTER_ISR_P1_BLK_INT_SHIFT          (27U)
/*! P1_BLK_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates that a blocked opcode has been detected
 */
#define SPI_FILTER_ISR_P1_BLK_INT(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P1_BLK_INT_SHIFT)) & SPI_FILTER_ISR_P1_BLK_INT_MASK)

#define SPI_FILTER_ISR_P0_BYTEMODE_INT_MASK      (0x10000000U)
#define SPI_FILTER_ISR_P0_BYTEMODE_INT_SHIFT     (28U)
/*! P0_BYTEMODE_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates that a Bytemode change has been detected (OpCode E9 or B7)
 */
#define SPI_FILTER_ISR_P0_BYTEMODE_INT(x)        (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P0_BYTEMODE_INT_SHIFT)) & SPI_FILTER_ISR_P0_BYTEMODE_INT_MASK)

#define SPI_FILTER_ISR_P1_BYTEMODE_INT_MASK      (0x20000000U)
#define SPI_FILTER_ISR_P1_BYTEMODE_INT_SHIFT     (29U)
/*! P1_BYTEMODE_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates that a Bytemode change has been detected (OpCode E9 or B7)
 */
#define SPI_FILTER_ISR_P1_BYTEMODE_INT(x)        (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P1_BYTEMODE_INT_SHIFT)) & SPI_FILTER_ISR_P1_BYTEMODE_INT_MASK)

#define SPI_FILTER_ISR_P0_F8_INT_MASK            (0x40000000U)
#define SPI_FILTER_ISR_P0_F8_INT_SHIFT           (30U)
/*! P0_F8_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates an F8 command has been detected
 */
#define SPI_FILTER_ISR_P0_F8_INT(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P0_F8_INT_SHIFT)) & SPI_FILTER_ISR_P0_F8_INT_MASK)

#define SPI_FILTER_ISR_P1_F8_INT_MASK            (0x80000000U)
#define SPI_FILTER_ISR_P1_F8_INT_SHIFT           (31U)
/*! P1_F8_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates an F8 command has been detected
 */
#define SPI_FILTER_ISR_P1_F8_INT(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P1_F8_INT_SHIFT)) & SPI_FILTER_ISR_P1_F8_INT_MASK)
/*! @} */

/*! @name IMR - Interrupt Mask Register */
/*! @{ */

#define SPI_FILTER_IMR_P0_DIRTY_MASK_MASK        (0x1000000U)
#define SPI_FILTER_IMR_P0_DIRTY_MASK_SHIFT       (24U)
/*! P0_DIRTY_MASK - Mask bit for P0_DIRTY_INT
 *  0b0..Indicates P0_DIRTY_INT interrupt is disabled.
 *  0b1..Indicates P0_DIRTY_INT interrupt is enabled.
 */
#define SPI_FILTER_IMR_P0_DIRTY_MASK(x)          (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P0_DIRTY_MASK_SHIFT)) & SPI_FILTER_IMR_P0_DIRTY_MASK_MASK)

#define SPI_FILTER_IMR_P1_DIRTY_MASK_MASK        (0x2000000U)
#define SPI_FILTER_IMR_P1_DIRTY_MASK_SHIFT       (25U)
/*! P1_DIRTY_MASK - Mask bit for P1_DIRTY_INT
 *  0b0..Indicates normal operation. P1_DIRTY_INT interrupt is enabled.
 *  0b1..Indicates P1_DIRTY_INT interrupt is disabled.
 */
#define SPI_FILTER_IMR_P1_DIRTY_MASK(x)          (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P1_DIRTY_MASK_SHIFT)) & SPI_FILTER_IMR_P1_DIRTY_MASK_MASK)

#define SPI_FILTER_IMR_P0_BLK_MASK_MASK          (0x4000000U)
#define SPI_FILTER_IMR_P0_BLK_MASK_SHIFT         (26U)
/*! P0_BLK_MASK - Mask bit for P0_BLK_MASK
 *  0b0..Indicates P0_BLK_MASK is enabled.
 *  0b1..Indicates P0_BLK_MASK is disabled.
 */
#define SPI_FILTER_IMR_P0_BLK_MASK(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P0_BLK_MASK_SHIFT)) & SPI_FILTER_IMR_P0_BLK_MASK_MASK)

#define SPI_FILTER_IMR_P1_BLK_MASK_MASK          (0x8000000U)
#define SPI_FILTER_IMR_P1_BLK_MASK_SHIFT         (27U)
/*! P1_BLK_MASK - Mask bit for P1_BLK_MASK
 *  0b0..Indicates P1_BLK_MASK is enabled.
 *  0b1..Indicates P1_BLK_MASK is disabled.
 */
#define SPI_FILTER_IMR_P1_BLK_MASK(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P1_BLK_MASK_SHIFT)) & SPI_FILTER_IMR_P1_BLK_MASK_MASK)

#define SPI_FILTER_IMR_P0_BYTEMODE_MASK_MASK     (0x10000000U)
#define SPI_FILTER_IMR_P0_BYTEMODE_MASK_SHIFT    (28U)
/*! P0_BYTEMODE_MASK - Mask bit for P0_BYTEMODE_MASK
 *  0b0..Indicates P0_BYTEMODE_MASK is enabled.
 *  0b1..Indicates P0_BYTEMODE_MASK is disabled.
 */
#define SPI_FILTER_IMR_P0_BYTEMODE_MASK(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P0_BYTEMODE_MASK_SHIFT)) & SPI_FILTER_IMR_P0_BYTEMODE_MASK_MASK)

#define SPI_FILTER_IMR_P1_BYTEMODE_MASK_MASK     (0x20000000U)
#define SPI_FILTER_IMR_P1_BYTEMODE_MASK_SHIFT    (29U)
/*! P1_BYTEMODE_MASK - Mask bit for P1_BYTEMODE_MASK
 *  0b0..Indicates P1_BYTEMODE_MASK is enabled.
 *  0b1..Indicates P1_BYTEMODE_MASK is disabled.
 */
#define SPI_FILTER_IMR_P1_BYTEMODE_MASK(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P1_BYTEMODE_MASK_SHIFT)) & SPI_FILTER_IMR_P1_BYTEMODE_MASK_MASK)

#define SPI_FILTER_IMR_P0_F8_MASK_MASK           (0x40000000U)
#define SPI_FILTER_IMR_P0_F8_MASK_SHIFT          (30U)
/*! P0_F8_MASK - Mask bit for P0_F8_MASK
 *  0b0..Indicates P0_F8_MASK is enabled.
 *  0b1..Indicates P0_F8_MASK is disabled.
 */
#define SPI_FILTER_IMR_P0_F8_MASK(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P0_F8_MASK_SHIFT)) & SPI_FILTER_IMR_P0_F8_MASK_MASK)

#define SPI_FILTER_IMR_P1_F8_MASK_MASK           (0x80000000U)
#define SPI_FILTER_IMR_P1_F8_MASK_SHIFT          (31U)
/*! P1_F8_MASK - Mask bit for P1_F8_MASK
 *  0b0..Indicates P1_F8_MASK is enabled.
 *  0b1..Indicates P1_F8_MASK is disabled.
 */
#define SPI_FILTER_IMR_P1_F8_MASK(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P1_F8_MASK_SHIFT)) & SPI_FILTER_IMR_P1_F8_MASK_MASK)
/*! @} */

/*! @name SR - Status Register */
/*! @{ */

