RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define SPI_FILTER_SR_P1_DIRTY_MASK              (0x10000U)
#define SPI_FILTER_SR_P1_DIRTY_SHIFT             (16U)
/*! P1_DIRTY
 *  0b1..Indicates that a write to the inactive Flash has been detected and the state of the flash should be considered "dirty".
 *  0b1..Indicates normal operation. No Writes have been directed to the inactive Flash
 */
#define SPI_FILTER_SR_P1_DIRTY(x)                (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_SR_P1_DIRTY_SHIFT)) & SPI_FILTER_SR_P1_DIRTY_MASK)

#define SPI_FILTER_SR_P1_BYTE_MODE_MASK          (0x20000U)
#define SPI_FILTER_SR_P1_BYTE_MODE_SHIFT         (17U)
/*! P1_BYTE_MODE
 *  0b0..3-Byte Address Mode
 *  0b1..4-Byte Address Mode
 */
#define SPI_FILTER_SR_P1_BYTE_MODE(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_SR_P1_BYTE_MODE_SHIFT)) & SPI_FILTER_SR_P1_BYTE_MODE_MASK)

#define SPI_FILTER_SR_P0_DIRTY_MASK              (0x1000000U)
#define SPI_FILTER_SR_P0_DIRTY_SHIFT             (24U)
/*! P0_DIRTY
 *  0b0..Indicates normal operation. No Writes have been directed to the inactive Flash
 *  0b1..Indicates that a write to the inactive Flash has been detected and the state of the flash should be considered "dirty".
 */
#define SPI_FILTER_SR_P0_DIRTY(x)                (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_SR_P0_DIRTY_SHIFT)) & SPI_FILTER_SR_P0_DIRTY_MASK)

#define SPI_FILTER_SR_P0_BYTE_MODE_MASK          (0x2000000U)
#define SPI_FILTER_SR_P0_BYTE_MODE_SHIFT         (25U)
/*! P0_BYTE_MODE
 *  0b0..3-Byte Address Mode
 *  0b1..4-Byte Address Mode
 */
#define SPI_FILTER_SR_P0_BYTE_MODE(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_SR_P0_BYTE_MODE_SHIFT)) & SPI_FILTER_SR_P0_BYTE_MODE_MASK)
/*! @} */

/*! @name TCR - Test Control Register */
/*! @{ */

#define SPI_FILTER_TCR_P0_BYP_SEL_MASK           (0x10000U)
#define SPI_FILTER_TCR_P0_BYP_SEL_SHIFT          (16U)
/*! P0_BYP_SEL
 *  0b0..CS0
 *  0b1..CS1
 */
#define SPI_FILTER_TCR_P0_BYP_SEL(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TCR_P0_BYP_SEL_SHIFT)) & SPI_FILTER_TCR_P0_BYP_SEL_MASK)

#define SPI_FILTER_TCR_P0_BYP_EN_MASK            (0x20000U)
#define SPI_FILTER_TCR_P0_BYP_EN_SHIFT           (17U)
/*! P0_BYP_EN
 *  0b0..Filter Bypass Disabled
 *  0b1..Filter Bypass Enabled
 */
#define SPI_FILTER_TCR_P0_BYP_EN(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TCR_P0_BYP_EN_SHIFT)) & SPI_FILTER_TCR_P0_BYP_EN_MASK)

#define SPI_FILTER_TCR_P1_BYP_SEL_MASK           (0x40000U)
#define SPI_FILTER_TCR_P1_BYP_SEL_SHIFT          (18U)
/*! P1_BYP_SEL
 *  0b0..CS0
 *  0b1..CS1
 */
#define SPI_FILTER_TCR_P1_BYP_SEL(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TCR_P1_BYP_SEL_SHIFT)) & SPI_FILTER_TCR_P1_BYP_SEL_MASK)

#define SPI_FILTER_TCR_P1_BYP_EN_MASK            (0x80000U)
#define SPI_FILTER_TCR_P1_BYP_EN_SHIFT           (19U)
/*! P1_BYP_EN
 *  0b0..Filter Bypass Disabled
 *  0b1..Filter Bypass Enabled
 */
#define SPI_FILTER_TCR_P1_BYP_EN(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TCR_P1_BYP_EN_SHIFT)) & SPI_FILTER_TCR_P1_BYP_EN_MASK)

#define SPI_FILTER_TCR_P0_MFG_ID_MASK            (0xF000000U)
#define SPI_FILTER_TCR_P0_MFG_ID_SHIFT           (24U)
/*! P0_MFG_ID - Sets the Flash memory manufacturer
 *  0b0010..Micron
 *  0b0001..Windbond
 *  0b0000..Macronix
 */
#define SPI_FILTER_TCR_P0_MFG_ID(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TCR_P0_MFG_ID_SHIFT)) & SPI_FILTER_TCR_P0_MFG_ID_MASK)

#define SPI_FILTER_TCR_P1_MFG_ID_MASK            (0xF0000000U)
#define SPI_FILTER_TCR_P1_MFG_ID_SHIFT           (28U)
/*! P1_MFG_ID - Sets the Flash memory manufacturer
 *  0b0010..Micron
 *  0b0001..Windbond
 *  0b0000..Macronix
 */
#define SPI_FILTER_TCR_P1_MFG_ID(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TCR_P1_MFG_ID_SHIFT)) & SPI_FILTER_TCR_P1_MFG_ID_MASK)
/*! @} */

/*! @name P0FAR1 - Port 0 filter address region 1 */
/*! @{ */

#define SPI_FILTER_P0FAR1_ADDRESS_LOWER_LSBS_MASK (0xFFU)
#define SPI_FILTER_P0FAR1_ADDRESS_LOWER_LSBS_SHIFT (0U)
/*! ADDRESS_LOWER_LSBS - Address Lower LSBs
 */
#define SPI_FILTER_P0FAR1_ADDRESS_LOWER_LSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR1_ADDRESS_LOWER_LSBS_SHIFT)) & SPI_FILTER_P0FAR1_ADDRESS_LOWER_LSBS_MASK)

#define SPI_FILTER_P0FAR1_ADDRESS_LOWER_MSBS_MASK (0xFF00U)
#define SPI_FILTER_P0FAR1_ADDRESS_LOWER_MSBS_SHIFT (8U)
/*! ADDRESS_LOWER_MSBS - Address Lower MSBs
 */
#define SPI_FILTER_P0FAR1_ADDRESS_LOWER_MSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR1_ADDRESS_LOWER_MSBS_SHIFT)) & SPI_FILTER_P0FAR1_ADDRESS_LOWER_MSBS_MASK)

#define SPI_FILTER_P0FAR1_ADDRESS_UPPER_LSBS_MASK (0xFF0000U)
#define SPI_FILTER_P0FAR1_ADDRESS_UPPER_LSBS_SHIFT (16U)
/*! ADDRESS_UPPER_LSBS - Address Upper LSBs
 */
#define SPI_FILTER_P0FAR1_ADDRESS_UPPER_LSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR1_ADDRESS_UPPER_LSBS_SHIFT)) & SPI_FILTER_P0FAR1_ADDRESS_UPPER_LSBS_MASK)

#define SPI_FILTER_P0FAR1_ADDRESS_UPPER_MSBS_MASK (0xFF000000U)
#define SPI_FILTER_P0FAR1_ADDRESS_UPPER_MSBS_SHIFT (24U)
/*! ADDRESS_UPPER_MSBS - Address Upper MSBs
 */
#define SPI_FILTER_P0FAR1_ADDRESS_UPPER_MSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR1_ADDRESS_UPPER_MSBS_SHIFT)) & SPI_FILTER_P0FAR1_ADDRESS_UPPER_MSBS_MASK)
/*! @} */

/*! @name P0FAR2 - Port 0 filter address region 2 */
/*! @{ */

#define SPI_FILTER_P0FAR2_ADDRESS_LOWER_LSBS_MASK (0xFFU)
#define SPI_FILTER_P0FAR2_ADDRESS_LOWER_LSBS_SHIFT (0U)
/*! ADDRESS_LOWER_LSBS - Address Lower LSBs
 */
#define SPI_FILTER_P0FAR2_ADDRESS_LOWER_LSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR2_ADDRESS_LOWER_LSBS_SHIFT)) & SPI_FILTER_P0FAR2_ADDRESS_LOWER_LSBS_MASK)

#define SPI_FILTER_P0FAR2_ADDRESS_LOWER_MSBS_MASK (0xFF00U)
#define SPI_FILTER_P0FAR2_ADDRESS_LOWER_MSBS_SHIFT (8U)
/*! ADDRESS_LOWER_MSBS - Address Lower MSBs
 */
#define SPI_FILTER_P0FAR2_ADDRESS_LOWER_MSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR2_ADDRESS_LOWER_MSBS_SHIFT)) & SPI_FILTER_P0FAR2_ADDRESS_LOWER_MSBS_MASK)

#define SPI_FILTER_P0FAR2_ADDRESS_UPPER_LSBS_MASK (0xFF0000U)
#define SPI_FILTER_P0FAR2_ADDRESS_UPPER_LSBS_SHIFT (16U)
/*! ADDRESS_UPPER_LSBS - Address Upper LSBs
 */
#define SPI_FILTER_P0FAR2_ADDRESS_UPPER_LSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR2_ADDRESS_UPPER_LSBS_SHIFT)) & SPI_FILTER_P0FAR2_ADDRESS_UPPER_LSBS_MASK)

