RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define SPI_FILTER_VER_MAJOR_REVISION_MASK       (0xF0000000U)
#define SPI_FILTER_VER_MAJOR_REVISION_SHIFT      (28U)
/*! MAJOR_REVISION - Major Revision
 */
#define SPI_FILTER_VER_MAJOR_REVISION(x)         (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_VER_MAJOR_REVISION_SHIFT)) & SPI_FILTER_VER_MAJOR_REVISION_MASK)
/*! @} */

/*! @name POPCODE0 - Programmable OP-Code0 */
/*! @{ */

#define SPI_FILTER_POPCODE0_FILTER_STATE0_MASK   (0x1F0000U)
#define SPI_FILTER_POPCODE0_FILTER_STATE0_SHIFT  (16U)
/*! FILTER_STATE0 - Programmable Filter state 0
 */
#define SPI_FILTER_POPCODE0_FILTER_STATE0(x)     (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE0_FILTER_STATE0_SHIFT)) & SPI_FILTER_POPCODE0_FILTER_STATE0_MASK)

#define SPI_FILTER_POPCODE0_FILTER_BIT0_MASK     (0x200000U)
#define SPI_FILTER_POPCODE0_FILTER_BIT0_SHIFT    (21U)
/*! FILTER_BIT0
 *  0b0..Filter after 7th bit for all Commands Op Codes that need to be filtered.
 *  0b1..Filter after 8th bit for all Read/Write Op Codes that are filtered based on the address.
 */
#define SPI_FILTER_POPCODE0_FILTER_BIT0(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE0_FILTER_BIT0_SHIFT)) & SPI_FILTER_POPCODE0_FILTER_BIT0_MASK)

#define SPI_FILTER_POPCODE0_PRG_OPCODE0_MASK     (0xFF000000U)
#define SPI_FILTER_POPCODE0_PRG_OPCODE0_SHIFT    (24U)
/*! PRG_OPCODE0 - Programmable OP Code 0
 */
#define SPI_FILTER_POPCODE0_PRG_OPCODE0(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE0_PRG_OPCODE0_SHIFT)) & SPI_FILTER_POPCODE0_PRG_OPCODE0_MASK)
/*! @} */

/*! @name POPCODE1 - Programmable OP-Code1 */
/*! @{ */

#define SPI_FILTER_POPCODE1_FILTER_STATE1_MASK   (0x1F0000U)
#define SPI_FILTER_POPCODE1_FILTER_STATE1_SHIFT  (16U)
/*! FILTER_STATE1 - Programmable Filter state 1
 */
#define SPI_FILTER_POPCODE1_FILTER_STATE1(x)     (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE1_FILTER_STATE1_SHIFT)) & SPI_FILTER_POPCODE1_FILTER_STATE1_MASK)

#define SPI_FILTER_POPCODE1_FILTER_BIT1_MASK     (0x200000U)
#define SPI_FILTER_POPCODE1_FILTER_BIT1_SHIFT    (21U)
/*! FILTER_BIT1
 *  0b0..Filter after 7th bit for all Commands Op Codes that need to be filtered.
 *  0b1..Filter after 8th bit for all Read/Write Op Codes that are filtered based on the address.
 */
#define SPI_FILTER_POPCODE1_FILTER_BIT1(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE1_FILTER_BIT1_SHIFT)) & SPI_FILTER_POPCODE1_FILTER_BIT1_MASK)

#define SPI_FILTER_POPCODE1_PRG_OPCODE1_MASK     (0xFF000000U)
#define SPI_FILTER_POPCODE1_PRG_OPCODE1_SHIFT    (24U)
/*! PRG_OPCODE1 - Programmable OP Code 1
 */
#define SPI_FILTER_POPCODE1_PRG_OPCODE1(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE1_PRG_OPCODE1_SHIFT)) & SPI_FILTER_POPCODE1_PRG_OPCODE1_MASK)
/*! @} */

/*! @name POPCODE2 - Programmable OP-Code2 */
/*! @{ */

#define SPI_FILTER_POPCODE2_FILTER_STATE2_MASK   (0x1F0000U)
#define SPI_FILTER_POPCODE2_FILTER_STATE2_SHIFT  (16U)
/*! FILTER_STATE2 - Programmable Filter state 2
 */
#define SPI_FILTER_POPCODE2_FILTER_STATE2(x)     (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE2_FILTER_STATE2_SHIFT)) & SPI_FILTER_POPCODE2_FILTER_STATE2_MASK)

#define SPI_FILTER_POPCODE2_FILTER_BIT2_MASK     (0x200000U)
#define SPI_FILTER_POPCODE2_FILTER_BIT2_SHIFT    (21U)
/*! FILTER_BIT2
 *  0b0..Filter after 7th bit for all Commands Op Codes that need to be filtered.
 *  0b1..Filter after 8th bit for all Read/Write Op Codes that are filtered based on the address.
 */
#define SPI_FILTER_POPCODE2_FILTER_BIT2(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE2_FILTER_BIT2_SHIFT)) & SPI_FILTER_POPCODE2_FILTER_BIT2_MASK)

#define SPI_FILTER_POPCODE2_PRG_OPCODE2_MASK     (0xFF000000U)
#define SPI_FILTER_POPCODE2_PRG_OPCODE2_SHIFT    (24U)
/*! PRG_OPCODE2 - Programmable OP Code 0
 */
#define SPI_FILTER_POPCODE2_PRG_OPCODE2(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE2_PRG_OPCODE2_SHIFT)) & SPI_FILTER_POPCODE2_PRG_OPCODE2_MASK)
/*! @} */

/*! @name POPCODE3 - Programmable OP-Code3 */
/*! @{ */

#define SPI_FILTER_POPCODE3_FILTER_STATE3_MASK   (0x1F0000U)
#define SPI_FILTER_POPCODE3_FILTER_STATE3_SHIFT  (16U)
/*! FILTER_STATE3 - Programmable Filter state 3
 */
#define SPI_FILTER_POPCODE3_FILTER_STATE3(x)     (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE3_FILTER_STATE3_SHIFT)) & SPI_FILTER_POPCODE3_FILTER_STATE3_MASK)

#define SPI_FILTER_POPCODE3_FILTER_BIT3_MASK     (0x200000U)
#define SPI_FILTER_POPCODE3_FILTER_BIT3_SHIFT    (21U)
/*! FILTER_BIT3
 *  0b0..Filter after 7th bit for all Commands Op Codes that need to be filtered.
 *  0b1..Filter after 8th bit for all Read/Write Op Codes that are filtered based on the address.
 */
#define SPI_FILTER_POPCODE3_FILTER_BIT3(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE3_FILTER_BIT3_SHIFT)) & SPI_FILTER_POPCODE3_FILTER_BIT3_MASK)

#define SPI_FILTER_POPCODE3_PRG_OPCODE3_MASK     (0xFF000000U)
#define SPI_FILTER_POPCODE3_PRG_OPCODE3_SHIFT    (24U)
/*! PRG_OPCODE3 - Programmable OP Code 3
 */
#define SPI_FILTER_POPCODE3_PRG_OPCODE3(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE3_PRG_OPCODE3_SHIFT)) & SPI_FILTER_POPCODE3_PRG_OPCODE3_MASK)
/*! @} */

/*! @name POPCODE4 - Programmable OP-Code4 */
/*! @{ */

#define SPI_FILTER_POPCODE4_FILTER_STATE4_MASK   (0x1F0000U)
#define SPI_FILTER_POPCODE4_FILTER_STATE4_SHIFT  (16U)
/*! FILTER_STATE4 - Programmable Filter state 4
 */
#define SPI_FILTER_POPCODE4_FILTER_STATE4(x)     (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE4_FILTER_STATE4_SHIFT)) & SPI_FILTER_POPCODE4_FILTER_STATE4_MASK)

#define SPI_FILTER_POPCODE4_FILTER_BIT4_MASK     (0x200000U)
#define SPI_FILTER_POPCODE4_FILTER_BIT4_SHIFT    (21U)
/*! FILTER_BIT4
 *  0b0..Filter after 7th bit for all Commands Op Codes that need to be filtered.
 *  0b1..Filter after 8th bit for all Read/Write Op Codes that are filtered based on the address.
 */
#define SPI_FILTER_POPCODE4_FILTER_BIT4(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE4_FILTER_BIT4_SHIFT)) & SPI_FILTER_POPCODE4_FILTER_BIT4_MASK)

