RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define SPI_FILTER_POPCODE4_PRG_OPCODE4_MASK     (0xFF000000U)
#define SPI_FILTER_POPCODE4_PRG_OPCODE4_SHIFT    (24U)
/*! PRG_OPCODE4 - Programmable OP Code 4
 */
#define SPI_FILTER_POPCODE4_PRG_OPCODE4(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE4_PRG_OPCODE4_SHIFT)) & SPI_FILTER_POPCODE4_PRG_OPCODE4_MASK)
/*! @} */

/*! @name P0BOC - P0 Blocked Op Code */
/*! @{ */

#define SPI_FILTER_P0BOC_P0BOC_MASK              (0xFF000000U)
#define SPI_FILTER_P0BOC_P0BOC_SHIFT             (24U)
/*! P0BOC - Port 0 Blocked Op Code
 */
#define SPI_FILTER_P0BOC_P0BOC(x)                (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0BOC_P0BOC_SHIFT)) & SPI_FILTER_P0BOC_P0BOC_MASK)
/*! @} */

/*! @name P1BOC - P1 Blocked Op Code */
/*! @{ */

#define SPI_FILTER_P1BOC_P1BOC_MASK              (0xFF000000U)
#define SPI_FILTER_P1BOC_P1BOC_SHIFT             (24U)
/*! P1BOC - Port 1 Blocked Op Code
 */
#define SPI_FILTER_P1BOC_P1BOC(x)                (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1BOC_P1BOC_SHIFT)) & SPI_FILTER_P1BOC_P1BOC_MASK)
/*! @} */

/*! @name P0MAM - Port 0 Max Address Mask */
/*! @{ */

#define SPI_FILTER_P0MAM_P0MAML_MASK             (0xFF0000U)
#define SPI_FILTER_P0MAM_P0MAML_SHIFT            (16U)
/*! P0MAML - Port 0 Max Address Mask LSB
 */
#define SPI_FILTER_P0MAM_P0MAML(x)               (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0MAM_P0MAML_SHIFT)) & SPI_FILTER_P0MAM_P0MAML_MASK)

#define SPI_FILTER_P0MAM_P0MAMM_MASK             (0xFF000000U)
#define SPI_FILTER_P0MAM_P0MAMM_SHIFT            (24U)
/*! P0MAMM - Port 0 Max Address Mask MSB
 */
#define SPI_FILTER_P0MAM_P0MAMM(x)               (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0MAM_P0MAMM_SHIFT)) & SPI_FILTER_P0MAM_P0MAMM_MASK)
/*! @} */

/*! @name P1MAM - Port 1 Max Address Mask */
/*! @{ */

#define SPI_FILTER_P1MAM_P1MAML_MASK             (0xFF0000U)
#define SPI_FILTER_P1MAM_P1MAML_SHIFT            (16U)
/*! P1MAML - Port 1 Max Address Mask LSB
 */
#define SPI_FILTER_P1MAM_P1MAML(x)               (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1MAM_P1MAML_SHIFT)) & SPI_FILTER_P1MAM_P1MAML_MASK)

#define SPI_FILTER_P1MAM_P1MAMM_MASK             (0xFF000000U)
#define SPI_FILTER_P1MAM_P1MAMM_SHIFT            (24U)
/*! P1MAMM - Port 1 Max Address Mask MSB
 */
#define SPI_FILTER_P1MAM_P1MAMM(x)               (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1MAM_P1MAMM_SHIFT)) & SPI_FILTER_P1MAM_P1MAMM_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SPI_FILTER_Register_Masks */


/* SPI_FILTER - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SPI_FILTER base address */
  #define SPI_FILTER_BASE                          (0x50024000u)
  /** Peripheral SPI_FILTER base address */
  #define SPI_FILTER_BASE_NS                       (0x40024000u)
  /** Peripheral SPI_FILTER base pointer */
  #define SPI_FILTER                               ((SPI_FILTER_Type *)SPI_FILTER_BASE)
  /** Peripheral SPI_FILTER base pointer */
  #define SPI_FILTER_NS                            ((SPI_FILTER_Type *)SPI_FILTER_BASE_NS)
  /** Array initializer of SPI_FILTER peripheral base addresses */
  #define SPI_FILTER_BASE_ADDRS                    { SPI_FILTER_BASE }
  /** Array initializer of SPI_FILTER peripheral base pointers */
  #define SPI_FILTER_BASE_PTRS                     { SPI_FILTER }
  /** Array initializer of SPI_FILTER peripheral base addresses */
  #define SPI_FILTER_BASE_ADDRS_NS                 { SPI_FILTER_BASE_NS }
  /** Array initializer of SPI_FILTER peripheral base pointers */
  #define SPI_FILTER_BASE_PTRS_NS                  { SPI_FILTER_NS }
#else
  /** Peripheral SPI_FILTER base address */
  #define SPI_FILTER_BASE                          (0x40024000u)
  /** Peripheral SPI_FILTER base pointer */
  #define SPI_FILTER                               ((SPI_FILTER_Type *)SPI_FILTER_BASE)
  /** Array initializer of SPI_FILTER peripheral base addresses */
  #define SPI_FILTER_BASE_ADDRS                    { SPI_FILTER_BASE }
  /** Array initializer of SPI_FILTER peripheral base pointers */
  #define SPI_FILTER_BASE_PTRS                     { SPI_FILTER }
#endif

/*!
 * @}
 */ /* end of group SPI_FILTER_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SYSCON Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCON_Peripheral_Access_Layer SYSCON Peripheral Access Layer
 * @{
 */

/** SYSCON - Register Layout Typedef */
typedef struct {
  __IO uint32_t MEMORYREMAP;                       /**< Memory Remap Control, offset: 0x0 */
       uint8_t RESERVED_0[12];
  __IO uint32_t AHBMATPRIO;                        /**< AHB Matrix priority control, offset: 0x10 */
  __IO uint32_t AHBMATPRIO1;                       /**< AHB Matrix priority control, offset: 0x14 */
       uint8_t RESERVED_1[32];
  __IO uint32_t CPU0STCKCAL;                       /**< System tick calibration for secure part of CPU0, offset: 0x38 */
  __IO uint32_t CPU0NSTCKCAL;                      /**< System tick calibration for non-secure part of CPU0, offset: 0x3C */
       uint8_t RESERVED_2[8];
  __IO uint32_t NMISRC;                            /**< NMI Source Select, offset: 0x48 */
       uint8_t RESERVED_3[180];
  __IO uint32_t PRESETCTRL0;                       /**< Peripheral reset control 0, offset: 0x100 */
  __IO uint32_t PRESETCTRL1;                       /**< Peripheral reset control 1, offset: 0x104 */
  __IO uint32_t PRESETCTRL2;                       /**< Peripheral reset control 2, offset: 0x108 */
  __IO uint32_t PRESETCTRL3;                       /**< Peripheral reset control 3, offset: 0x10C */
       uint8_t RESERVED_4[16];
  __O  uint32_t PRESETCTRLSET[4];                  /**< Peripheral reset control set n, array offset: 0x120, array step: 0x4 */
       uint8_t RESERVED_5[16];
  __O  uint32_t PRESETCTRLCLR[4];                  /**< Peripheral reset control clear n, array offset: 0x140, array step: 0x4 */
       uint8_t RESERVED_6[16];
  __O  uint32_t SWR_RESET;                         /**< Software Reset, offset: 0x160 */
       uint8_t RESERVED_7[156];
  __IO uint32_t AHBCLKCTRL0;                       /**< AHB Clock control 0, offset: 0x200 */
  __IO uint32_t AHBCLKCTRL1;                       /**< AHB Clock control 1, offset: 0x204 */
  __IO uint32_t AHBCLKCTRL2;                       /**< AHB Clock control 2, offset: 0x208 */
  __IO uint32_t AHBCLKCTRL3;                       /**< AHB Clock Control 3, offset: 0x20C */
       uint8_t RESERVED_8[16];
  __IO uint32_t AHBCLKCTRLSET[4];                  /**< AHB Clock Control Set, array offset: 0x220, array step: 0x4 */
       uint8_t RESERVED_9[16];
  __IO uint32_t AHBCLKCTRLCLR[4];                  /**< AHB Clock Control Clear, array offset: 0x240, array step: 0x4 */
       uint8_t RESERVED_10[16];
  __IO uint32_t SYSTICKCLKSEL0;                    /**< System Tick Timer for CPU0 source select, offset: 0x260 */
       uint8_t RESERVED_11[4];
  __IO uint32_t TRACECLKSEL;                       /**< Trace clock source select, offset: 0x268 */
  __IO uint32_t CTIMERCLKSEL[5];                   /**< CTimer 0 clock source select..CTimer 4 clock source select, array offset: 0x26C, array step: 0x4 */
  __IO uint32_t MAINCLKSELA;                       /**< Main clock source select A, offset: 0x280 */
  __IO uint32_t MAINCLKSELB;                       /**< Main clock source select B, offset: 0x284 */
  __IO uint32_t CLKOUTSEL;                         /**< CLKOUT clock source select, offset: 0x288 */
       uint8_t RESERVED_12[4];
  __IO uint32_t PLL0CLKSEL;                        /**< PLL0 clock source select, offset: 0x290 */
  __IO uint32_t PLL1CLKSEL;                        /**< PLL1 clock source select, offset: 0x294 */
       uint8_t RESERVED_13[8];
  __IO uint32_t CANCLKSEL;                         /**< CAN clock source select, offset: 0x2A0 */
  __IO uint32_t ADC0CLKSEL;                        /**< ADC0 clock source select, offset: 0x2A4 */
  __IO uint32_t USB0CLKSEL;                        /**< FS USB clock source select, offset: 0x2A8 */
       uint8_t RESERVED_14[4];
  __IO uint32_t FCCLKSEL[8];                       /**< Flexcomm 0 clock source select for Fractional Rate Divider..Flexcomm 7 clock source select for Fractional Rate Divider, array offset: 0x2B0, array step: 0x4 */
  __IO uint32_t HSSPICLKSEL;                       /**< HS SPI clock source select, offset: 0x2D0 */
       uint8_t RESERVED_15[12];
  __IO uint32_t MCLKCLKSEL;                        /**< MCLK clock source select, offset: 0x2E0 */
       uint8_t RESERVED_16[12];
  __IO uint32_t SCTCLKSEL;                         /**< SCTimer/PWM clock source select, offset: 0x2F0 */
       uint8_t RESERVED_17[12];
  __IO uint32_t SYSTICKCLKDIV[1];                  /**< System Tick Timer divider for CPU0, array offset: 0x300, array step: 0x4 */
       uint8_t RESERVED_18[4];
  __IO uint32_t TRACECLKDIV;                       /**< TRACE clock divider, offset: 0x308 */
  __IO uint32_t CANCLKDIV;                         /**< CAN clock divider, offset: 0x30C */
       uint8_t RESERVED_19[16];
  __IO uint32_t FRGCTRL[8];                        /**< Fractional rate divider for flexcomm 0..Fractional rate divider for flexcomm 7, array offset: 0x320, array step: 0x4 */
       uint8_t RESERVED_20[64];
  __IO uint32_t AHBCLKDIV;                         /**< System clock divider, offset: 0x380 */
  __IO uint32_t CLKOUTDIV;                         /**< CLKOUT clock divider, offset: 0x384 */
  __IO uint32_t FROHFDIV;                          /**< FRO_HF (96MHz) clock divider, offset: 0x388 */
  __IO uint32_t WDTCLKDIV;                         /**< WDT clock divider, offset: 0x38C */
       uint8_t RESERVED_21[4];
  __IO uint32_t ADC0CLKDIV;                        /**< ADC0 clock divider, offset: 0x394 */
  __IO uint32_t USB0CLKDIV;                        /**< USB0-FS Clock divider, offset: 0x398 */
       uint8_t RESERVED_22[16];
  __IO uint32_t MCLKDIV;                           /**< I2S MCLK clock divider, offset: 0x3AC */
       uint8_t RESERVED_23[4];
  __IO uint32_t SCTCLKDIV;                         /**< SCT/PWM clock divider, offset: 0x3B4 */
       uint8_t RESERVED_24[12];
  __IO uint32_t PLLCLKDIV;                         /**< PLL clock divider, offset: 0x3C4 */
       uint8_t RESERVED_25[8];
  __IO uint32_t CTIMERCLKDIV[5];                   /**< CTimer 0 clock divider..CTimer 4 clock divider, array offset: 0x3D0, array step: 0x4 */
       uint8_t RESERVED_26[24];
  __IO uint32_t CLKUNLOCK;                         /**< Clock configuration unlock, offset: 0x3FC */
  __IO uint32_t FMCCR;                             /**< FMC configuration, offset: 0x400 */
  __IO uint32_t ROMCR;                             /**< ROM wait state, offset: 0x404 */
       uint8_t RESERVED_27[4];
  __IO uint32_t USB0NEEDCLKCTRL;                   /**< USB0-FS need clock control, offset: 0x40C */
  __I  uint32_t USB0NEEDCLKSTAT;                   /**< USB0-FS need clock status, offset: 0x410 */
  __IO uint32_t EZHINT;                            /**< EZH interrupt hijack, offset: 0x414 */
       uint8_t RESERVED_28[4];
  __O  uint32_t FMCFLUSH;                          /**< FMC flush control, offset: 0x41C */
  __IO uint32_t MCLKIO;                            /**< MCLK control, offset: 0x420 */
       uint8_t RESERVED_29[64];
  __IO uint32_t ADC1CLKSEL;                        /**< ADC1 clock source select, offset: 0x464 */
  __IO uint32_t ADC1CLKDIV;                        /**< ADC1 clock divider, offset: 0x468 */
       uint8_t RESERVED_30[4];
  __IO uint32_t RAM_INTERLEAVE;                    /**< Control RAM interleave integration, offset: 0x470 */
       uint8_t RESERVED_31[28];
  struct {                                         /* offset: 0x490, array step: 0x8 */
    __IO uint32_t CLKSEL;                            /**< DAC0 functional clock selection..DAC2 functional clock selection, array offset: 0x490, array step: 0x8 */
    __IO uint32_t CLKDIV;                            /**< DAC0 functional clock divider..DAC2 functional clock divider, array offset: 0x494, array step: 0x8 */
  } DAC[3];
  __IO uint32_t FLEXSPICLKSEL;                     /**< FLEXSPI clock selection, offset: 0x4A8 */
  __IO uint32_t FLEXSPICLKDIV;                     /**< FLEXSPI clock divider, offset: 0x4AC */
  __IO uint32_t CDPA_ENABLE;                       /**< Enable protection, offset: 0x4B0 */
  __IO uint32_t CDPA_ENABLE_DP;                    /**< Enable protection duplicate, offset: 0x4B4 */
  __IO uint32_t CDPA_CONFIG;                       /**< CDPA base address, offset: 0x4B8 */
       uint8_t RESERVED_32[20];
  __IO uint32_t FLASH_HIDING_LOCKOUT_ADDR;         /**< Flash hiding lockout address, offset: 0x4D0 */
  __IO uint32_t FLASH_HIDING_BASE_ADDR;            /**< Flash hiding base address, offset: 0x4D4 */
  __IO uint32_t FLASH_HIDING_BASE_DP_ADDR;         /**< Flash hiding base DP address, offset: 0x4D8 */
  __IO uint32_t FLASH_HIDING_SIZE_ADDR;            /**< Hiding size address, offset: 0x4DC */
  __IO uint32_t FLASH_HIDING_SIZE_DP_ADDR;         /**< Hiding size DP address, offset: 0x4E0 */
       uint8_t RESERVED_33[72];
  __IO uint32_t PLLCLKDIVSEL;                      /**< PLL clock divider clock selection, offset: 0x52C */
  __IO uint32_t I3CFCLKSEL;                        /**< I3C functional clock selection, offset: 0x530 */
  __IO uint32_t I3CFCLKSTCSEL;                     /**< I3C FCLK_STC clock selection, offset: 0x534 */
  __IO uint32_t I3CFCLKSTCDIV;                     /**< I3C FCLK_STC clock divider, offset: 0x538 */
  __IO uint32_t I3CFCLKSDIV;                       /**< I3C FCLKS clock divider, offset: 0x53C */
  __IO uint32_t I3CFCLKDIV;                        /**< I3C FCLK divider, offset: 0x540 */
  __IO uint32_t I3CFCLKSSEL;                       /**< I3C FCLK_S selection, offset: 0x544 */
  __IO uint32_t DMICFCLKSEL;                       /**< DMIC clock selection, offset: 0x548 */
  __IO uint32_t DMICFCLKDIV;                       /**< DMIC clock division, offset: 0x54C */
       uint8_t RESERVED_34[16];
  __IO uint32_t PLL1CTRL;                          /**< PLL1 550m control, offset: 0x560 */
  __I  uint32_t PLL1STAT;                          /**< PLL1 550m status, offset: 0x564 */
  __IO uint32_t PLL1NDEC;                          /**< PLL1 550m N divider, offset: 0x568 */
  __IO uint32_t PLL1MDEC;                          /**< PLL1 550m M divider, offset: 0x56C */
  __IO uint32_t PLL1PDEC;                          /**< PLL1 550m P divider, offset: 0x570 */
       uint8_t RESERVED_35[12];
  __IO uint32_t PLL0CTRL;                          /**< PLL0 550m control, offset: 0x580 */
  __I  uint32_t PLL0STAT;                          /**< PLL0 550m status, offset: 0x584 */
  __IO uint32_t PLL0NDEC;                          /**< PLL0 550m N divider, offset: 0x588 */
  __IO uint32_t PLL0PDEC;                          /**< PLL0 550m P divider, offset: 0x58C */
  __IO uint32_t PLL0SSCG0;                         /**< PLL0 Spread Spectrum control 0, offset: 0x590 */
  __IO uint32_t PLL0SSCG1;                         /**< PLL0 Spread Spectrum control 1, offset: 0x594 */
       uint8_t RESERVED_36[56];
  __IO uint32_t DAC_ISO_CTRL;                      /**< DAC Isolation Control, offset: 0x5D0 */
       uint8_t RESERVED_37[172];
  __IO uint32_t STARTER[4];                        /**< Start logic wake-up enable, array offset: 0x680, array step: 0x4 */
       uint8_t RESERVED_38[16];
  __IO uint32_t STARTERSET[4];                     /**< Set bits in STARTER, array offset: 0x6A0, array step: 0x4 */
       uint8_t RESERVED_39[16];
  __O  uint32_t STARTERCLR[2];                     /**< Clear bits in STARTER, array offset: 0x6C0, array step: 0x4 */
       uint8_t RESERVED_40[60];
  __IO uint32_t FUNCRETENTIONCTRL;                 /**< Functional retention control, offset: 0x704 */
       uint8_t RESERVED_41[120];
  __IO uint32_t HARDWARESLEEP;                     /**< Hardware Sleep control, offset: 0x780 */
       uint8_t RESERVED_42[136];
  __I  uint32_t CPUSTAT;                           /**< CPU Status, offset: 0x80C */
       uint8_t RESERVED_43[20];
  __IO uint32_t LPCAC_CTRL;                        /**< LPCAC control, offset: 0x824 */
       uint8_t RESERVED_44[4];
  __IO uint32_t FC32KCLKSEL;                       /**< Flexcomm 32K clock select, offset: 0x82C */
  __IO uint32_t FRGCLKSEL[8];                      /**< FRG Clock Source Select, array offset: 0x830, array step: 0x4 */
  __IO uint32_t FLEXCOMMCLKDIV[8];                 /**< Flexcomm clock divider, array offset: 0x850, array step: 0x4 */
       uint8_t RESERVED_45[280];
  __IO uint32_t CSS_TEMPORAL_STATE;                /**< CSS temporal state, offset: 0x988 */
  __IO uint32_t CSS_KDF_MASK;                      /**< Key derivation function mask, offset: 0x98C */
  __IO uint32_t CSS_FEATURE0;                      /**< CSS command feature, offset: 0x990 */
  __IO uint32_t CSS_FEATURE1;                      /**< CSS command feature, offset: 0x994 */
  __IO uint32_t CSS_FEATURE0_DP;                   /**< CSS command feature - duplicate version, offset: 0x998 */
  __IO uint32_t CSS_FEATURE1_DP;                   /**< CSS command feature - duplicate version, offset: 0x99C */
       uint8_t RESERVED_46[4];
  __IO uint32_t CSS_BOOT_RETRY_CNT;                /**< CSS boot retry counter, offset: 0x9A4 */
       uint8_t RESERVED_47[8];
  __IO uint32_t CSS_CLK_CTRL;                      /**< CSS clock control, offset: 0x9B0 */
  __O  uint32_t CSS_CLK_CTRL_SET;                  /**< CSS clock control set, offset: 0x9B4 */
  __O  uint32_t CSS_CLK_CTRL_CLR;                  /**< CSS clock control clear, offset: 0x9B8 */
  __IO uint32_t CSS_CLK_SEL;                       /**< CSS clock select, offset: 0x9BC */
       uint8_t RESERVED_48[16];
  __I  uint32_t CSS_AS_CFG0;                       /**< CSS AS configuration, offset: 0x9D0 */
  __I  uint32_t CSS_AS_CFG1;                       /**< CSS AS configuration1, offset: 0x9D4 */
  __I  uint32_t CSS_AS_CFG2;                       /**< CSS AS configuration2, offset: 0x9D8 */
       uint8_t RESERVED_49[4];
  __I  uint32_t CSS_AS_ST0;                        /**< CSS AS state register, offset: 0x9E0 */
  __I  uint32_t CSS_AS_ST1;                        /**< CSS AS state1, offset: 0x9E4 */
  __I  uint32_t CSS_AS_ST2;                        /**< CSS AS state2, offset: 0x9E8 */
       uint8_t RESERVED_50[4];
  __I  uint32_t CSS_AS_FLAG0;                      /**< CSS AS flag0, offset: 0x9F0 */
       uint8_t RESERVED_51[36];
  __IO uint32_t CLOCK_CTRL;                        /**< Clock Control, offset: 0xA18 */
       uint8_t RESERVED_52[244];
  __IO uint32_t COMP_INT_CTRL;                     /**< Comparator Interrupt control, offset: 0xB10 */
  __I  uint32_t COMP_INT_STATUS;                   /**< Comparator Interrupt status, offset: 0xB14 */
       uint8_t RESERVED_53[748];
  __IO uint32_t AUTOCLKGATEOVERRIDE;               /**< Control automatic clock gating, offset: 0xE04 */
  __IO uint32_t GPIOPSYNC;                         /**< GPIO Synchronization, offset: 0xE08 */
       uint8_t RESERVED_54[24];
  __IO uint32_t AUTOCLKGATEOVERRIDE1;              /**< Control automatic clock gating, offset: 0xE24 */
       uint8_t RESERVED_55[8];
  __IO uint32_t ENABLE_MEM_PARITY_ECC_CHECK;       /**< Memory parity ECC enable, offset: 0xE30 */
  __I  uint32_t MEM_PARITY_ECC_ERROR_FLAG;         /**< Memory parity ECC error flag, offset: 0xE34 */
  __IO uint32_t PWM0SUBCTL;                        /**< PWM0 submodule control, offset: 0xE38 */
  __IO uint32_t PWM1SUBCTL;                        /**< PWM1 submodule control, offset: 0xE3C */
  __IO uint32_t CTIMERGLOBALSTARTEN;               /**< CTIMER global start enable, offset: 0xE40 */
       uint8_t RESERVED_56[348];
  __IO uint32_t DEBUG_LOCK_EN;                     /**< Control write access to security, offset: 0xFA0 */
  __IO uint32_t DEBUG_FEATURES;                    /**< Cortex debug features control, offset: 0xFA4 */
  __IO uint32_t DEBUG_FEATURES_DP;                 /**< Cortex debug features control (duplicate), offset: 0xFA8 */
       uint8_t RESERVED_57[8];
  __IO uint32_t SWD_ACCESS_CPU[1];                 /**< CPU0 Software Debug Access, array offset: 0xFB4, array step: 0x4 */
       uint8_t RESERVED_58[8];
  __IO uint32_t DEBUG_AUTH_BEACON;                 /**< Debug authentication BEACON, offset: 0xFC0 */
  __IO uint32_t SWD_ACCESS_DSP;                    /**< DSP Software Debug Access, offset: 0xFC4 */
       uint8_t RESERVED_59[44];
       uint32_t DEVICE_TYPE;                       /**< Device type, offset: 0xFF4 */
  __I  uint32_t DEVICE_ID0;                        /**< Device ID, offset: 0xFF8 */
  __I  uint32_t DIEID;                             /**< Chip revision ID and Number, offset: 0xFFC */
} SYSCON_Type;

/* ----------------------------------------------------------------------------
   -- SYSCON Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCON_Register_Masks SYSCON Register Masks
 * @{
 */

/*! @name MEMORYREMAP - Memory Remap Control */
/*! @{ */

#define SYSCON_MEMORYREMAP_MAP_MASK              (0x3U)
#define SYSCON_MEMORYREMAP_MAP_SHIFT             (0U)
/*! MAP - Select the location of the vector table:
 *  0b00..Vector Table in ROM.
 *  0b01..Vector Table in RAM.
 *  0b1x..Vector Table in Flash.
 */
#define SYSCON_MEMORYREMAP_MAP(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_MEMORYREMAP_MAP_SHIFT)) & SYSCON_MEMORYREMAP_MAP_MASK)
/*! @} */

/*! @name AHBMATPRIO - AHB Matrix priority control */
/*! @{ */

#define SYSCON_AHBMATPRIO_PRI_CPU0_CBUS_MASK     (0x3U)
#define SYSCON_AHBMATPRIO_PRI_CPU0_CBUS_SHIFT    (0U)
/*! PRI_CPU0_CBUS - CPU0 C-AHB bus.
 */
#define SYSCON_AHBMATPRIO_PRI_CPU0_CBUS(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBMATPRIO_PRI_CPU0_CBUS_SHIFT)) & SYSCON_AHBMATPRIO_PRI_CPU0_CBUS_MASK)

#define SYSCON_AHBMATPRIO_PRI_CPU0_SBUS_MASK     (0xCU)
#define SYSCON_AHBMATPRIO_PRI_CPU0_SBUS_SHIFT    (2U)
/*! PRI_CPU0_SBUS - CPU0 S-AHB bus.
 */
#define SYSCON_AHBMATPRIO_PRI_CPU0_SBUS(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBMATPRIO_PRI_CPU0_SBUS_SHIFT)) & SYSCON_AHBMATPRIO_PRI_CPU0_SBUS_MASK)

#define SYSCON_AHBMATPRIO_PRI_USB_FSD_MASK       (0x300U)
#define SYSCON_AHBMATPRIO_PRI_USB_FSD_SHIFT      (8U)
/*! PRI_USB_FSD - USB0-FS Device.(USB0)
 */
#define SYSCON_AHBMATPRIO_PRI_USB_FSD(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBMATPRIO_PRI_USB_FSD_SHIFT)) & SYSCON_AHBMATPRIO_PRI_USB_FSD_MASK)

#define SYSCON_AHBMATPRIO_PRI_SDMA0_MASK         (0xC00U)
#define SYSCON_AHBMATPRIO_PRI_SDMA0_SHIFT        (10U)
/*! PRI_SDMA0 - DMA0 controller priority.
 */
#define SYSCON_AHBMATPRIO_PRI_SDMA0(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBMATPRIO_PRI_SDMA0_SHIFT)) & SYSCON_AHBMATPRIO_PRI_SDMA0_MASK)

