RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/LPC55S36.h
#define SYSCON_STARTERSET_CTIMER2_SET_MASK       (0x10U)
#define SYSCON_STARTERSET_CTIMER2_SET_SHIFT      (4U)
/*! CTIMER2_SET - Writing ones to this register sets the corresponding bit in the STARTER1 register.
 */
#define SYSCON_STARTERSET_CTIMER2_SET(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_CTIMER2_SET_SHIFT)) & SYSCON_STARTERSET_CTIMER2_SET_MASK)

#define SYSCON_STARTERSET_FLEXPWM1_COMPARE3_SET_MASK (0x10U)
#define SYSCON_STARTERSET_FLEXPWM1_COMPARE3_SET_SHIFT (4U)
/*! FLEXPWM1_COMPARE3_SET - Writing ones to this register sets the corresponding bit in the STARTER3 register.
 */
#define SYSCON_STARTERSET_FLEXPWM1_COMPARE3_SET(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_FLEXPWM1_COMPARE3_SET_SHIFT)) & SYSCON_STARTERSET_FLEXPWM1_COMPARE3_SET_MASK)

#define SYSCON_STARTERSET_GPIO_INT00_SET_MASK    (0x10U)
#define SYSCON_STARTERSET_GPIO_INT00_SET_SHIFT   (4U)
/*! GPIO_INT00_SET - Writing ones to this register sets the corresponding bit in the STARTER0 register.
 */
#define SYSCON_STARTERSET_GPIO_INT00_SET(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_GPIO_INT00_SET_SHIFT)) & SYSCON_STARTERSET_GPIO_INT00_SET_MASK)

#define SYSCON_STARTERSET_CTIMER4_SET_MASK       (0x20U)
#define SYSCON_STARTERSET_CTIMER4_SET_SHIFT      (5U)
/*! CTIMER4_SET - Writing ones to this register sets the corresponding bit in the STARTER1 register.
 */
#define SYSCON_STARTERSET_CTIMER4_SET(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_CTIMER4_SET_SHIFT)) & SYSCON_STARTERSET_CTIMER4_SET_MASK)

#define SYSCON_STARTERSET_FLEXPWM1_RELOAD3_SET_MASK (0x20U)
#define SYSCON_STARTERSET_FLEXPWM1_RELOAD3_SET_SHIFT (5U)
/*! FLEXPWM1_RELOAD3_SET - Writing ones to this register sets the corresponding bit in the STARTER3 register.
 */
#define SYSCON_STARTERSET_FLEXPWM1_RELOAD3_SET(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_FLEXPWM1_RELOAD3_SET_SHIFT)) & SYSCON_STARTERSET_FLEXPWM1_RELOAD3_SET_MASK)

#define SYSCON_STARTERSET_GPIO_INT01_SET_MASK    (0x20U)
#define SYSCON_STARTERSET_GPIO_INT01_SET_SHIFT   (5U)
/*! GPIO_INT01_SET - Writing ones to this register sets the corresponding bit in the STARTER0 register.
 */
#define SYSCON_STARTERSET_GPIO_INT01_SET(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_GPIO_INT01_SET_SHIFT)) & SYSCON_STARTERSET_GPIO_INT01_SET_MASK)

#define SYSCON_STARTERSET_ENC0_COMPARE_SET_MASK  (0x40U)
#define SYSCON_STARTERSET_ENC0_COMPARE_SET_SHIFT (6U)
/*! ENC0_COMPARE_SET - Writing ones to this register sets the corresponding bit in the STARTER3 register.
 */
#define SYSCON_STARTERSET_ENC0_COMPARE_SET(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_ENC0_COMPARE_SET_SHIFT)) & SYSCON_STARTERSET_ENC0_COMPARE_SET_MASK)

#define SYSCON_STARTERSET_GPIO_INT02_SET_MASK    (0x40U)
#define SYSCON_STARTERSET_GPIO_INT02_SET_SHIFT   (6U)
/*! GPIO_INT02_SET - Writing ones to this register sets the corresponding bit in the STARTER0 register.
 */
#define SYSCON_STARTERSET_GPIO_INT02_SET(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_GPIO_INT02_SET_SHIFT)) & SYSCON_STARTERSET_GPIO_INT02_SET_MASK)

#define SYSCON_STARTERSET_OS_EVENT_SET_MASK      (0x40U)
#define SYSCON_STARTERSET_OS_EVENT_SET_SHIFT     (6U)
/*! OS_EVENT_SET - Writing ones to this register sets the corresponding bit in the STARTER1 register.
 */
#define SYSCON_STARTERSET_OS_EVENT_SET(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_OS_EVENT_SET_SHIFT)) & SYSCON_STARTERSET_OS_EVENT_SET_MASK)

#define SYSCON_STARTERSET_ENC0_HOME_SET_MASK     (0x80U)
#define SYSCON_STARTERSET_ENC0_HOME_SET_SHIFT    (7U)
/*! ENC0_HOME_SET - Writing ones to this register sets the corresponding bit in the STARTER3 register.
 */
#define SYSCON_STARTERSET_ENC0_HOME_SET(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_ENC0_HOME_SET_SHIFT)) & SYSCON_STARTERSET_ENC0_HOME_SET_MASK)

#define SYSCON_STARTERSET_GPIO_INT03_SET_MASK    (0x80U)
#define SYSCON_STARTERSET_GPIO_INT03_SET_SHIFT   (7U)
/*! GPIO_INT03_SET - Writing ones to this register sets the corresponding bit in the STARTER0 register.
 */
#define SYSCON_STARTERSET_GPIO_INT03_SET(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_GPIO_INT03_SET_SHIFT)) & SYSCON_STARTERSET_GPIO_INT03_SET_MASK)

#define SYSCON_STARTERSET_ENC0_WDG_SET_MASK      (0x100U)
#define SYSCON_STARTERSET_ENC0_WDG_SET_SHIFT     (8U)
/*! ENC0_WDG_SET - Writing ones to this register sets the corresponding bit in the STARTER3 register.
 */
#define SYSCON_STARTERSET_ENC0_WDG_SET(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_ENC0_WDG_SET_SHIFT)) & SYSCON_STARTERSET_ENC0_WDG_SET_MASK)

#define SYSCON_STARTERSET_UTICK0_SET_MASK        (0x100U)
#define SYSCON_STARTERSET_UTICK0_SET_SHIFT       (8U)
/*! UTICK0_SET - Writing ones to this register sets the corresponding bit in the STARTER0 register.
 */
#define SYSCON_STARTERSET_UTICK0_SET(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_UTICK0_SET_SHIFT)) & SYSCON_STARTERSET_UTICK0_SET_MASK)

#define SYSCON_STARTERSET_ENC0_IDX_SET_MASK      (0x200U)
#define SYSCON_STARTERSET_ENC0_IDX_SET_SHIFT     (9U)
/*! ENC0_IDX_SET - Writing ones to this register sets the corresponding bit in the STARTER3 register.
 */
#define SYSCON_STARTERSET_ENC0_IDX_SET(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_ENC0_IDX_SET_SHIFT)) & SYSCON_STARTERSET_ENC0_IDX_SET_MASK)

#define SYSCON_STARTERSET_MRT0_SET_MASK          (0x200U)
#define SYSCON_STARTERSET_MRT0_SET_SHIFT         (9U)
/*! MRT0_SET - Writing ones to this register sets the corresponding bit in the STARTER0 register.
 */
#define SYSCON_STARTERSET_MRT0_SET(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_MRT0_SET_SHIFT)) & SYSCON_STARTERSET_MRT0_SET_MASK)

#define SYSCON_STARTERSET_CTIMER0_SET_MASK       (0x400U)
#define SYSCON_STARTERSET_CTIMER0_SET_SHIFT      (10U)
/*! CTIMER0_SET - Writing ones to this register sets the corresponding bit in the STARTER0 register.
 */
#define SYSCON_STARTERSET_CTIMER0_SET(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_CTIMER0_SET_SHIFT)) & SYSCON_STARTERSET_CTIMER0_SET_MASK)

#define SYSCON_STARTERSET_DAC0_SET_MASK          (0x400U)
#define SYSCON_STARTERSET_DAC0_SET_SHIFT         (10U)
/*! DAC0_SET - Writing ones to this register sets the corresponding bit in the STARTER2 register.
 */
#define SYSCON_STARTERSET_DAC0_SET(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_DAC0_SET_SHIFT)) & SYSCON_STARTERSET_DAC0_SET_MASK)

#define SYSCON_STARTERSET_ENC1_COMPARE_SET_MASK  (0x400U)
#define SYSCON_STARTERSET_ENC1_COMPARE_SET_SHIFT (10U)
/*! ENC1_COMPARE_SET - Writing ones to this register sets the corresponding bit in the STARTER3 register.
 */
#define SYSCON_STARTERSET_ENC1_COMPARE_SET(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_ENC1_COMPARE_SET_SHIFT)) & SYSCON_STARTERSET_ENC1_COMPARE_SET_MASK)

#define SYSCON_STARTERSET_CTIMER1_SET_MASK       (0x800U)
#define SYSCON_STARTERSET_CTIMER1_SET_SHIFT      (11U)
/*! CTIMER1_SET - Writing ones to this register sets the corresponding bit in the STARTER0 register.
 */
#define SYSCON_STARTERSET_CTIMER1_SET(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_CTIMER1_SET_SHIFT)) & SYSCON_STARTERSET_CTIMER1_SET_MASK)

#define SYSCON_STARTERSET_DAC1_SET_MASK          (0x800U)
#define SYSCON_STARTERSET_DAC1_SET_SHIFT         (11U)
/*! DAC1_SET - Writing ones to this register sets the corresponding bit in the STARTER2 register.
 */
#define SYSCON_STARTERSET_DAC1_SET(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_DAC1_SET_SHIFT)) & SYSCON_STARTERSET_DAC1_SET_MASK)

#define SYSCON_STARTERSET_ENC1_HOME_SET_MASK     (0x800U)
#define SYSCON_STARTERSET_ENC1_HOME_SET_SHIFT    (11U)
/*! ENC1_HOME_SET - Writing ones to this register sets the corresponding bit in the STARTER3 register.
 */
#define SYSCON_STARTERSET_ENC1_HOME_SET(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_ENC1_HOME_SET_SHIFT)) & SYSCON_STARTERSET_ENC1_HOME_SET_MASK)

#define SYSCON_STARTERSET_DAC2_SET_MASK          (0x1000U)
#define SYSCON_STARTERSET_DAC2_SET_SHIFT         (12U)
/*! DAC2_SET - Writing ones to this register sets the corresponding bit in the STARTER2 register.
 */
#define SYSCON_STARTERSET_DAC2_SET(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_DAC2_SET_SHIFT)) & SYSCON_STARTERSET_DAC2_SET_MASK)

#define SYSCON_STARTERSET_ENC1_WDG_SET_MASK      (0x1000U)
#define SYSCON_STARTERSET_ENC1_WDG_SET_SHIFT     (12U)
/*! ENC1_WDG_SET - Writing ones to this register sets the corresponding bit in the STARTER3 register.
 */
#define SYSCON_STARTERSET_ENC1_WDG_SET(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_ENC1_WDG_SET_SHIFT)) & SYSCON_STARTERSET_ENC1_WDG_SET_MASK)

#define SYSCON_STARTERSET_SCT0_SET_MASK          (0x1000U)
#define SYSCON_STARTERSET_SCT0_SET_SHIFT         (12U)
/*! SCT0_SET - Writing ones to this register sets the corresponding bit in the STARTER0 register.
 */
#define SYSCON_STARTERSET_SCT0_SET(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_SCT0_SET_SHIFT)) & SYSCON_STARTERSET_SCT0_SET_MASK)

#define SYSCON_STARTERSET_CTIMER3_SET_MASK       (0x2000U)
#define SYSCON_STARTERSET_CTIMER3_SET_SHIFT      (13U)
/*! CTIMER3_SET - Writing ones to this register sets the corresponding bit in the STARTER0 register.
 */
#define SYSCON_STARTERSET_CTIMER3_SET(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_CTIMER3_SET_SHIFT)) & SYSCON_STARTERSET_CTIMER3_SET_MASK)

#define SYSCON_STARTERSET_ENC1_IDX_SET_MASK      (0x2000U)
#define SYSCON_STARTERSET_ENC1_IDX_SET_SHIFT     (13U)
/*! ENC1_IDX_SET - Writing ones to this register sets the corresponding bit in the STARTER3 register.
 */
#define SYSCON_STARTERSET_ENC1_IDX_SET(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_ENC1_IDX_SET_SHIFT)) & SYSCON_STARTERSET_ENC1_IDX_SET_MASK)

#define SYSCON_STARTERSET_HS_CMP0_SET_MASK       (0x2000U)
#define SYSCON_STARTERSET_HS_CMP0_SET_SHIFT      (13U)
/*! HS_CMP0_SET - Writing ones to this register sets the corresponding bit in the STARTER2 register.
 */
#define SYSCON_STARTERSET_HS_CMP0_SET(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_HS_CMP0_SET_SHIFT)) & SYSCON_STARTERSET_HS_CMP0_SET_MASK)

#define SYSCON_STARTERSET_FLEXINT0_SET_MASK      (0x4000U)
#define SYSCON_STARTERSET_FLEXINT0_SET_SHIFT     (14U)
/*! FLEXINT0_SET - Writing ones to this register sets the corresponding bit in the STARTER0 register.
 */
#define SYSCON_STARTERSET_FLEXINT0_SET(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_FLEXINT0_SET_SHIFT)) & SYSCON_STARTERSET_FLEXINT0_SET_MASK)

#define SYSCON_STARTERSET_HS_CMP1_SET_MASK       (0x4000U)
#define SYSCON_STARTERSET_HS_CMP1_SET_SHIFT      (14U)
/*! HS_CMP1_SET - Writing ones to this register sets the corresponding bit in the STARTER2 register.
 */
#define SYSCON_STARTERSET_HS_CMP1_SET(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_HS_CMP1_SET_SHIFT)) & SYSCON_STARTERSET_HS_CMP1_SET_MASK)

#define SYSCON_STARTERSET_ITRC_SET_MASK          (0x4000U)
#define SYSCON_STARTERSET_ITRC_SET_SHIFT         (14U)
/*! ITRC_SET - Writing ones to this register sets the corresponding bit in the STARTER3 register.
 */
#define SYSCON_STARTERSET_ITRC_SET(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_STARTERSET_ITRC_SET_SHIFT)) & SYSCON_STARTERSET_ITRC_SET_MASK)

